{
  "updated": "2026-01-20 17:55:18",
  "total_articles": 50,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Snow Industry News",
      "title": "Vail Resorts Reports Certain Ski Season Metrics For The Season-To-Date Period Ended January 4, 2026, Visits Down 20%",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-january-4-2026-visits-down-20/",
      "content": "Vail Resorts, Inc. has reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025. The reported ski season metrics are for the Company's North American destination mountain resorts and regional ski areas, excluding the results of the Australian and European resorts and ski areas. The data mentioned in this release is interim period data and is subject to fiscal quarter end review and adjustments. Season-to-date total skier visits were down 20.0% compared to the prior year period.Season-to-date total lift revenue, including an allocated portion of season pass revenue for each applicable period, was down 1.8% compared to the prior year period. Season-to-date ski school revenue was down 14.9% and dining revenue was down 15.9% compared to the prior year period. Retail/rental revenue for North American resort and ski area store locations was down 6.0% compared to the prior year period. Comme",
      "pub_date": "2026-01-20",
      "id": "d0cddf4bb564",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "winter-sports",
        "international",
        "resort-operations"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Unofficial Networks",
      "title": "German Ski Instructor Confirms Japan Fully Lives Up To The Hype",
      "url": "https://unofficialnetworks.com/2026/01/20/german-ski-instructor-confirms-japan-fully-lives-up-to-the-hype/",
      "description": "Quast's journey began in Tokyo before hopping in a rental car and making his way to Hakuba Happo-One, arguably the most famous ski resort in the region.",
      "content": "German ski instructor turned social media influencer Marius Quast has gained a substantial following reviewing ski resorts across Europe. In his latest video he made his first sojourn to Japan to see if skiing the Hakuba Valley will live up to its legendary status. Quast’s journey began in Tokyo before hopping in a rental car and making his way to Hakuba Happo-One , arguably the most famous ski resort in the region. Happo-One played host to the 1998 Winter Olympics and is considered the most alpine area in the Hakuba Valley with long runs, challenging slopes, a true alpine feel. Quast then popped over to Hakuba Cortina famous for its dense forest and deep powder, otherwise known as called Japow. The juxtaposition of the mountains is notable and its well worth checking both out for yourself. Beyond the incredible skiing, Quast was taken back by the Japanese society and culture: “Japan feels different. Calmer. More structured. More respectful. And at the same time, incredibly fascinating",
      "pub_date": "2026-01-20",
      "id": "a7be643c3b96",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Unofficial Networks",
      "title": "40 Evacuated After Chairlift Malfunction in Minnesota",
      "url": "https://unofficialnetworks.com/2026/01/20/40-evacuated-after-chairlift-malfunction-in-minnesota/",
      "description": "Rescuers focused on getting kids and more vulnerable people down first before fully evacuating the 40+ stranded guests.",
      "content": "Dozens of skiers and snowboarders were treated to complimentary pizza and hot chocolate after requiring evacuation from a chairlift at Lutsen Mountains in northern Minnesota in the midst of bitter cold and windy conditions. Bring Me The News reports fire crews and ski patrol responded to scene at around 9:30am on Saturday morning when the chairlift malfunctioned in 56+mph winds and subzero temperatures. Rescuers focused on getting kids and more vulnerable people down first before fully evacuating the 40+ stranded guests. “Three crews went to work once it was determined the lift was not a quick fix. One patrol group from the bottom, the fire department and lift ops in the middle over the road with a ladder truck and glider chairs, and another patrol group from the top. With the persistent high winds that picked up further, there were great challenges shooting the rope between the lift wires and over the cable.” – Andrew Schultz The rescue operation lasted around 5 hours with some guests",
      "pub_date": "2026-01-20",
      "id": "1c13fc57d850",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "hospitality",
        "transportation"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Ski Area Management",
      "title": "Snowvana Adds New England to 2026 Lineup",
      "url": "https://www.saminfo.com/news/sam-headline-news/snowvana-adds-new-england-to-2026-lineup",
      "description": "SAM Magazine—Bend, Ore., Jan. 20, 2026— Snowvana will make its East Coast debut when the consumer ski and snowboard expo comes to the Royal Plaza Trade Center in Marlborough, Mass., just outside Boston, Nov. 6-8, 2026. The show will be held in four locations this year including Seattle (Oct. 16-18), Portland, Ore. (Oct. 23-25), and Wisconsin (Nov. 13-15). Founded in 2016, Snowvana welcomes skiers and riders to explore offerings from various regional ski resorts, a gear sale and ski swap, live mu",
      "content": "SAM Magazine—Bend, Ore., Jan. 20, 2026— Snowvana will make its East Coast debut when the consumer ski and snowboard expo comes to the Royal Plaza Trade Center in Marlborough, Mass., just outside Boston, Nov. 6-8, 2026. The show will be held in four locations this year including Seattle (Oct. 16-18), Portland, Ore. (Oct. 23-25), and Wisconsin (Nov. 13-15). Founded in 2016, Snowvana welcomes skiers and riders to explore offerings from various regional ski resorts, a gear sale and ski swap, live mu",
      "pub_date": "2026-01-20",
      "id": "55c620afe3f8",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Unofficial Networks",
      "title": "You Really Don’t Want To Fall On The Steepest Ski Trail In The United States",
      "url": "https://unofficialnetworks.com/2026/01/20/steepest-man-made-ski-trail-fall/",
      "description": "This is what it looks like to fall on Rambo, the steepest man-made tree-cut ski trail in the United States.",
      "content": "There are a lot of notoriously steep ski trails int he United States, but no man-made/tree-cut ski run in the country can beat Rambo at Crested Butte Mountain Resort . As the steepest in-bound tree-cut run, Rambo offers a consistent 55-degree pitch with exposed rocks, trees, and major moguls. If the features weren’t enough to make you turn away, know that even the resort’s ski patrol often admits that the conditions are basically never good. With all that combined, you can probably imagine that wiping out isn’t the best move, but this video really makes it evident. A wipeout on Rambo often means sliding all the way to the bottom, potentially losing your skis and requiring a hike back up in the process. If you’re hoping to hit the steepest man-made run in the United States, make sure you understand your limits and do so with caution. Once you start, there’s very little ability to bail. Skier Deploys Parachute After Jumping Off Massive Cliff Near Lake Tahoe Categories: Crested Butte Colo",
      "pub_date": "2026-01-20",
      "id": "c7a62a4aa9d7",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "transportation",
        "resort-operations"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Snow Industry News",
      "title": "Le Massif Cancels Remainder Of 2026 Ski Season Amid Labor Dispute",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/le-massif-cancels-remainder-of-2026-ski-season-amid-labor-dispute/",
      "content": "Le Massif de Charlevoix has announced it will not reopen for the remainder of the 2025-26 ski season, citing an impasse in contract negotiations with its unionized workforce that has been on strike since early January. The decision comes after 300 employees represented by the Syndicat des travailleuses et travailleurs du Massif rejected both a final contract offer and a management proposal to submit the dispute to binding arbitration. The resort, considered one of eastern North America's premier ski destinations, had warned that continuing operations beyond the end of January would be impossible without a resolution. The final decision came after the Syndicat des travailleuses et travailleurs du Massif (affiliated with the CSN) rejected management’s latest contract offer and a proposal to enter into binding arbitration. According to Groupe Le Massif, the timing was critical. Management stated that a return to work was required by January 20 to complete essential artificial snowmaking. ",
      "pub_date": "2026-01-20",
      "id": "8f0da297155c",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Unofficial Networks",
      "title": "Wisconsin Skier Sets Record For Longest Continuous Rope Tow Lap (16.5 Hours/218.79 Miles)",
      "url": "https://unofficialnetworks.com/2026/01/20/wisconsin-skier-sets-record-for-longest-continuous-rope-tow-lap-16-5-hours-218-79-miles/",
      "description": "28 participants began the challenge but only 15 spent the full 16.5 hours riding the Valhalla rope tow.",
      "content": "Dresser, WI — On January, 9th, 2026 skiers and snowboarders up in Wisconsin set out on a unique challenge when they looped the legendary rope tow at Trollhaugen Ski Resort from 10:00am to 2:30am in what they have deemed the “Longest Lap” contest. 28 participants began the challenge but only 15 spent the full 16.5 hours riding the Valhalla rope tow. After full day of skiing that went well into the night, skier Nick Drye came out on top with an incredible 218.79 miles skied. While this achievement in endurance skiing and snowboarding was not officially recognized by Guinness World Records but the resort plans on getting an official adjudicator to witness the feat the next time they hold the event. Snowboarder Jayva Jordan scored 217.71 miles with 777 laps. Here is a quick recap of her ultra long day riding at The Troll: Longest Lap Results: OVERALL + TOP MEN’S SKI Nick Drye | 218.79 Miles TOP WOMEN’S SNOWBOARD Jayva Jordan | 217.71 Miles TOP MEN’S SNOWBOARD Kyle Kennedy | 214.41 Miles TO",
      "pub_date": "2026-01-20",
      "id": "897d7f4b6a7a",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [],
      "approved_date": "2026-01-20"
    },
    {
      "source": "SnowBrains",
      "title": "Mont Rigaud, Quebec, Report: Tapping Into Indy Pass Expansion in Eastern Canada",
      "url": "https://snowbrains.com/mont-rigaud-quebec-report-tapping-into-indy-pass-expansion-in-eastern-canada/",
      "description": "Report for January 13, 2026 This past week marked my first resort visit of the season. I like to start snowboarding as soon as the snow flies and the first chair spins in the Northeast—usually late November or December if we’re lucky. 2025-26, however, started with some hiccups: stolen passports and then the flu. Not exactly the ideal warm-up. C’est […] The post Mont Rigaud, Quebec, Report: Tapping Into Indy Pass Expansion in Eastern Canada appeared first on SnowBrains .",
      "content": "Top of the Quadruple Doppelmayr Chair at Mont Rigaud. | Image: J. Davis Report for January 13, 2026 This past week marked my first resort visit of the season. I like to start snowboarding as soon as the snow flies and the first chair spins in the Northeast—usually late November or December if we’re lucky. 2025-26, however, started with some hiccups: stolen passports and then the flu. Not exactly the ideal warm-up. C’est la vie. I’m beyond excited watching the incredible conditions stacking up just south of the border at Vermont’s Jay Peak Resort , which has populated the industry news for several weeks now. Jay is my adopted home from home, an Indy gem with early-season snow totals that are nothing short of legendary. I am patiently waiting for the Government of Canada to reissue our new passports so I can travel south to Vermont, New York, Maine, and New Hampshire. Gratefully, Indy Pass has continued to expand here on our home turf in southern Quebec. This season, Mont Sutton and Owl’",
      "pub_date": "2026-01-19",
      "id": "0d78124a5599",
      "prefilter_business_score": 1,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "canada",
        "business-investment"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "SnowBrains",
      "title": "Powder Mountain, UT, to Host Natural Selection Tour Super Sessions",
      "url": "https://snowbrains.com/powder-mountain-ut-to-host-natural-selection-tour-super-sessions/",
      "description": "In a major development for freeride skiing and snowboarding, Powder Mountain in Utah has been selected as a host of the new Super Sessions on Travis Rice’s Natural Selection Tour (NST)—one of the most progressive and athlete-driven freeride competition circuits in the world. Super Sessions are a new opening stage introduced for the 2026 season. These high-energy, collaborative events are […] The post Powder Mountain, UT, to Host Natural Selection Tour Super Sessions appeared first on SnowBrains ",
      "content": "Wolf Creek Canyon/DMI at Powder Mountain, UT. | Credit: Powder Mountain In a major development for freeride skiing and snowboarding, Powder Mountain in Utah has been selected as a host of the new Super Sessions on Travis Rice’s Natural Selection Tour (NST)—one of the most progressive and athlete-driven freeride competition circuits in the world. Super Sessions are a new opening stage introduced for the 2026 season. These high-energy, collaborative events are hosted across three iconic global destinations: the deep powder of Myōkō, Japan, the remote backcountry of British Columbia, and at Powder Mountain, Utah. Related: At Utah’s Powder Mountain Skiing Meets Sculpture as the Resort Unveils New Outdoor Art The announcement comes as an affirmation of Powder Mountain’s vast terrain, deep snowpack, and growing reputation as a premier freeriding destination. With terrain that stretches across some of the largest skiable acreage in North America and natural lines that challenge even the most ",
      "pub_date": "2026-01-19",
      "id": "c394386cdebc",
      "prefilter_business_score": 1,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations",
        "canada",
        "international"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Unofficial Networks",
      "title": "Quebec Ski Resort Will Close For The Season If No Agreement Reached With Union",
      "url": "https://unofficialnetworks.com/2026/01/19/le-massif-potential-closure/",
      "description": "Today, unionized workers voted against a proposed agreement that would have ended the strike at the Quebec ski resort.",
      "content": "Quebec — The season could end soon for one of Quebec’s (and Canada’s) best ski resorts. On January 2nd, workers at Le Massif voted to go on strike. The Massif Workers’ Union is part of the CSN. The workers are seeking better pay, more vacation and sick time, and better safety measures. In response, the ski resort shut down beginning on January 3rd. The ski resort reopened on January 6th, but only with limited terrain. This past weekend, the situation escalated by a couple of notches. In a press release shared to media outlets, Le Massif stated that if no deal is reached by January 20th, they will shut down operations for the 2025-26 season. “Le Massif de Charlevoix needs to know the position of the union and employees quickly. If there is no agreement, arbitration remains an option,” said Claude Choquette, President of Le Massif. “However, we must note that this solution shows that the employer is still unwilling to recognize the true value of our work or to make the necessary compromi",
      "pub_date": "2026-01-19",
      "id": "fc435871c57f",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "business-investment",
        "safety-incidents",
        "hospitality"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Unofficial Networks",
      "title": "Daniel Tosh Interviews Palisades Tahoe Snow Groomer",
      "url": "https://unofficialnetworks.com/2026/01/19/daniel-tosh-palisade-tahoe/",
      "description": "In a podcast episode of The Tosh Show, he interviews Bandit Ferrante, a lead snow groomer at Palisades Tahoe.",
      "content": "Tahoe — Did you know that comedian Daniel Tosh is an avid skier? One such example is his home, which is for sale and includes its own ski slopes. Then there’s the fact that he loves going to Palisades Tahoe. In this episode of the Tosh Show , he interviews Bandit Ferrante, Grooming Assistant Manager at Palisades Tahoe. Daniel Tosh actually asked many great questions to Bandit, as Ferrante is able to explain the complexities of his job. Even if you’re an avid skier or idler, you may learn a thing or two from the interview. PistenBully North America actually did a piece on Bandit in 2025, as it describes how he became such a tenured snow groomer. As of Monday, Palisades Tahoe has 251 trails and 24 lifts open. World’s Longest High-Speed Quad Chairlift Reopens For First Time Since 2024 Image/Video Credits: Tosh Show , PistenBully North America , Palisades Tahoe Categories: Non-Unofficial Videos Palisades Tahoe Videos",
      "pub_date": "2026-01-19",
      "id": "c8e46e7fbd70",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-01-20"
    },
    {
      "source": "Snow Industry News",
      "title": "U.S. Ski & Snowboard Returns to World Economic Forum In Davos, Bringing Business To The Slopes",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/us-ski-snowboard-returns-to-world-economic-forum-in-davos-bringing-business-to-the-slopes/",
      "content": "As global leaders convene in the Swiss Alps for the 2026 World Economic Forum (WEF), Jan. 19-23, 2026, U.S. Ski & Snowboard will once again be on the ground in Davos, taking business to the slopes of the Davos Klosters Mountains for the second year in a row just before the Olympic Winter Games kick off in Milano Cortina. Building on the approach introduced in 2025, U.S. Ski & Snowboard will host meetings and experiences both inside the Congress Center and across the ski resort Davos Klosters Mountains. The program is designed to provide an alternative setting for business during one of the world’s most influential annual gatherings. Participating athletes include six-time Olympic medalist Bode Miller, two-time Olympic medalist Picabo Street, World Championship medalist Daron Rahlves and World Cup winner Steven Nyman, alongside current Stifel U.S. Ski Team athletes Tommy Ford (alpine) and Sam Macuga (ski jumping). The athletes will ski with guests during the WEF and participate in selec",
      "pub_date": "2026-01-17",
      "id": "0e5f98c70fb7",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality",
        "international"
      ],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Unofficial Networks",
      "title": "Skier Makes ‘Comedy Of Errors’ During Palisades Tahoe Powder Day",
      "url": "https://unofficialnetworks.com/2026/01/17/skier-comedy-of-errors/",
      "description": "During a bluebird powder day at Palisades Tahoe, a skier made a few mistakes that ended up resulting in an entertaining video.",
      "content": "Olympic Valley, California — Sometimes going full send doesn’t work out, and that’s ok. An example of this is from Reddit user r/funpow , who apparently likes skiing powder. He compiled two clips for this video that feature some pretty brutal crashes at Palisades Tahoe. The first clip shows him jumping off a huge cliff and then going head over heels with a frontflip crash. Tears for Fears must be so proud. The second clip starts well, with a sweet wall ride, then he glides through powder. When he stops, he proceeds to get ran the f… over by another skier. Comedy of errors on this run by u/funpow in skiing While he may have had a tough day out there, at least it made for some entertaining viewing. Skier Clings To Cliff After Coming Up Short On River Gap Jump Image Video Credits: r/funpow Categories: Non-Unofficial Videos Palisades Tahoe Videos",
      "pub_date": "2026-01-17",
      "id": "41299987a0aa",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "winter-sports"
      ],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Unofficial Networks",
      "title": "18-Year-Old Dead After Fall From Chairlift at Canadian Ski Resort",
      "url": "https://unofficialnetworks.com/2026/01/17/18-year-old-dead-after-fall-from-chairlift-at-canadian-ski-resort/",
      "description": "Fatal Incident Confirmed on Cypress Mountain Resort.",
      "content": "West Vancouver, Canada — An 18-year-old man from Maple Ridge, British Columbia died after falling from a chairlift at Cypress Mountain Ski Resort on Thursday evening. The West Vancouver Police Department report that it responded to reports of someone in medical distress after a fall from a chairlift around 7:27pm on Thursday, January 15th. The man was then pronounced dead at the scene. “All available evidence points to this being a tragic accident. There are no obvious indications of technical or mechanical issues with the chairlift. As the death appears to be non-suspicious, the investigation is now with the Coroner’s Office.” – Suzanne Birch, spokesperson for the West Vancouver Police Department Cypress Mountain has confirmed the fatality involved a resort guest. “Cypress Mountain extends our heartfelt condolences and support to the guest’s family and friends during this incredibly difficult time.” -Cypress Mountain Our thoughts are with the victim’s family and friends. images from W",
      "pub_date": "2026-01-17",
      "id": "c48ba2b6cea9",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "canada",
        "resort-operations",
        "hospitality"
      ],
      "other_sources": [
        {
          "source": "Unofficial Networks",
          "url": "https://unofficialnetworks.com/2026/01/16/18-chairlift-fall-death-bc/"
        }
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Unofficial Networks",
      "title": "Yosemite National Park’s Ski Area Is Officially Opened For The Season",
      "url": "https://unofficialnetworks.com/2026/01/16/yosemite-np-ski-area-open/",
      "description": "Badger Pass Ski Area, located inside Yosemite National Park, has officially opened for the season as of Friday, January 16th.",
      "content": "Badger Pass Ski Area , located inside Yosemite National Park , has officially opened for the season as of Friday, January 16th. The ski area is located on the Glacier Point Road (Badger Pass Road in the winter) five miles east of the junction with Wawona Road. It sits at a base elevation of 7,200 feet and relies entirely on natural snow. View this post on Instagram A post shared by Yosemite National Park (@yosemitenps) “ Thanks to the past few weeks’ winter storms, the ski area has enough snow to start up a season of downhill and cross-country skiing, snowboarding, and snowshoeing. Please note that sledding and other snow play is not allowed at Badger Pass. However, Yosemite Hospitality operates a snow tubing hill, with innertubes available to rent for snow sliding. A snow play area is also available at Crane Flat and just outside the park south of South Entrance. ” – Yosemite National Park Badger Pass is open 7 days a week, 9am to 4pm, offering rentals, lessons, a ski shop, and a sund",
      "pub_date": "2026-01-17",
      "id": "41564e265acc",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "hospitality",
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Unofficial Networks",
      "title": "Line Cutting Insanity On Spanky’s Ladder @ Whistler Blackcomb",
      "url": "https://unofficialnetworks.com/2026/01/17/spankys-ladder-line-cutting-whistler/",
      "description": "Spanky's Ladder at Whistler Blackcomb can become quite a choke point on busy days, like it does here.",
      "content": "As we head into one of the busiest extended ski weekends of the season, its important to remember you manners at all times. The Garnet, Ruby, Sapphire, and Diamond Bowls on Blackcomb Mountain at Whistler Blackcomb offer some seriously incredible expert-only terrain with hairy cliffs, chutes, and other wild features. To access these bowls, skiers and snowboarders travel through Spanky’s Ladder, a choke point that, in extreme cases, can create quite a terrifying crowd. Apparently some skiers and snowboarders decided they were too good to wait in line on a busy day, riding ahead and forging their own path. Usually if someone is moving too slow for you on the uphill, you should have every right to pass them. But this seems like a slightly more complicated situation. Spanky's Ladder, Whistler by u/Raja_Ampat in skiing What do you think? Are these guys in the right to be ripping by the line if they can get up faster than the people ahead of them? Or is this a collapse of structure? Moose Cha",
      "pub_date": "2026-01-17",
      "id": "c5dbd7e65985",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "SnowBrains",
      "title": "Vail Resorts Hit Hard by Historic Snow Drought: Skier Visits Plunge 20%",
      "url": "https://snowbrains.com/vail-resorts-hit-hard-by-historic-snow-drought-skier-visits-plunge-20/",
      "description": "Vail Resorts Inc. reported a sharp decline in early-season skier visits across its North American resorts, as historically poor snowfall in the western United States limited terrain openings and weighed on visitation and ancillary spending. Vail Resorts released its early-season metrics on January 15, which include data from the start of the ski season through January 4, 2026. According to […] The post Vail Resorts Hit Hard by Historic Snow Drought: Skier Visits Plunge 20% appeared first on Snow",
      "content": "Conditions at Vail Mountain in Colorado on December 30, 2025. | Image: Meteorologist Joe Ruch, CBS Colorado Vail Resorts Inc. reported a sharp decline in early-season skier visits across its North American resorts, as historically poor snowfall in the western United States limited terrain openings and weighed on visitation and ancillary spending. Vail Resorts released its early-season metrics on January 15, which include data from the start of the ski season through January 4, 2026. According to this data, season-to-date skier visits were down 20.0% compared with the same period last year. Despite the drop in visits, total lift revenue declined by a more modest 1.8%, reflecting the stabilising effect of season pass sales. Ski school revenue fell 14.9%, dining revenue dropped 15.9%, and retail and rental revenue across North American resort stores decreased 6.0%. Vail Resorts CEO Rob Katz attributed the downturn primarily to unusually weak early-season snowfall in the western U.S. “We e",
      "pub_date": "2026-01-16",
      "id": "e887a4e9fcf4",
      "prefilter_business_score": 1,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "weather-snow",
        "ski-history",
        "resort-operations"
      ],
      "approved_date": "2026-01-16"
    },
    {
      "source": "SnowBrains",
      "title": "Australian Snowboarder Belle Brockhoff Announces Retirement Ahead of Olympics",
      "url": "https://snowbrains.com/australian-snowboarder-belle-brockhoff-announces-retirement-ahead-of-olympics/",
      "description": "Australian snowboard cross star Belle Brockhoff has announced her retirement from competitive racing, stepping away just weeks before the next Winter Olympics after a long rehabilitation from serious injuries. Related: U.S. Snowboarder Lindsey Jacobellis Wins Bronze in Snowboard Cross at 2023 World Championships In a heartfelt open letter addressed to the “Snowboarding Family,” Brockhoff confirmed that ongoing recovery from a […] The post Australian Snowboarder Belle Brockhoff Announces Retireme",
      "content": "Belle Brockhoff (left) with U.S. snowboarder Lindsey Jacobellis. | Image: Australian Olympic Team Australian snowboard cross star Belle Brockhoff has announced her retirement from competitive racing, stepping away just weeks before the next Winter Olympics after a long rehabilitation from serious injuries. Related: U.S. Snowboarder Lindsey Jacobellis Wins Bronze in Snowboard Cross at 2023 World Championships In a heartfelt open letter addressed to the “Snowboarding Family,” Brockhoff confirmed that ongoing recovery from a compound wrist fracture and a fractured L1 vertebra ultimately led her to the decision. Despite months of intensive rehab and training, the three-time Olympian said she had reached a point of clarity about her body’s limits and her future in the sport. “Snowboarding has given me so much over the years,” Brockhoff wrote, explaining that after more than 20 years in the sport, she knew “in my heart it is time to step away from competitive racing.” Related: U.S. Olympic S",
      "pub_date": "2026-01-16",
      "id": "e0e6b05de795",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "international",
        "transportation"
      ],
      "approved_date": "2026-01-16"
    },
    {
      "source": "SnowBrains",
      "title": "Camelback Mountain Resort, PA, Report: A Fantastic Day Trip to the Poconos",
      "url": "https://snowbrains.com/camelback-mountain-resort-pa-report/",
      "description": "Conditions report from Tuesday, January 13. Camelback Mountain Resort is located in the Pocono Mountains and is one of the biggest resorts in Pennsylvania. It is a great day trip from NYC, which is approximately 1 1/2 hours away, and also only 2 hours away from Philadelphia. Its proximity to these two major cities makes it a great ski destination […] The post Camelback Mountain Resort, PA, Report: A Fantastic Day Trip to the Poconos appeared first on SnowBrains .",
      "content": "The top of Camelback Mountain. | Image: SnowBrains Conditions report from Tuesday, January 13. Camelback Mountain Resort is located in the Pocono Mountains and is one of the biggest resorts in Pennsylvania. It is a great day trip from NYC, which is approximately 1 1/2 hours away, and also only 2 hours away from Philadelphia. Its proximity to these two major cities makes it a great ski destination as the only ski-in-ski-out mountain in the Poconos. The weather conditions on the mountain were great in the morning with clear, sunny skies, no wind, and temperatures in the upper 30s. It did rain in the region over the weekend, but there were no signs of the precipitation on Tuesday: there were no bare spots, and the slopes were perfectly groomed. The mountain was in great shape and had a base depth of 16 to 36 inches, with seven lifts running, and all of its 39 trails open. Related: Why Camelback is the Pocono Resort to Watch This Winter: Leadership Changes and Mountain Upgrades Deliver Cam",
      "pub_date": "2026-01-16",
      "id": "b4f55444864d",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-16"
    },
    {
      "source": "Snow Industry News",
      "title": "Protege & Austrian Ski Federation Entering Into Partnership To Make Winter Sports Videos Usable For AI Development.",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/protege-austrian-ski-federation-entering-into-partnership-to-make-winter-sports-videos-usable-for-ai-development/",
      "content": "Protege and the Austrian Ski Federation are entering into a partnership to make winter sports videos usable for AI development. As part of this collaboration, Protege, the trusted data source for AI development, will provide secure, legally compliant access to authentic, high-resolution footage of skiing and snowboarding in real-world training and competition environments, covering diverse terrain, weather conditions, lighting conditions, and camera angles. The Austrian Ski Federation (ÖSV) provides Protege with a high-quality library of audiovisual content on the topic of winter sports for the responsible use of AI. Accurately rendering winter sports presents AI teams with unique technical challenges and opportunities: rapid movements, extreme environments, fast camera movements, complex backgrounds, changing visibility, unique weather conditions, and high-contrast scenes. Nevertheless, rendering anatomically correct and physically realistic videos is of paramount importance to any vi",
      "pub_date": "2026-01-16",
      "id": "ffb38fba82b9",
      "prefilter_business_score": 1,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-01-16"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Gast Tapped as Eldora President and GM",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-gast-tapped-as-eldora-president-and-gm",
      "description": "SAM Magazine—Nederland, Colo., Jan. 16, 2026— Powdr Corp. has hired Andrew Gast to serve as president and general manager of Eldora Mountain Resort, effective Feb. 1. Gast will serve in his current role as general manager of Mt. Ashland, Ore., until Jan. 24. Powdr CEO Justin Sibley said the company—which remains Eldora’s owner while the Town of Nederland works to secure revenue bond financing and regulatory approvals to complete an asset purchase agreement to acquire the resort —is excited to we",
      "content": "SAM Magazine—Nederland, Colo., Jan. 16, 2026— Powdr Corp. has hired Andrew Gast to serve as president and general manager of Eldora Mountain Resort, effective Feb. 1. Gast will serve in his current role as general manager of Mt. Ashland, Ore., until Jan. 24. Powdr CEO Justin Sibley said the company—which remains Eldora’s owner while the Town of Nederland works to secure revenue bond financing and regulatory approvals to complete an asset purchase agreement to acquire the resort —is excited to we",
      "pub_date": "2026-01-16",
      "id": "0f1c5d9540a5",
      "prefilter_business_score": 2,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Snow Industry News",
      "title": "Mammoth Claims Best Snow Conditions In The US",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/mammoth-claims-best-snow-conditions-in-the-us/",
      "content": "Mammoth Lakes has seen 43 inches of fresh snow fall over the past several weeks, with 177 of 180 trails on the mountain now open, Mammoth Mountain currently boasts some of the best snow conditions in the US. The newly opened Limelight hotel also marks an exciting ‘25/’26 season for California’s most iconic resort. So far in the '25/'26 season, Mammoth Mountain has received a snow total of 156 inches and currently has a base depth of 62 inches. Clearer weather is expected in the coming week so visitors will be able to get out and enjoy blue bird days on the fresh powder. Mammoth mountain is California’s highest chairlift service peak and often sees incredible snow conditions, on average around 400 inches every season, allowing the season to extend into the summer months, so visitors have plenty of time to get out and enjoy what Mammoth has to offer. With four base lodges, 150 named trails, 11 terrain parks and 3,500 acres of skiable terrain, the mountain is an endless source of adventur",
      "pub_date": "2026-01-16",
      "id": "b7cb9fadcc3b",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "weather-snow",
        "hospitality",
        "transportation"
      ],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Ski Area Management",
      "title": "Season Opened Slowly at Most Western Destinations",
      "url": "https://www.saminfo.com/news/sam-headline-news/season-opened-slowly-at-most-western-destinations",
      "description": "SAM Magazine—Winter Park, Colo., Jan. 16, 2026— Low snowfall led to a lackluster December for mountain town lodging operations across most of the West, according to the December Market Briefing from Inntopia's DestiMetrics division. But in spite of the challenges, lodging properties managed to mitigate much of the negative impact—at least for December. DestiMetrics data track lodging performance in 17 Western mountain communities. Limited open terrain was the story in most locations—with less th",
      "content": "SAM Magazine—Winter Park, Colo., Jan. 16, 2026— Low snowfall led to a lackluster December for mountain town lodging operations across most of the West, according to the December Market Briefing from Inntopia's DestiMetrics division. But in spite of the challenges, lodging properties managed to mitigate much of the negative impact—at least for December. DestiMetrics data track lodging performance in 17 Western mountain communities. Limited open terrain was the story in most locations—with less th",
      "pub_date": "2026-01-16",
      "id": "1fc7e13ba6a4",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Unofficial Networks",
      "title": "Vail Resorts Visitation Nosedives Due To West’s Worst Winter In Decades",
      "url": "https://unofficialnetworks.com/2026/01/16/vail-resorts-visitation-nosedives/",
      "description": "In a sign of the West's rough winter, Vail Resorts ski season metrics dropped sharply compared to the start of the 2024-25 season.",
      "content": "Broomfield, Colorado — If recently released metrics from Vail Resorts are any indication, it could be the worst winter in modern history for the U.S. ski industry. Yesterday, Vail Resorts announced its skier metrics for the first portion of the 2025-26 season. The metrics aren’t pretty. Skier visits are down 20% year over year. Other reported metrics include dining revenue down 15.9%, ski school revenue down 14.9%, and retail/rental revenue diminishing by 6.0%. The least-horrible metric is lift ticket revenue, which is down only 1.8%. Here’s what Vail Resorts CEO Rob Katz said regarding the start of the 2025-26 ski season: “We experienced one of the worst early season snowfalls in the western U.S. in over 30 years, which limited our ability to open terrain and negatively impacted visitation and ancillary spending for both local and destination guests during the period. Snowfall at our western U.S. resorts for November and December was approximately 50% below the historical 30-year aver",
      "pub_date": "2026-01-16",
      "id": "95b50249c2ae",
      "prefilter_business_score": 1,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "ski-history",
        "resort-operations",
        "weather-snow"
      ],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Snow Industry News",
      "title": "Heidi Reveals Where GB Families Are Choosing To Ski This February Half Term And Why It’s Not Too Late To Book",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/heidi-reveals-where-gb-families-are-choosing-to-ski-this-february-half-term-and-why-it-s-not-too-late-to-book/",
      "content": "New data shows that high-altitude French resorts and budget Bulgarian favourites are leading February half-term ski holiday bookings for 2026, with over a quarter of families historically booking less than one month before travel. If you haven’t booked your February half-term family ski trip yet, you’re not alone. Heidi , the UK’s fastest-growing ski holiday company, reveals that most UK families book their half-term trips surprisingly later than you might expect - often up to just weeks before departure. Based on family bookings for February half term 2025 and 2026 to date, the data also highlights a shift in where UK families are choosing to ski. Large, high-altitude, snow-sure French resorts are rising in popularity compared to last year, whilst budget Bulgarian favourites continue to hold their ground. UK families are booking later than you might expect Despite being one of the busiest and most expensive weeks of the ski season, nearly 70% (69.4%) of February half term 2025 booking",
      "pub_date": "2026-01-16",
      "id": "55025a6f577c",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Snow Industry News",
      "title": "Carezza Dolomites Unveils A New Season Of Snow, Ski, & Adventure",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/carezza-dolomites-unveils-a-new-season-of-snow-ski-adventure/",
      "content": "The Carezza Dolomites ski area is preparing for an exciting winter season starting on 6 December 2025, with new lift developments, refreshed hotel concepts, and an activity offering that extends well beyond the slopes. A Family-Friendly, Climate-Conscious Ski Resort Set against the Rosengarten and Latemar peaks, Carezza is one of South Tyrol’s most accessible and sustainable ski areas. With 40 kilometres of pistes (55% blue, 30% red, 15% black), 13 modern lift systems, and guaranteed snow thanks to 200 energy-efficient snow cannons, the resort caters to every level, from first-timers to advanced skiers. At Carezza, sustainability is paramount. Part of the “Turn to Zero” commitment since 2019, Carezza measures its carbon footprint annually and optimises energy - saving measures wherever possible. The resort has reduced greenhouse gas emissions by 60-90% in its slope grooming vehicles, and has reduced piste grooming by an hour each day. The Carezza reservoir basin also provides much of t",
      "pub_date": "2026-01-16",
      "id": "53d17bf7f5cc",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "international",
        "hospitality"
      ],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Ski Area Management",
      "title": "NSAA 2026 Western Conference Draws Nearly 700",
      "url": "https://www.saminfo.com/news/sam-headline-news/nsaa-2026-western-conference-draws-nearly-700",
      "description": "SAM Magazine—Snowbird, Utah, Jan. 16, 2026— NSAA president Mike Reitzell and Snowbird president Dave Fields at the first track breakfast. A challenging start to the season for much of the west kept some ski area personnel from attending the National Ski Areas Association Western Winter Conference, but a crowd of 690 industry professionals—up from last year’s conference—still made their way to Snowbird, Jan. 13-15, for education, networking, and discussions about pressing issues and opportunities",
      "content": "SAM Magazine—Snowbird, Utah, Jan. 16, 2026— NSAA president Mike Reitzell and Snowbird president Dave Fields at the first track breakfast. A challenging start to the season for much of the west kept some ski area personnel from attending the National Ski Areas Association Western Winter Conference, but a crowd of 690 industry professionals—up from last year’s conference—still made their way to Snowbird, Jan. 13-15, for education, networking, and discussions about pressing issues and opportunities",
      "pub_date": "2026-01-16",
      "id": "6a42c8dfd754",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-17"
    },
    {
      "source": "Unofficial Networks",
      "title": "Massive Avalanche Sends Onlookers Fleeing At Russian Ski Resort",
      "url": "https://unofficialnetworks.com/2026/01/16/massive-avalanche-sends-onlookers-fleeing-at-russian-ski-resort/",
      "description": "Huge avalanche engulfs parking lot at Russian ski resort.",
      "content": "Kabardino-Balkaria, Russia — Unnerving footage from Elbrus Ski Resort in Kabardino-Balkaria, Russia where a massive avalanche came crashing down the slopes engulfing the parking lot in a powder cloud and sending onlookers fleeing. Holy shit, this morning this is scary! A massive avalanche struck the Elbrus Resort in Kabardino-Balkaria, Russia on January 15. pic.twitter.com/cl0RxbvlWS — Weather Monitor (@WeatherMonitors) January 15, 2026 The slide occurred yesterday January, 15, 2026. Thankfully no injuries or deaths have been reported. The slide happened five days after local authorities closed down sections of the mountain due to avalanche danger and it looks like that was a wise decision. Another clip from Elbrus Resort in Kabardino-Balkaria, Russia. pic.twitter.com/LBapYhHhFb — Weather Monitor (@WeatherMonitors) January 15, 2026 This wouldn’t be the first time this same parking lot has gotten hit by an avalanche. Check out this footage of wet slide that took out multiple vehicles at",
      "pub_date": "2026-01-16",
      "id": "0a6e8ef34738",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Unofficial Networks",
      "title": "Drunken Brawl Breaks Out At French Ski Resort",
      "url": "https://unofficialnetworks.com/2026/01/16/drunken-brawl-breaks-out-at-french-ski-resort/",
      "description": "Skiers and snowboarders drunkenly brawl on the slopes of Val Thorens Ski Resort in France.",
      "content": "Tarentaise Valley, France — Shocking footage from the French Alps where a wild melee broke out at Val Thorens Ski Resort following an apres ski party. 32-year-old Spaniard, Renan Vitor , was wearing his Ray-Ban Meta Glasses when the fight erupted outside the world famous 360 Val Thorens bar and managed to catch a small fraction of the brouhaha on video (the fight reportedly lasted 10 minutes) . Renan reports the fisticuffs were kicked off after a skier ran over a snowboarder which prompted a violent response from the snowboarder’s friends. 6 men reportedly chased down the skier and repeatedly hit him. As you can from the video, it got pretty vicious as they were throwing kicks with ski boots. The fight was eventually broken up by security from the nearby bar and the French Gendarmerie. Grizzly Bear Deftly Dives Through Fence While Charging Pickup Truck Driver Renan reported no arrests were made. Here is some more videos from his ski vacation to give you an idea of just how raucous thes",
      "pub_date": "2026-01-16",
      "id": "f8713f933dcd",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "safety-incidents",
        "international"
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Unofficial Networks",
      "title": "Why Saskatchewan’s Largest Ever Ski Resort Closed For Good",
      "url": "https://unofficialnetworks.com/2026/01/16/saskatchewan-ski-resort-history/",
      "description": "Once Saskatchewan's largest ski resort, various factors led to its closure in 2007. However, money has recently been invested in the property.",
      "content": "Saskatchewan — Similar to the American Midwest, Saskatchewan isn’t known for its ski areas. However, there is one mountain with decent skiable acreage that is now abandoned. In Skier72’s latest episode of The Lost Resorts series, he breaks down the history of Ochapowace. The video analyzes the history of the ski resort, why it closed, what it looks like today, and how it skied. Click here to watch more episodes of his series. History of Ochapowace Situated less than two hours from Regina, it was operated by four First Nations’ tribes. It first opened in 1968 as a modest rope tow operation and grew in the 1970s. A quad chairlift was installed in the 90s, giving it a bigger operational capacity. Off-Duty State Trooper Delivers Critical Live Saving CPR To Collapsed Skier in Michigan Factors such as a lack of government support, warm winters, and the lack of investments near the end of its tenure led to its demise. The ski area last operated in 2007. Interestingly, the lodge and chairlift ",
      "pub_date": "2026-01-16",
      "id": "ab3515c085e6",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "business-investment",
        "weather-snow"
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Unofficial Networks",
      "title": "New Hampshire Ski Area Opens New Lift For First Time In Decades",
      "url": "https://unofficialnetworks.com/2026/01/16/vets-new-surface-lift/",
      "description": "An under-the-radar ski area in New Hampshire has added a new surface lift to improve the beginner experience.",
      "content": "Franklin, New Hampshire — It’s been a couple of years of evolution at the Veterans Memorial Recreation Area . The ski area installed a snowmaking system a few years ago and has grown its offseason activities thanks to a dedicated team of mountain bike trail builders. The latest addition, which will help grow the skiing experience, debuted earlier this month. A few weekends ago, The Vets debuted a new magic carpet. Previously, new skiers and riders had to ride the rope tow or T-Bar to access the slopes, which is a tricky introduction to the sport. This magic carpet allows for easy learning and simple loading and unloading. The opening comes as the ski area faces fundraising challenges. There’s this project that they’re raising funds for, as well as the planned T-Bar replacement due to the age of the current one. You can support the Vets by donating here . It’s one of the several new lifts at New Hampshire ski areas/resorts this year. So far, new quad chairlifts have opened at Bretton Wo",
      "pub_date": "2026-01-16",
      "id": "3d4d479a5145",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Unofficial Networks",
      "title": "Massive Buck Sprints Past Ski School Kids @ French Ski Resort",
      "url": "https://unofficialnetworks.com/2026/01/16/massive-buck-sprints-past-ski-school-kids-french-ski-resort/",
      "description": "Red Deer blasts through powder and sprints past ski school kids.",
      "content": "Incredible footage from the French Pyrenees where a group of ski schoolers had a close encounter with a Red Deer buck on the slopes of Val-Louron Ski Resort . Red deer thrive across much of Pyrenean, especially in mid to high elevation valleys . Adult male red deer, like the one featured in the below video, stand roughly 4.5 feet tall at the shoulder and can reach around 550 pounds in favorable enviormental conditions. These powerful cervids usually avoid people and can be dangerous at close range (especially during the autumn rut) . Thankfully this buck was more concerned with high tailing it across the ski trail than in the approaching children in the ski school. View this post on Instagram A post shared by ESF Val Louron (@esf_val_louron) Red deer commonly shift activity toward crepuscular or nocturnal periods to avoid disturbance when cohabitating with humans but encounters can and still do happen. Its very important to respect their distance and give them plenty of room to avoid n",
      "pub_date": "2026-01-16",
      "id": "e2f30d6a5cc7",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Unofficial Networks",
      "title": "Parking Reservations Begin This Weekend At Arapahoe Basin",
      "url": "https://unofficialnetworks.com/2026/01/16/arpahoe-basin-parking-reservations/",
      "description": "This Saturday, January 17th, marks the start of Arapahoe Basin's parking reservation requirements for the 2026 winter season.",
      "content": "Heads up Colorado skiers and snowboarders, this Saturday, January 17th, marks the start of Arapahoe Basin’s parking reservation requirements for the 2026 winter season. Parking reservations will be required for everyone heading to the mountain on Saturdays and Sundays, with general reservations costing $20 online. Reservations are required for all lots and can be reserved starting the Monday before at 2pm and up to the day of. $20 reservations will be available in all lots with the exception of The Beach (costs vary) and the Admin Lot ($40). Accessible parking reservations are free and available both in the Early Riser and Admin Lot. Free carpool parking is available in the Easy Riser, High Noon, Last Chance, and Upper Last Chance lots for vehicles that have 4 or more passengers. Each account is limited to one reservation per day and can hold up to four active reservations at any given time. You can learn more about the Arapahoe Basin Parking Reservations here . Those who don’t want to",
      "pub_date": "2026-01-16",
      "id": "eab3259cf406",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "hospitality",
        "resort-operations"
      ],
      "approved_date": "2026-01-18"
    },
    {
      "source": "Ski Area Management",
      "title": "Vail Resorts See 20 Percent Drop in Visits Through New Year's Holiday",
      "url": "https://www.saminfo.com/news/sam-headline-news/vail-resorts-see-20-percent-drop-in-visits-through-new-years-holiday",
      "description": "SAM Magazine—Broomfield, Colo., Jan. 15, 2026— Skier visits for Vail Resorts (VR) destinations were down 20 percent for the season through Jan. 4 compared to a year ago, the company reported today. The news reflects below-normal snowfall across much of the West and the resulting limited operations at many resorts. It also provides a window into how the low-snow year is affecting resorts across the country generally. Beyond visits, ancillary revenues were also down: 14.9 percent in snowsports sch",
      "content": "SAM Magazine—Broomfield, Colo., Jan. 15, 2026— Skier visits for Vail Resorts (VR) destinations were down 20 percent for the season through Jan. 4 compared to a year ago, the company reported today. The news reflects below-normal snowfall across much of the West and the resulting limited operations at many resorts. It also provides a window into how the low-snow year is affecting resorts across the country generally. Beyond visits, ancillary revenues were also down: 14.9 percent in snowsports sch",
      "pub_date": "2026-01-15",
      "id": "9219d898852d",
      "prefilter_business_score": 1,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "How Telluride Is Doing This Week Following The Ski Patrol Strike",
      "url": "https://unofficialnetworks.com/2026/01/15/telluride-update-post-strike/",
      "description": "Businesses are still seeing the impacts of the ski patrol strike, while the ski resort is slowly growing its open terrain and lifts.",
      "content": "Telluride, Colorado — We’re approaching MLK weekend, which is one of the critical periods for ski resorts. While many locals in ski towns dread the crowds, locals in Telluride are hoping that people show up. Last Thursday , the Telluride Ski Patrol Union reached an agreement with the ski resort. The ski resort began growing its trail and lift count on Saturday. But how are the ski resort and the area doing now? CBS Colorado reported earlier this week that businesses are still struggling despite the ski resort gradually opening up more terrain and lifts. Bookings are reportedly down 50% compared to the same time last year due to those who cancelled because of the strike. However, businesses are offering discounts to bring locals back. “It feels like COVID,” said Mary Kenez, owner of a local pet store . “It’s almost a ghost town downtown … people are talking about asking for rent reductions because we don’t know when it’s coming back.” Business owners played a big part in ending the stri",
      "pub_date": "2026-01-15",
      "id": "53d7f79385c8",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "It’s Been A Deep And Deadly Week In The European Alps",
      "url": "https://unofficialnetworks.com/2026/01/15/deep-and-deadly-week-in-alps/",
      "description": "David Webster of Chamonix Ski Bum is back with another ski conditions roundup for the European Alps, and it was a deep one for many regions.",
      "content": "David Webster of Chamonix Ski Bum is back with another ski conditions roundup for the European Alps, and it was a deep one for many regions. Unfortunately those deep conditions brought their own danger, with quite a few avalanche deaths occurring throughout the mountain range in the past week. The northern and western Alps saw up to a meter, or a little over 3 feet, in a 3-4 day span from Wednesday through Saturday. It wasn’t the biggest storm of the season, but it brought some exceptional conditions. The best snow was found in Savoie, Les 3 Vallées, the Chamonix area, and parts of Switzerland and Austria. Unfortunately the conditions in the Dolomites weren’t quite as good. Warm temperatures and wind transformed much of the snow by Monday and Tuesday, turning much of the powder into crusty or slushy conditions. While groomed runs are excellent, the off-piste powder is getting much harder to find. Tragically at least 6 people died in avalanches in France alone over the last week, with m",
      "pub_date": "2026-01-15",
      "id": "b861ab6dc853",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "Why Utah’s Ski Boom Could Be Going Bust",
      "url": "https://unofficialnetworks.com/2026/01/15/utah-ski-boom-bust/",
      "description": "A new podcast episode features interviews with ski industry and weather experts to discuss whether Utah's best shredding days are behind it.",
      "content": "Utah — It’s historically the worst winter on record in Utah. That’s not a hyperbole, as many snowpack sites in Utah have now recorded their worst-ever January totals . Does this mean that Utah’s ski boom is going bust? The health of Utah’s ski industry was discussed on a RadioWest KUER 90.1 podcast episode this week. As part of the podcast, they interviewed Joe Prokop (longtime Alta passholder), Sam Weintrub (Co-Founder of PeakRankings), and Glen Merrill (SLC meteorologist with the National Weather Service) to discuss the issues that Utah ski industry faces. They discuss the following issues: overcrowding in the mountains, the impact of multi-mountain passes on lift lines and parking, and Utah’s changing climate. Why I Don’t Think It’s Going Bust It’s true that Utah’s most uncrowded days are behind it. The times that fixed-grip lifts helped Utah hold onto powder for days are over. But I think there are a few things that will make the Utah skiing experience better and more tolerable for",
      "pub_date": "2026-01-15",
      "id": "f86c8fd5067e",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "Skier Deploys Parachute After Jumping Off Massive Cliff Near Lake Tahoe",
      "url": "https://unofficialnetworks.com/2026/01/15/skier-deploys-parachute-after-jumping-off-massive-cliff-near-lake-tahoe/",
      "description": "Kasey English pays homage to Shane McConkey with Lover's Leap ski base jump.",
      "content": "It was exactly 23 years ago to the day that Shane McConkey pulled off his first ski base ever at Lover’s Leap in Strawberry, California and we are stoked to share that one of his biggest fans in the world has recreated his historic jump. Professional wingsuit athlete Kasey English used the exact same exit point on top of the famous granite cliff near Highway 50 and excuted a picture perfect flight before safely drifted to valley floor under canopy. “Full circle moment. I must have watched McConkey’s segment in 7 sunny days 100 times growing up.” -Kasey English View this post on Instagram A post shared by Kasey English (@kasey.2699) Here is the original footage of Shane from January 15th, 2003. Absolute legend, Thank You Shane! Categories: California Lake Tahoe Ski News Skiing",
      "pub_date": "2026-01-15",
      "id": "587181340c62",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "Alaska’s Third-Largest Ski Area Having Rough Season",
      "url": "https://unofficialnetworks.com/2026/01/15/eaglecrest-ski-area-tough-season/",
      "description": "Maintenance issues, resignations, and potential new government oversight means changes are likely coming to the ski area in Alaska's capital.",
      "content": "Juneau, Alaska — It should be a good anniversary weekend at Eaglecrest Ski Area . Ptmarigan is open for the first time this season. This weekend, they’ll be offering $7 lift tickets as part of their 50th anniversary celebration. Unfortunately, a lot of chatter is revolving around the ski area’s future. It’s been a rough season for Eaglecrest’s operations. Season pass sales are down. The lodge has been barely able to operate due to a water main break, and its core chairlift was closed until today because of mechanical issues. This is despite one of the snowiest Decembers ever for the city-owned ski area. Here’s a breakdown of recent events that could impact one of Alaska’s largest ski areas down the road. Old Infrastructure Eaglecrest’s aging infrastructure has played a large part in the 2025-26 season. Needed repairs to the Ptarmigan chairlift delayed its reopening until today. In the base lodge, a main water break left the lodge and bathrooms inoperable for a couple of weeks. Their sn",
      "pub_date": "2026-01-15",
      "id": "04874cde8865",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "ski-history",
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "Eileen Gu & Zeb Powell Among 6 Named As Founder Athletes For X Games League",
      "url": "https://unofficialnetworks.com/2026/01/15/x-games-league-founder-athletes/",
      "description": "6 skiers and snowboarders have all been named as Founder Athletes for the X Games League ahead of X Games Aspen 2026 Driven by Jeep.",
      "content": "Chloe Kim , Eileen Gu , Jamie Anderson , Mark McMorris , Scotty James , and Zeb Powell have all been named as Founder Athletes for the X Games League ahead of X Games Aspen 2026 Driven by Jeep , following last summer’s unveiling of the League’s Summer Founder Athletes. The six snowboarders/skiers will work to guide the League as it evolves into a new era of competition, providing input on competition formats, advising on athlete experience, and helping to shape the creative and cultural direction of the teams and league. “We couldn’t imagine ushering in this new era of action sports with a more iconic group. Welcoming them as XGL Founder Athletes underscores the mission of the X Games League: to propel action sports forward by building an athlete-first, team-powered, professional league that champions progression, fosters community, and inspires the next generation of fans around the world. Each of these men and women have advanced their sport in unforgettable ways, and their leadershi",
      "pub_date": "2026-01-15",
      "id": "480499a39a5b",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "Skier Data Tracking App Reveals Top Ski Resorts & Regions During Christmas Week 2025",
      "url": "https://unofficialnetworks.com/2026/01/15/slopes-ski-data-2025/",
      "description": "Data from popular ski data app reveals drops in ridership at Western US destinations, while Northeast ski resorts saw more guests.",
      "content": "North America — Wild weather resulted in wild swings in visitation during the 2025 Christmas Week. Slopes , an app that tracks ski data, captured trends in visitation this past Holiday period. With over 2 million active Slopes users, they were able to determine which ski resorts saw growth and decline in visitation last year. It compared the numbers between Christmas Week 2024 and 2025. Obviously, not everybody uses Slopes, so it doesn’t detail the exact visitation drops or growth numbers. But it does give us a perspective into which ski resorts are having a great winter, and which mountains are looking to rebound after a tough Christmas period. Here’s a recap of their core data findings: States With Biggest Gains Year By Year 5. Tie between Massachusetts and Minnesota (32%) 4. Indiana (42%) 3. Maryland (45%) 2. New Jersey (57%) 1. Virginia (74%) States With Biggest Losses Year By Year 5. Tie between Alaska, California, and Colorado (-22%) 4. Washington (-29%) 3. Utah (-31%) 2. Idaho (",
      "pub_date": "2026-01-15",
      "id": "c53b2a8fac50",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "Private Plane Skids Off Runway At Colorado Ski Town Airport",
      "url": "https://unofficialnetworks.com/2026/01/15/plane-skids-runway-colorado-ski-town/",
      "description": "A private plane skidded about 300 yards off the runaway at Telluride Regional Airport as it was landing on Tuesday, January 13th.",
      "content": "TELLURIDE, Colorado – A private plane skidded about 300 yards off the runaway at Telluride Regional Airport as it was landing on Tuesday, January 13th. According to the San Miguel County Sheriff’s Office , the plane, which was a Cessna Citation X, was landing at approximately 12:15pm when it skidded off the runway. The pilot informed deputies that a strong, gusting-crosswind hit the plane right after its wheels touched down. It eventually came to a rest on collapsed landing gear, though there was no fire or smoke. Three occupants were on board, including two pilots and one passenger, at the time of the crash. All occupants were able to exit on their own without injury. Damage to the plane included its left wing and nose wheel. The NTSB and FAA will be further running the investigation. PSA: Four-Wheel/All-Wheel Drive Isn’t Enough In Winter Conditions Categories: Colorado Telluride Travel",
      "pub_date": "2026-01-15",
      "id": "6964e44b91ee",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "safety-incidents",
        "resort-operations"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "It’s Official, Vail Might Be Overrated",
      "url": "https://unofficialnetworks.com/2026/01/15/its-official-vail-might-be-overrated/",
      "description": "As prices soar at US resorts people are turning to the European ski industry for affordable skiing.",
      "content": "Internet groups have been buzzing recently after a post went viral detailing that it is cheaper to fly your family to Ski Bansko, Bulgaria for three days than to ski three days at Vail Mountain, CO . With travel websites and cheap air-fare it is possible to make a European ski vacation come true. So as the prices skyrocket Vail is starting to seem more overrated with lift tickets reaching over $300 and notoriously long lift lines. View this post on Instagram A post shared by Get Sendy (@get.sendy) The numbers break down like this: a 3-day lift pass at Vail costs around $852 ($975, if purchased day of) , and equipment rentals cost around $92 per day ($276 total cost) . With those numbers skiing locally at Vail would cost about $1,128. Taking a round trip flight from Vail to Bulgaria with lodging included can cost as low as $682. A 3-day lift ticket at Bansko would cost $201 and equipment rentals would be around $60, bringing the total to just $943. The internet was quick to judge these ",
      "pub_date": "2026-01-15",
      "id": "003204bde8a7",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "resort-operations",
        "international",
        "business-investment"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "Lindsey Vonn Asks For Help Ski Pole Stolen At Italian Ski Resort",
      "url": "https://unofficialnetworks.com/2026/01/15/lindsey-vonn-asks-for-help-ski-pole-stolen-at-italian-ski-resort/",
      "description": "Lindsey Vonn needs help after ski pole stolen in Italy.",
      "content": "On the off chance you are in Tarvisio, Italy keep an eye out for a hot pink Leki ski pole because it may belong to an American ski legend. Lindsey Vonn just posted to social media with the following plea: “Someone took my pole in the parking lot today in Tarvisio. If you have seen it please respond to this. Thank you.” -Lindsey Vonn While mix ups happen and sometimes you accidentally grab a ski pole off the rack that may not be yours, the likelihood of that happening is very low with a florescent hot pink and green pole that has a form fit curvature adjusted specifically to Lindsey’s body (optimized for aerodynamics because hundredths of seconds count) . If you find Lindsey’s pole she asks you DM her directly. Hopefully she can get it back promptly. Here’s some more images of her missing pole: View this post on Instagram A post shared by L I N D S E Y • V O N N (@lindseyvonn) View this post on Instagram A post shared by Audi FIS Ski World Cup (@fisalpine) View this post on Instagram A ",
      "pub_date": "2026-01-15",
      "id": "d953b7a93472",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-01-16"
    },
    {
      "source": "SnowBrains",
      "title": "19-Year-Old Mia Jones Wins Freeride World Tour Opener in Career-Defining Debut",
      "url": "https://snowbrains.com/19-year-old-mia-jones-wins-freeride-world-tour-opener-in-career-defining-debut/",
      "description": "Mia Jones kicked off her Freeride World Tour (FWT) career in spectacular fashion Thursday, winning the Snowboard Women category at the season-opening event in Baqueira Beret. It was Jones’s first-ever Tour start, and the 19-year-old claimed the top spot on the prestigious Tuc de Bacivèr face in the Spanish Pyrenees—delivering a confident run that earned the highest score in her […] The post 19-Year-Old Mia Jones Wins Freeride World Tour Opener in Career-Defining Debut appeared first on SnowBrain",
      "content": "19-year-old Mia Jones won her first ever Freeride World Tour event in Baquiera Beret on Thursday. | Photo: Freeride World Tour/J Bernard Mia Jones kicked off her Freeride World Tour (FWT) career in spectacular fashion Thursday, winning the Snowboard Women category at the season-opening event in Baqueira Beret . It was Jones’s first-ever Tour start, and the 19-year-old claimed the top spot on the prestigious Tuc de Bacivèr face in the Spanish Pyrenees—delivering a confident run that earned the highest score in her category before a crowd of roughly 3,000. Jones, who is the daughter of freeride icon Jeremy Jones , stood out for her aggressive line, control through technical terrain, and a clean cliff drop that helped secure victory. Her performance marked the second straight season in which a rookie has won the opening Snowboard Women event, announcing her as a contender early in the 2026 season. The 2026 Tour got underway under clear skies and solid conditions after recent snowfall stab",
      "pub_date": "2026-01-15",
      "id": "8b3afe9c90f8",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-16"
    },
    {
      "source": "Unofficial Networks",
      "title": "Austrian Ski Resort Introduces Luxury “Limousine” Gondola Cabin",
      "url": "https://unofficialnetworks.com/2026/01/15/austrian-ski-resort-introduces-luxury-limousine-gondola-cabin/",
      "description": "A VIP gondola at Hochzillertal Resort, Austria redefines luxury skiing.",
      "content": "Gondola’s may seem like a luxury of their own as they provide a comfortable break on any typical ski day, but Hochzillertal Resort has taken luxury to a whole new level with a gondola that is anything but typical. They offer an experience that is otherwise unseen in an alpine environment, paving the way for a new wave of mountain travel. Featuring a BMW Individual interior, this gondola includes smooth leather seats with a massage function and ultramodern multimedia technology. Every journey up this lift holds a lasting impact. Seating two people per gondola there is plenty of room for comfort, cup-holders, and seat heaters. Picture the car of your dreams up in the sky as it transports you to world-class skiing. Guests riding this gondola can also be seen sipping champagne as they enjoy their 20 minute luxurious ride to the top of the mountain. Prices start at € 70.00 for 2 people and include ski pass service along with the unique gondola ride. At Hochzillertal Resort this gondola alig",
      "pub_date": "2026-01-15",
      "id": "8fc23d44b0d6",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-16"
    },
    {
      "source": "Unofficial Networks",
      "title": "Chasing Strava Speed Records At Jackson Hole",
      "url": "https://unofficialnetworks.com/2026/01/15/strava-speed-records-jackson-hole/",
      "description": "Professional skiers Jim Ryan and Madison Ostergren decided to chase the fastest Strava segments without the perfect conditions.",
      "content": "Anyone who frequently uses Strava knows the desire to capture as many KOMs or QOMs as possible. For those who don’t know, KOMs and QOMs mark the fastest athlete on a specific route, whether it’s for cycling, running, or, most appealing to us, skiing. Most KOMs are captured in perfect conditions. In skiing, that usually means perfectly groomed or powdery runs with wind at your back and fantastic visibility. Professional skiers Jim Ryan and Madison Ostergren decided to chase the fastest Strava segments without the perfect conditions, hunting the KOMs on expert, mogul only terrain. With conditions like that, capturing top times would be near impossible, but they still set out to see what they could do. For those wondering, they did set pretty strict rules for their attempts. They could only hit expert terrain and bump runs, but beyond that were some rules for the sake of safety. For one, they could not ski fast in slow zones. Secondly, they could not hit any blind rollovers, and lastly th",
      "pub_date": "2026-01-15",
      "id": "c5f3f9d0cb6b",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [],
      "approved_date": "2026-01-16"
    },
    {
      "source": "SnowBrains",
      "title": "SnowBrains Podcast Ep. 98 | Sophie Goldschmidt – President & CEO of the U.S. Ski & Snowboard Team",
      "url": "https://snowbrains.com/podcast-us-ski-snowboard-team/",
      "description": "Sophie Goldschmidt is the President and CEO of the U.S. Ski & Snowboard Team, leading the organization responsible for the future of ski racing and snowboarding in the United States from grassroots development to Olympic podiums. Before stepping into this role, she built a career at the highest level of global sports and media, including senior leadership positions at the […] The post SnowBrains Podcast Ep. 98 | Sophie Goldschmidt – President & CEO of the U.S. Ski & Snowboard Team appeared first",
      "content": "Sophie Goldschmidt is the President and CEO of the U.S. Ski & Snowboard Team, leading the organization responsible for the future of ski racing and snowboarding in the United States from grassroots development to Olympic podiums. Before stepping into this role, she built a career at the highest level of global sports and media, including senior leadership positions at the NBA, the World Surf League, and major international sporting events. At U.S. Ski & Snowboard, she oversees everything from athlete funding and high-performance programs to sponsorship, governance, and long-term health of the sport in a rapidly changing landscape. Her job sits at the intersections of athletes, fans, brands, and the future of skiing and snowboarding in America. In this conversation, we talk about her path leading to the U.S. Ski & Snowboard Team, what it actually takes to support elite athletes behind the scenes, the challenges facing competitive skiing today, and where she sees the sport headed next. T",
      "pub_date": "2026-01-14",
      "id": "c420c4866b96",
      "prefilter_business_score": 2,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "business-investment"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Unofficial Networks",
      "title": "“She Spawned Outta Nowhere” Skier Dressed In All White Snowsuit Nearly Slammed By Snowboarder",
      "url": "https://unofficialnetworks.com/2026/01/14/she-spawned-outta-nowhere-snowboarder-nearly-slams-skier-dressed-in-all-white-snowsuit/",
      "description": "Skier wearing all white seemingly invisible until the last second.",
      "content": "If you are a messy eater or tend to ski at places with muddy parking lots, an all white snowsuit is probably not a very practical attire choice but there may also be safety implications on slopes for wearing all white outerwear and it comes down to visibility or lack there of. The following video shows snowboarder who very nearly collided with a skier dressed in all white who was inadvertently (and rather convincingly) camouflaged against a backdrop of snow. View this post on Instagram A post shared by jum (@jum_ontheslopes) You can hear the surprise in the snowboarders voice as he slammed on the brakes and avoided the collision. He got an earful from a passerby and full took responsibilty for the close call and after reviewing the video you have to cut him some slack, she really did seemingly blink into existence. Maybe when they made up the societal rule that you shouldn’t wear white after Labor Day they were thinking about safety on the slopes? Categories: Ski News",
      "pub_date": "2026-01-14",
      "id": "a0f05cb187d3",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-15",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ]
    }
  ]
}