{
  "updated": "2026-02-06 11:27:27",
  "total_articles": 18,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "SnowBrains",
      "title": "Two Finnish Freeriders Killed in Avalanche at Sulden, South Tyrol, Italy",
      "url": "https://snowbrains.com/two-finnish-freeriders-killed-in-avalanche-at-sulden-south-tyrol-italy/",
      "description": "Two Finnish tourists have died after being buried in an avalanche on Thursday afternoon, February 5, in Sulden (Solda) in South Tyrol in northern Italy. The incident occurred around 1:30 p.m. on a freeride slope below the Schöntaufspitze (Punta Beltovo), which can be reached by the Rosim gondola. The avalanche extended toward Rosimtal (Val di Rosim), a high alpine valley […] The post Two Finnish Freeriders Killed in Avalanche at Sulden, South Tyrol, Italy appeared first on SnowBrains .",
      "content": "The rescuers found the deceased skiers under several feet of snow. | Image: CNSAS Alto Adige Two Finnish tourists have died after being buried in an avalanche on Thursday afternoon, February 5, in Sulden (Solda) in South Tyrol in northern Italy. The incident occurred around 1:30 p.m. on a freeride slope below the Schöntaufspitze (Punta Beltovo), which can be reached by the Rosim gondola. The avalanche extended toward Rosimtal (Val di Rosim), a high alpine valley and popular freeride zone in the Sulden (Solda) ski area. Related: 2 Guests Involved in Inbounds Avalanche at Whistler Blackcomb, BC 3 freeriders were caught in an avalanche in Sulden/Solda. | Image: CNSAS Alto Adige The victims, both freeriders aged between 50 and 60, were off-piste when the avalanche struck. A third skier survived and immediately raised the alarm after witnessing the disaster, sustaining only minor injuries before being taken to a hospital in Schlanders. From the air, mountain rescuers spotted the survivor di",
      "pub_date": "2026-02-06",
      "id": "5238218aea5d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "hospitality",
        "canada"
      ],
      "approved_date": "2026-02-06"
    },
    {
      "source": "PlanetSKI",
      "title": "PlanetSKI Resort Review: Kicking Horse, British Columbia, Canada",
      "url": "https://planetski.eu/2026/02/05/planetski-resort-review-kicking-horse-british-columbia-canada/",
      "description": "It is one of our favourite Canadian resorts but it's over a decade since we last visited. Will it live up to expectations? NEW The post PlanetSKI Resort Review: Kicking Horse, British Columbia, Canada appeared first on PlanetSKI .",
      "content": "The resort lies just over the province border from PlanetSKI’s current base in Canmore , Alberta. It’s a pleasant drive of under two hours and fortunately the roads were clear. As was the sky. British Columbia, here we come. Kicking Horse, British Columbia, Canada. Image © PlanetSKI I have stayed in the resort of Kicking Horse itself a few times. In the town of Golden 13kms away in the valley below. And even slept in the car park of the resort in an RV for a few nights while on a multi-resort road trip round some of British Columbia’s finest resorts a few years back – we visited Red , White Water and Revelstoke to name a few. Kicking Horse, British Columbia, Canada. Image © PlanetSKI Kicking Horse is probably my favourite Canadian resort. Firstly it has some of the finest and most challenging skiing – from the steep shutes and wide open powder bowls, to the groomers. I think you get the general idea of my view on the resort in the PlanetSKI snow report I filed on arrival this time roun",
      "pub_date": "2026-02-05",
      "id": "a490b6df8173",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "weather-snow",
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-02-05"
    },
    {
      "source": "Unofficial Networks",
      "title": "This Japanese Ski Resort Has A Karaoke Gondola Cabin",
      "url": "https://unofficialnetworks.com/2026/02/05/japan-ski-resort-karaoke-gondola/",
      "description": "Skiers and snowboarders at Hakuba Goryu Snow Resort in Japan can sing karaoke while riding up the mountain.",
      "content": "Anyone who visits Japan, whether it’s just for sightseeing or for skiing/snowboarding, needs to do some karaoke. In the U.S., most karaoke is done in a bar with everyone watching. In Japan, most karaoke is done in private rooms for just you and your friends. It really takes things to the next level. Skiers and snowboarders at Hakuba Goryu Snow Resort in Japan don’t need to go far out of their way to get some karaoke in. In fact if they wind up on the resort’s #55 gondola cabin, they can sing karaoke while riding up the mountain. View this post on Instagram A post shared by 白馬五竜 : エイブル白馬五竜 ABLE Hakuba Goryu / 白馬五竜高山植物園 (@hakubagoryuofficial) The karaoke gondola celebrates the ski area’s 55th season in operation. As the 55th gondola cabin, it has a fancy warp on the outside and a party on the inside. Certainly quite the way to celebrate a birthday! Pennsylvania Ski Resort Is Already Shooting To Stay Open Into May Categories: Japan Skiing Snowboarding Travel",
      "pub_date": "2026-02-05",
      "id": "3950f0f259d9",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [
        "resort-operations",
        "hospitality"
      ],
      "approved_date": "2026-02-06"
    },
    {
      "source": "Snow Industry News",
      "title": "Two New 6-Seater Chairlifts Open In Dachstein-West",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/two-new-6-seater-chairlifts-open-in-dachstein-west/",
      "content": "With the grand opening of the two new 6-seater chairlifts, Aussichtsberg and Angeralm, the Dachstein West ski region has reached another significant milestone in its tourism development. The two new lifts connect the ski resorts in Gosau (Upper Austria) and Annaberg (Salzburg) and thus serve as a powerful symbol of cross-border cooperation in alpine tourism. Since their commissioning last December, they have noticeably improved traffic flow in the ski area and provided a new, modern skiing experience. “With the new Aussichtsberg and Angeralm 6-seater chairlifts, Dachstein West has achieved a true vision for the future. These lifts are a visible sign that targeted investments in quality, safety, and guest comfort are having an immediate impact. The high level of guest satisfaction confirms that we are on the right track. Around €22 million was invested in the two new lifts. This sustainably strengthens Dachstein West's position as Upper Austria's largest ski region and as a high-perform",
      "pub_date": "2026-02-03",
      "id": "a22103710f5c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "The Ski Guru",
      "title": "How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)",
      "url": "https://www.the-ski-guru.com/2026/02/03/how-to-use-avalanche-bulletins/",
      "description": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number, without fully understanding how to use the rest of the information to plan a safe mountain … Continue reading \"How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)\" The post How to Use Avalanche Bulletins to Plan Your Mou",
      "content": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number , without fully understanding how to use the rest of the information to plan a safe mountain day. This guide explains how to read and apply avalanche bulletins properly , what they can (and cannot) tell you, and where to find the official avalanche forecasts across Europe. What an Avalanche Bulletin Is — and What It Is Not An avalanche bulletin (or avalanche forecast) is a regional risk assessment , based on: snowpack observations recent avalanche activity weather patterns (snowfall, wind, temperature) terrain characteristics Swiss Avalanche Bulletin Update. Slf.ch. How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step). It is not : a guarantee of safety a green light to ski steep terrain a precise description of e",
      "pub_date": "2026-02-03",
      "id": "8e3088d0ec9b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Ski Area Management",
      "title": "The 2026 I Am a Snowmaker Contest Winner",
      "url": "https://www.saminfo.com/news/sam-headline-news/the-2026-i-am-a-snowmaker-contest-winner",
      "description": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "content": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "pub_date": "2026-02-03",
      "id": "6a5af2600c40",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "SnowBrains",
      "title": "[OLYMPICS] Pre-Opening Day Recap: Big Air Qualis & Downhill Training (Oh, and Curling)",
      "url": "https://snowbrains.com/olympics-pre-opening-day-recap-big-air-qualis-downhill-training-oh-and-curling/",
      "description": "The Opening Ceremony of the Milano-Cortina 2026 Winter Olympics is still a day away, but the Winter Games are already rolling across northern Italy. From freestyle qualifiers in Livigno to blistering downhill training runs in Bormio, the early storylines are taking place even before the flame is lit in Milan. Livigno: Men’s Snowboard Big Air Qualifying Delivers The first official […] The post [OLYMPICS] Pre-Opening Day Recap: Big Air Qualis & Downhill Training (Oh, and Curling) appeared first on",
      "content": "17-year-old Oliver Martin advances to the finals. | Image: U.S. Snowboard The Opening Ceremony of the Milano-Cortina 2026 Winter Olympics is still a day away, but the Winter Games are already rolling across northern Italy. From freestyle qualifiers in Livigno to blistering downhill training runs in Bormio, the early storylines are taking place even before the flame is lit in Milan. Livigno: Men’s Snowboard Big Air Qualifying Delivers The first official Olympic results came in Livigno, where the men’s snowboard Big Air qualifiers were contested under a three-run format, with riders counting their best two scores. Japan’s Ogiwara Hiroto set the benchmark early and never looked back. He became the first rider to crack the 90-point mark, landing a massive switch backside 1980 for 90.5 on his opening run. A backside 1800 Indy on run two scored 88, giving him a commanding combined score of 178.50, nearly 15 points clear of the rest of the field. Japan had a total of four snowboarders qualify",
      "pub_date": "2026-02-06",
      "id": "1a747dbaaac0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "international"
      ],
      "approved_date": "2026-02-06"
    },
    {
      "source": "PlanetSKI",
      "title": "2026 Winter Olympics Starts Today",
      "url": "https://planetski.eu/2026/02/05/2026-winter-olympics-starts-on-friday/",
      "description": "It is the highlight of competitive world snowsport and Team GB has some realistic medal chances on snow. PlanetSKI looks ahead to The Games. UPDATED The post 2026 Winter Olympics Starts Today appeared first on PlanetSKI .",
      "content": "“The Milano Cortina 2026 Olympic Winter Games are ready for competition,” announced the International Olympic Committe. It said that all venues as well as the key timing systems are fully operational. The Opening Ceremony takes place on Friday evening. The show will combine musical performances by artists including Mariah Carey, Laura Pausini and Andrea Bocelli, with a staging concept designed to extend beyond the stadium itself. The lighting of two cauldrons —one at Milan’s Arco della Pace and the other in Cortina d’Ampezzo’s Piazza Dibona — will embody the desire to multiply traditional rituals in order to reflect the Games’ multi-hub nature. Organisers describe the show as “an extended invitation, a shared embrace, celebrating Italian uniqueness and made in Italy.” Image c/o Milan-Cortina 2026 Events are spread between Milan, as the urban and ceremonial core, and the Alpine locations of Cortina d’Ampezzo, Valtellina, Val di Fiemme and Livigno, extending across Lombardy and Veneto an",
      "pub_date": "2026-02-05",
      "id": "e12def122455",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-02-06"
    },
    {
      "source": "Unofficial Networks",
      "title": "Georgia Man Dies In Skiing Accident at New York Ski Resort",
      "url": "https://unofficialnetworks.com/2026/02/05/georgia-man-dies-in-skiing-accident-at-new-york-ski-resort/",
      "description": "The investigation into the cause of death is ongoing.",
      "content": "Tragic news out of New York State where a 44-year-old Georgia man died Wednesday after he was found in the treeline at Whiteface Mountain following a search conducted by ski patrol. New York State Police report Michael E. Vacek Jr. of Atlanta, Georgia, was reported missing at approximately 10:00am by friends he was skiing with. Whiteface Mountain Ski Patrol was notified that Vacek was missing after he failed to return while out on the mountain. Whiteface Mountain Ski Patrol launched a search and located Vacek in the treeline along the Upper/Lower Skyward Trail. A ski patrol supervisor was notified and Vacek was transported to the resort’s medical building where life-saving measures were continued by responding local fire and rescue departments. Vacek was pronounced dead at the scene. State police responded to the incident at approximately 1:03pm. The Essex County Coroner responded and transported the body to Glens Falls Hospital. An autopsy is scheduled for Friday at Glens Falls Hospit",
      "pub_date": "2026-02-05",
      "id": "921d017d8328",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-02-06"
    },
    {
      "source": "Snow Industry News",
      "title": "Alta Badia Gets Ready For Skiing In Spring In The Heart Of The Dolomites",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/alta-badia-gets-ready-for-skiing-in-spring-in-the-heart-of-the-dolomites/",
      "content": "In March and April, the days grow longer and weather conditions become particularly favourable for skiing. It is the ideal time to enjoy the mountains and the slopes of Alta Badia, in the heart of the Dolomites, a UNESCO World Heritage site, where excellent snow quality and meticulously groomed slopes ensure a high-level experience even at the end of the season. In recent years, Alta Badia has strengthened its position as a leading destination for alpine skiing, thanks to an offer that combines efficient infrastructure, high-quality services and an internationally recognised food and wine scene. As tradition dictates, the ski season in Alta Badia draws to a close with a series of unmissable events. SOMMELIER ON THE SLOPES The Sommelier on the slopes event aims to promote and further showcase the finest wines of South Tyrol. The final dates of the season are scheduled for 3, 10 and 31 March. The initiative combines unforgettable skiing on the slopes of Alta Badia with the tasting of som",
      "pub_date": "2026-02-02",
      "id": "dc66b70e21a5",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "international",
        "business-investment"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "The Ski Guru",
      "title": "Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us",
      "url": "https://www.the-ski-guru.com/2026/02/02/avalanche-activity-france-switzerland-february-2026/",
      "description": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable, despite periods of fair weather and already-tracked slopes. Rather … Continue reading \"Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us\" The post Avalanche Acti",
      "content": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable , despite periods of fair weather and already-tracked slopes. Rather than isolated incidents, the reports collected since late January describe reactive slabs, remote triggers, and persistent weak layers affecting a wide range of aspects and elevations. Much of the recent instability is consistent with wind-loaded slabs and foehn-driven snow transport , which can rapidly overload weak layers and create large, reactive avalanche conditions. Further reading: Why Wind is one of the Most Dangerous Avalanches Triggers. Foehn Winds and Rising Avalanches in the Alps. This update summarises the most significant recent events and explains what they tell us about current conditions. Widesp",
      "pub_date": "2026-02-02",
      "id": "cacf361124bc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "SnowBrains",
      "title": "A Rare Inbounds Avalanche Occurred at Alyeska Resort, AK, Today",
      "url": "https://snowbrains.com/a-rare-inbounds-avalanche-occurred-at-alyeska-resort-ak-today/",
      "description": "A rare inbound avalanche occurred today and impacted the lower-mountain chairlift at Alyeska Resort, Alaska, forcing the lift to close. The avalanche closed Chair 4, Ted’s Express, which takes skiers and snowboarders from the base to mid-mountain. Alyeska posted on its website: Change Of Plans… Due to unsafe conditions on the upper mountain, lift operations will be limited to Chair […] The post A Rare Inbounds Avalanche Occurred at Alyeska Resort, AK, Today appeared first on SnowBrains .",
      "content": "An avalanche occurred at Alyeska Resort on Thursday, February 5, 2026. No injuries were reported. | Image: Alyeska Resort A rare inbound avalanche occurred today and impacted the lower-mountain chairlift at Alyeska Resort , Alaska, forcing the lift to close. The avalanche closed Chair 4, Ted’s Express, which takes skiers and snowboarders from the base to mid-mountain. Alyeska posted on its website: Change Of Plans… Due to unsafe conditions on the upper mountain, lift operations will be limited to Chair 7 and the Bear Cub Quad today from 10:00am to 5:00pm. The Tram will remain open for foot passengers only with a 2:30pm final upload and 3:00pm final download. Then, the Tram will reopen for Seven Glaciers service at 4:30pm, with possible weather delays. Our teams are keeping a close eye on conditions and will provide updates as things evolve. We appreciate the patience and understanding, we’re all in it together. There have been inbounds avalanches at Alyeska Resort in the past, although",
      "pub_date": "2026-02-06",
      "id": "7c1f21669e43",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-06"
    },
    {
      "source": "Unofficial Networks",
      "title": "Flying A $10,000 FPV Drone Over Europe’s Deadliest Mountain",
      "url": "https://unofficialnetworks.com/2026/02/05/flying-10k-drone-matterhorn-summit/",
      "description": "Swiss cinematographer Noah Malin took his $10k FPV drone to the Matterhorn to shoot a commercial, flying all the way to the summit.",
      "content": "The Matterhorn is among the deadliest mountains in the world, with more than 500 deaths on the mountain since 1865. Every year the mountain sees 8-10 deaths, with up to 3000 mountaineers attempting to summit the iconic peak. With a summit altitude of 14,692 feet, it theoretically shouldn’t be incredibly difficult to fly a drone to the summit. However, the concept of flying a $10,000 piece of equipment far beyond your reach seems pretty stressful. Swiss cinematographer Noah Malin took his $10k FPV drone to the Matterhorn to shoot a commercial. Because of the drone’s size, he had to walk up to the Hörnlihütte at 10,695 feet. This wasn’t the first time someone’s flown a drone to the summit of the iconic European peak, but the fact that this is a high-end piece of equipment with a very nice camera truly shines in the footage. It’s absolutely stunning to look at. Noah has a ton of very cool drone footage on his YouTube channel, with shots of water, mountains, and stunning scenery. Make sure",
      "pub_date": "2026-02-05",
      "id": "907a096c4ca3",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-02-06"
    },
    {
      "source": "PlanetSKI",
      "title": "Vonn Claims Olympics is Still on the Cards",
      "url": "https://planetski.eu/2026/02/04/vonn-claims-olympics-is-still-on-the-cards/",
      "description": "Lindsey Vonn tore her ACL in a high speed downhill crash at a World Cup event in Crans-Montana last week. She has not ruled out taking part in next weekend's Olympic Downhill in Italy. NEW The post Vonn Claims Olympics is Still on the Cards appeared first on PlanetSKI .",
      "content": "She says she is “very hopeful” she can compete at the Milan-Cortina Winter Olympics. Ski racers have competed with torn ACL’s before and Vonn crucially doesn’t have swelling on the knee. The former Olympic champion said her knee feels “stable, strong and is not swollen” and she feels “confident” she will make the women’s downhill event in Cortina next Sunday. “This is obviously not what I hoped for. I have been working really hard to come into these Games in a much different position,” she said. “I know what my chances were before the crash and I know that my chances aren’t the same as it stands now, but I know there is still a chance. “As long as there is a chance, I’ll try. That’s where I am.” The four-time world champion retired from the sport in 2019 but made a stunning comeback in December 2024 following a partial replacement of her right knee. Lindsey Vonn set to race again She is currently top of the World Cup downhill standings, with two race wins and three more podium finishes",
      "pub_date": "2026-02-04",
      "id": "ce7971031b64",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Snow Industry News",
      "title": "A Taste Of Geneva: The Woodward x Hotel Jerome x Chateau Angelus Comes To Aspen This February",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/a-taste-of-geneva-the-woodward-x-hotel-jerome-x-chateau-angelus-comes-to-aspen-this-february/",
      "content": "Hotel Jerome, Auberge Collection , welcomes the culinary sensibility of one of Europe's most celebrated kitchens to the heart of the Rockies with A Taste of Geneva, an exclusive two-night culinary experience created in collaboration with The Woodward, Auberge Collection , and Château Angelus . Taking place on February 11 and 12, 2026, in the Prospect dining room, the limited-seating dinners unite MICHELIN-starred cuisine and storied Saint-Émilion wines through a shared commitment to craftsmanship, culture, and personal hospitality. Event Details Dates: February 11 and 12, 2026 Reception: 6:30 p.m. Seated Dinner: 7:00 p.m. Location: Prospect at Hotel Jerome Pricing: $595 per person, inclusive Reservations: Available via Resy Seating: One seating per night, 60 guests per evening For two immersive evenings, acclaimed Chef Olivier Jean and Pastry Chef Titouan Claudet travel from the Three-MICHELEN key property, The Woodward in Geneva to Aspen's most legendary hotel, offering guests, in par",
      "pub_date": "2026-02-02",
      "id": "9441dbfaa801",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "The Ski Guru",
      "title": "Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain",
      "url": "https://www.the-ski-guru.com/2026/01/31/winter-mountain-safety-guide/",
      "description": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing.They are also complex, constantly changing environments, where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety, helping skiers, snowshoers and … Continue reading \"Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain\" The post Winter Mountain Safety G",
      "content": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing. They are also complex, constantly changing environments , where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety , helping skiers, snowshoers and Nordic users better understand terrain, conditions and context . It is written for awareness — not blame — and is designed to be read alongside official safety advice and avalanche bulletins. 1. Winter mountain risk goes beyond marked pistes A common misconception is that avalanche danger only concerns off-piste or backcountry skiers. In reality: Avalanches can cross groomed ski pistes Snowshoe routes may pass beneath steep, uncontrolled slopes Cross-country ski tracks can lie within avalanche run-out zones Valley floors, access roads and ice-climbing approaches may all be exposed Several recent accidents in th",
      "pub_date": "2026-01-31",
      "id": "51f89304d637",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "winter-sports"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-04"
    }
  ]
}