{
  "updated": "2026-02-04 11:27:56",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "SnowBrains",
      "title": "Weather and Snowpack Update for the United States",
      "url": "https://snowbrains.com/weather-and-snowpack-update-for-the-united-states/",
      "description": "Many ski areas across the Western USA continue to experience one of the most challenging winters in recent memory. Mount Hood Ski Bowl recently announced that its operations will be suspended until further notice, and many large ski areas, including Vail, Park City, Deer Valley, and others only have roughly 65% of their terrain open, according to ski area websites. […] The post Weather and Snowpack Update for the United States appeared first on SnowBrains .",
      "content": "Fun turns bring solace during a record low snow winter. | Photo: Zach Armstrong Many ski areas across the Western USA continue to experience one of the most challenging winters in recent memory. Mount Hood Ski Bowl recently announced that its operations will be suspended until further notice, and many large ski areas, including Vail , Park City , Deer Valley , and others only have roughly 65% of their terrain open, according to ski area websites. Many ski areas in the West have gone several weeks without seeing more than an inch or two of snow. After a warm and wet fall, dry January has offered no relief to the immense challenges this snow-starved winter has brought. Related: SnowBrains Forecast: Snow Returns to the PNW This Weekend The vast majority of SNOTEL sites across the West are recording below-average snowpacks, with more than a few recording the worst snow years since SNOTEL records started, more than 30 years ago. Parts of Oregon have less than a third of their average snowpa",
      "pub_date": "2026-02-04",
      "id": "f13386b275d0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [],
      "approved_date": "2026-02-04"
    },
    {
      "source": "PlanetSKI",
      "title": "Vonn Claims Olympics is Still on the Cards",
      "url": "https://planetski.eu/2026/02/04/vonn-claims-olympics-is-still-on-the-cards/",
      "description": "Lindsey Vonn tore her ACL in a high speed downhill crash at a World Cup event in Crans-Montana last week. She has not ruled out taking part in next weekend's Olympic Downhill in Italy. NEW The post Vonn Claims Olympics is Still on the Cards appeared first on PlanetSKI .",
      "content": "She says she is “very hopeful” she can compete at the Milan-Cortina Winter Olympics. Ski racers have competed with torn ACL’s before and Vonn crucially doesn’t have swelling on the knee. The former Olympic champion said her knee feels “stable, strong and is not swollen” and she feels “confident” she will make the women’s downhill event in Cortina next Sunday. “This is obviously not what I hoped for. I have been working really hard to come into these Games in a much different position,” she said. “I know what my chances were before the crash and I know that my chances aren’t the same as it stands now, but I know there is still a chance. “As long as there is a chance, I’ll try. That’s where I am.” The four-time world champion retired from the sport in 2019 but made a stunning comeback in December 2024 following a partial replacement of her right knee. Lindsey Vonn set to race again She is currently top of the World Cup downhill standings, with two race wins and three more podium finishes",
      "pub_date": "2026-02-04",
      "id": "ce7971031b64",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Snow Industry News",
      "title": "Two New 6-Seater Chairlifts Open In Dachstein-West",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/two-new-6-seater-chairlifts-open-in-dachstein-west/",
      "content": "With the grand opening of the two new 6-seater chairlifts, Aussichtsberg and Angeralm, the Dachstein West ski region has reached another significant milestone in its tourism development. The two new lifts connect the ski resorts in Gosau (Upper Austria) and Annaberg (Salzburg) and thus serve as a powerful symbol of cross-border cooperation in alpine tourism. Since their commissioning last December, they have noticeably improved traffic flow in the ski area and provided a new, modern skiing experience. “With the new Aussichtsberg and Angeralm 6-seater chairlifts, Dachstein West has achieved a true vision for the future. These lifts are a visible sign that targeted investments in quality, safety, and guest comfort are having an immediate impact. The high level of guest satisfaction confirms that we are on the right track. Around €22 million was invested in the two new lifts. This sustainably strengthens Dachstein West's position as Upper Austria's largest ski region and as a high-perform",
      "pub_date": "2026-02-03",
      "id": "a22103710f5c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "The Ski Guru",
      "title": "How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)",
      "url": "https://www.the-ski-guru.com/2026/02/03/how-to-use-avalanche-bulletins/",
      "description": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number, without fully understanding how to use the rest of the information to plan a safe mountain … Continue reading \"How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)\" The post How to Use Avalanche Bulletins to Plan Your Mou",
      "content": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number , without fully understanding how to use the rest of the information to plan a safe mountain day. This guide explains how to read and apply avalanche bulletins properly , what they can (and cannot) tell you, and where to find the official avalanche forecasts across Europe. What an Avalanche Bulletin Is — and What It Is Not An avalanche bulletin (or avalanche forecast) is a regional risk assessment , based on: snowpack observations recent avalanche activity weather patterns (snowfall, wind, temperature) terrain characteristics Swiss Avalanche Bulletin Update. Slf.ch. How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step). It is not : a guarantee of safety a green light to ski steep terrain a precise description of e",
      "pub_date": "2026-02-03",
      "id": "8e3088d0ec9b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "Unofficial Networks",
      "title": "The 5 Largest Ski Areas In Minnesota",
      "url": "https://unofficialnetworks.com/2026/02/03/minnesota-largest-ski-areas/",
      "description": "Minnesota is home to 21 total ski areas. These 5 represent the largest in the Land of 10,000 Lakes.",
      "content": "Minnesota is much more of a water and ice state than it is a mountain state, but quite a few ski areas spread throughout. In fact, according to statistics from the National Ski Areas Association, Minnesota is home to 21 total ski areas (as of the 2024/25 season) , more than Montana and Nevada combined. These 5 ski areas represent the largest in the Land of 10,000 Lakes. 5 Largest Ski Areas in Minnesota 5. Welch Village – 140 acres 50 trails. 360 feet of vertical rise. 10 lifts. 4. Spirit Mountain – 175 acres 22 trails. 700 feet of vertical. 5 lifts. 3. Giants Ridge – 202 acres 35 trails. 500 feet of vertical. 5 lifts. View this post on Instagram A post shared by Giants Ridge (@giantsridge) 2. Afton Alps – 300 acres 50 trails. 350 feet of vertical. 17 lifts. 1. Lutsen Mountains – 1,000 acres 95 trails. 825 feet of vertical. 9 lifts. New Master Plan Shows Vision For Reviving Canadian Ski Resort Categories: Minnesota Skiing Snowboarding",
      "pub_date": "2026-02-03",
      "id": "e8d83bd69f56",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "hospitality",
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Ski Area Management",
      "title": "The 2026 I Am a Snowmaker Contest Winner",
      "url": "https://www.saminfo.com/news/sam-headline-news/the-2026-i-am-a-snowmaker-contest-winner",
      "description": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "content": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "pub_date": "2026-02-03",
      "id": "6a5af2600c40",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "Castle Mountain, AB, Report: Old School Vibes with Great Terrain",
      "url": "https://snowbrains.com/castle-mountain-ab-report-old-school-vibes-with-great-terrain/",
      "description": "Report from Sunday, February 1 The province of Alberta is home to several iconic international ski destinations, including Lake Louise, Banff Sunshine Village, and Marmot Basin. But one resort seems to fly under the radar: Castle Mountain, which sits at the southern end of the Canadian Rockies. It often gets overlooked when booking a ski vacation, as this old-school mountain is […] The post Castle Mountain, AB, Report: Old School Vibes with Great Terrain appeared first on SnowBrains .",
      "content": "A view of the rolling foothills and prairies in the distance. | Credit Brett Currie/SnowBrains Report from Sunday, February 1 The province of Alberta is home to several iconic international ski destinations, including Lake Louise , Banff Sunshine Village , and Marmot Basin. But one resort seems to fly under the radar: Castle Mountain , which sits at the southern end of the Canadian Rockies. It often gets overlooked when booking a ski vacation, as this old-school mountain is not the easiest resort to get to—but it is definitely worth the trip. Related: Major Terrain Expansions Unveiled at Castle Mountain Resort, AB The two and a half hour drive from Calgary was one of my favourite drives I have ever done. The drive takes you through the rolling foothills of Alberta with views of the never-ending prairies on your left-hand side and towering snowcapped rocky mountains to your right. A view of the main face of the resort. | Credit Brett Currie/SnowBrains With southern Alberta having a very",
      "pub_date": "2026-02-04",
      "id": "15088e3c4bf9",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "canada",
        "hospitality"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "PlanetSKI",
      "title": "Freeride Crowns Its First World Champions",
      "url": "https://planetski.eu/2026/02/04/fwt-crowns-its-champions-4/",
      "description": "The first ever FIS Freeride World Championships has taken place in Andorra. It marks a landmark moment for the sport of freeriding. NEW The post Freeride Crowns Its First World Champions appeared first on PlanetSKI .",
      "content": "The Allianz FIS Freeride World Championships Andorra 2026 by Mammut took place following exceptional snowfall that delivered 150 cm of fresh snow, creating outstanding competition conditions in Andorra. Competition day at Ordino Arcalís delivered a defining moment for the sport, as the first-ever FIS Freeride World Championships unfolded in front of an engaged audience. After a covered start which challenged visibility, the competition went under way with good conditions. On world-class terrain the Andorran resort provided a spectacular setting for a landmark event that brought together the world’s best freeriders on one stage. Freeride World Championships 2026. Image c/o FWCH26 & DDAHER Unfortunately the women ski event as stopped due to a lack of visibility following a decision by the Contest Director, prioritising athlete safety. At the time of interruption, 11 of the 16 competitors had completed their runs, meeting the two-thirds threshold required under FIS Freeride Competition Ru",
      "pub_date": "2026-02-04",
      "id": "900c7065c86c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "safety-incidents",
        "weather-snow"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "New Master Plan Shows Vision For Reviving Canadian Ski Resort",
      "url": "https://unofficialnetworks.com/2026/02/03/fortress-mountain-master-plan/",
      "description": "In the latest attempt to revive a closed Alberta ski resort, focus would first be on creating various summer attractions.",
      "content": "Alberta — Preliminary work on reviving a famous Alberta ski resort is underway. Late last year, Alberta announced the first ski resorts that are a part of their All-Season Resorts plan . This new law fast-tracks developments at ski resorts. The first ski resorts that were greenlit for this program include Castle Mountain, Nakiska, and the currently defunct Fortress Mountain Resort. While there is an active cat-skiing operation at Fortress, much of the property is abandoned. However, work is well underway on changing that. Public comments are now open on a proposal to revive Fortress and make it a four-season destination. The master plan, prepared by Ecosign, envisions the resort’s first phase focused on summer visitation, with various activities and a resort village. Perhaps one of the most interesting aspects is a gondola to Whiskey Ridge. However, it’s not for skiing; it’s for sightseeing. Some potential activities in phase one include mountain biking, ziplining, a mountain coaster, ",
      "pub_date": "2026-02-03",
      "id": "57db45157faa",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "safety-incidents",
        "resort-operations"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Snow Industry News",
      "title": "Alta Badia Gets Ready For Skiing In Spring In The Heart Of The Dolomites",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/alta-badia-gets-ready-for-skiing-in-spring-in-the-heart-of-the-dolomites/",
      "content": "In March and April, the days grow longer and weather conditions become particularly favourable for skiing. It is the ideal time to enjoy the mountains and the slopes of Alta Badia, in the heart of the Dolomites, a UNESCO World Heritage site, where excellent snow quality and meticulously groomed slopes ensure a high-level experience even at the end of the season. In recent years, Alta Badia has strengthened its position as a leading destination for alpine skiing, thanks to an offer that combines efficient infrastructure, high-quality services and an internationally recognised food and wine scene. As tradition dictates, the ski season in Alta Badia draws to a close with a series of unmissable events. SOMMELIER ON THE SLOPES The Sommelier on the slopes event aims to promote and further showcase the finest wines of South Tyrol. The final dates of the season are scheduled for 3, 10 and 31 March. The initiative combines unforgettable skiing on the slopes of Alta Badia with the tasting of som",
      "pub_date": "2026-02-02",
      "id": "dc66b70e21a5",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "international",
        "business-investment"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "The Ski Guru",
      "title": "Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us",
      "url": "https://www.the-ski-guru.com/2026/02/02/avalanche-activity-france-switzerland-february-2026/",
      "description": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable, despite periods of fair weather and already-tracked slopes. Rather … Continue reading \"Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us\" The post Avalanche Acti",
      "content": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable , despite periods of fair weather and already-tracked slopes. Rather than isolated incidents, the reports collected since late January describe reactive slabs, remote triggers, and persistent weak layers affecting a wide range of aspects and elevations. Much of the recent instability is consistent with wind-loaded slabs and foehn-driven snow transport , which can rapidly overload weak layers and create large, reactive avalanche conditions. Further reading: Why Wind is one of the Most Dangerous Avalanches Triggers. Foehn Winds and Rising Avalanches in the Alps. This update summarises the most significant recent events and explains what they tell us about current conditions. Widesp",
      "pub_date": "2026-02-02",
      "id": "cacf361124bc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "Wrongful Death Lawsuit Filed After Skier Dies in Avalanche During Mount Bailey, OR, Cat-Skiing Trip",
      "url": "https://snowbrains.com/family-of-skier-killed-in-oregon-avalanche-files-wrongful-death-lawisuit/",
      "description": "A lawsuit was filed last Friday in Deschutes County Circuit Court and seeks over $14.5 million in damages for the death of Brian Thomas Roberts. He was killed in an avalanche on Mount Bailey near Diamond Lake, Oregon, on March 13, 2025. The lawsuit against Diamond Lake Improvement Company claims the conditions were too dangerous that day, and the guides told […] The post Wrongful Death Lawsuit Filed After Skier Dies in Avalanche During Mount Bailey, OR, Cat-Skiing Trip appeared first on SnowBrai",
      "content": "The family of a skier killed by avalanche in central Oregon has filed a wrongful death lawsuit. | Courtesy: Roberts Family A lawsuit was filed last Friday in Deschutes County Circuit Court and seeks over $14.5 million in damages for the death of Brian Thomas Roberts. He was killed in an avalanche on Mount Bailey near Diamond Lake, Oregon, on March 13, 2025. The lawsuit against Diamond Lake Improvement Company claims the conditions were too dangerous that day, and the guides told the group to disregard the report indicating a high level of avalanche danger that day. The lawsuit also says that Roberts showed signs of life, but the guides did not have an AED to resuscitate him. It goes on to say that one former guide expressed concerns about using guides with little or no experience at Mt. Bailey, but those were dismissed. Named in the suit are the Diamond Lake Improvement Company, California-based Sierra Wilderness Seminars Inc., and guides David Cressman, Rebecca Bastian, and Jackson Kr",
      "pub_date": "2026-02-03",
      "id": "2420acd1b481",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "business-investment"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "PlanetSKI",
      "title": "World Cup Alpine Ski Racing at Crans-Montana",
      "url": "https://planetski.eu/2026/02/03/world-cup-alpine-ski-racing-at-crans-montana/",
      "description": "PlanetSKI was slopeside at the Swiss resort last weekend for the final World Cup races before the Winter Olympics get underway this week. NEW The post World Cup Alpine Ski Racing at Crans-Montana appeared first on PlanetSKI .",
      "content": "Friday saw some snowfall, but sadly it led to the cancellation of the Women’s Downhill race. It followed several crashes including one to the current leader and favourite for Olympic gold – Lindsey Vonn . It remains to be seen if she can take part in the Olympic Downhill next weekend. Vonn’s Olympic return in doubt after crash The skies cleared overnight with glorious bluebird conditions on the Saturday and Sunday. World Cup racing at Crans-Montana. Image © PlanetSKI Crans-Montana went ahead with the World Cup races after much thought following the fire in a bar in the resort on New Year’s Eve. Over the race weekend it was confirmed that another person had died from their injuries, taking the toll to 41. Death toll from Crans-Montana fire rises to 41 Tributes were paid to those affected and changes were made to the schedule. Crans-Montana remembers The finish area was stripped of its usual vibrant color and advertising. Instead, white and black signs of mourning that read “Our thoughts",
      "pub_date": "2026-02-03",
      "id": "68a3cee612b7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality",
        "safety-incidents",
        "weather-snow"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "Unofficial Networks",
      "title": "Bipedal Skiing Robot Shreds Northeast China",
      "url": "https://unofficialnetworks.com/2026/02/03/bipedal-skiing-robot-shreds-northeast-china/",
      "description": "TRON 1 looks a lot like a Star Wars AT-ST Walker trudging across the snow-covered plains of Hoth.",
      "content": "If you needed any reminder that you are living in the 2026, look no further than the slopes of Northeast China where bidep biomimetic motion controlled robots are craving down the mountain. The featured robot is called the TRON 1 and looks a lot like a S tar Wars AT-ST Walker trudging across the snow-covered plains of Hoth. The TRON 1 is advertised as the first multi-modal biped robot and “the gateway to humanoid RL research.” It is designed for efficient switching of different foot-ends for flexible combinations (including in this case ski boot) and automatic hardware recognition and software adaptation. The TRON 1 seemed to do well in -4°F temps of Northern China with its dynamic balance and terrain adaptation on full display. While there is a healthy segment of the skiing public who seek to disconnect with technology when they are in the mountains, it seems that is getting harder and harder each coming winter. Tough to tell how skiing robots might be utilized in the future of ski re",
      "pub_date": "2026-02-03",
      "id": "ffc808f8ba77",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Snow Industry News",
      "title": "A Taste Of Geneva: The Woodward x Hotel Jerome x Chateau Angelus Comes To Aspen This February",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/a-taste-of-geneva-the-woodward-x-hotel-jerome-x-chateau-angelus-comes-to-aspen-this-february/",
      "content": "Hotel Jerome, Auberge Collection , welcomes the culinary sensibility of one of Europe's most celebrated kitchens to the heart of the Rockies with A Taste of Geneva, an exclusive two-night culinary experience created in collaboration with The Woodward, Auberge Collection , and Château Angelus . Taking place on February 11 and 12, 2026, in the Prospect dining room, the limited-seating dinners unite MICHELIN-starred cuisine and storied Saint-Émilion wines through a shared commitment to craftsmanship, culture, and personal hospitality. Event Details Dates: February 11 and 12, 2026 Reception: 6:30 p.m. Seated Dinner: 7:00 p.m. Location: Prospect at Hotel Jerome Pricing: $595 per person, inclusive Reservations: Available via Resy Seating: One seating per night, 60 guests per evening For two immersive evenings, acclaimed Chef Olivier Jean and Pastry Chef Titouan Claudet travel from the Three-MICHELEN key property, The Woodward in Geneva to Aspen's most legendary hotel, offering guests, in par",
      "pub_date": "2026-02-02",
      "id": "9441dbfaa801",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "The Ski Guru",
      "title": "Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain",
      "url": "https://www.the-ski-guru.com/2026/01/31/winter-mountain-safety-guide/",
      "description": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing.They are also complex, constantly changing environments, where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety, helping skiers, snowshoers and … Continue reading \"Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain\" The post Winter Mountain Safety G",
      "content": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing. They are also complex, constantly changing environments , where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety , helping skiers, snowshoers and Nordic users better understand terrain, conditions and context . It is written for awareness — not blame — and is designed to be read alongside official safety advice and avalanche bulletins. 1. Winter mountain risk goes beyond marked pistes A common misconception is that avalanche danger only concerns off-piste or backcountry skiers. In reality: Avalanches can cross groomed ski pistes Snowshoe routes may pass beneath steep, uncontrolled slopes Cross-country ski tracks can lie within avalanche run-out zones Valley floors, access roads and ice-climbing approaches may all be exposed Several recent accidents in th",
      "pub_date": "2026-01-31",
      "id": "51f89304d637",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "winter-sports"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}