{
  "updated": "2026-01-25 11:12:06",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "PlanetSKI",
      "title": "Another Avalanche Death in the Alps",
      "url": "https://planetski.eu/2026/01/25/another-avalanche-death-in-the-alps-2/",
      "description": "A 42-year-old man has died in Maurienne in France. He was part of a group of three skiers. It follows dozens of deaths in the Alps in recent weeks. NEW The post Another Avalanche Death in the Alps appeared first on PlanetSKI .",
      "content": "The avalanche accident happened on the north face of the Cime du Sambuis, in Maurienne on Friday at 3pm. The victim was part of a group of three skiers from Chambéry and Lyon. The first skier went down the slope without incident but the second was carried away by an avalanche and he was thrown against rocks. The other two skiers alerted the rescue authorities. “The skier was carried away by a wind plate above rock bars,” and could not be resuscitated despite the intervention of the High Mountain Gendarmerie Platoon of Savoie (PGHM) and a Samu doctor, said the prefecture in a statement. The authorities continue to advise that people use extreme caution off piste with a generally unstable snow pack. It is the latest in a series of avalanche fatalities as we have reported on PlanetSKI: Irish skier is latest to die in avalanche in the Alps Eight skiers die in three separate avalanches in Austria 13 year old boy is latest avalanche fatality More avalanches in the Alps with ‘high’ risk in pl",
      "pub_date": "2026-01-25",
      "id": "c7ca4de8d314",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-25"
    },
    {
      "source": "SnowBrains",
      "title": "Buttermilk Ski Resort, Aspen, CO, Report: Park Laps, Tiehack, and a Storm a-Brewin’",
      "url": "https://snowbrains.com/buttermilk-ski-resort-aspen-co-conditions-report-park-laps-tiehack-and-a-storm-a-brewin/",
      "description": "This report is from Saturday, January 24, 2026. Aspen, Colorado, most famously known for hosting the annual Winter X Games, is home to four mountains that offer excellent, unique skiing and snowboarding experiences. In the midst of an eerily dry Colorado winter, Aspen has the most skiable terrain in Colorado right now, with several thousand acres open for riding across all […] The post Buttermilk Ski Resort, Aspen, CO, Report: Park Laps, Tiehack, and a Storm a-Brewin’ appeared first on SnowBrain",
      "content": "Setting the Stage at X-Games Day One! Credit: SnowBrains This report is from Saturday, January 24, 2026. Aspen, Colorado, most famously known for hosting the annual Winter X Games, is home to four mountains that offer excellent, unique skiing and snowboarding experiences. In the midst of an eerily dry Colorado winter, Aspen has the most skiable terrain in Colorado right now, with several thousand acres open for riding across all skill levels. For my first day in Aspen and day one of the Winter X-Games, I cruised around Buttermilk Mountain, enjoyed beautiful vistas, some rolling groomers, and perfect park laps, and watched as world-class athletes practiced for their events and then competed at the highest level. View of the storm rolling in over Aspen Highlands as seen from the Tiehack side of Buttermilk! Credit: SnowBrains For my first few runs of the day, I headed over to the Tiehack side of the mountain. The Tiehack Express lift covers over 1,500 vertical feet and services several bl",
      "pub_date": "2026-01-25",
      "id": "c10ba0f976b6",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-25"
    },
    {
      "source": "Snow Industry News",
      "title": "U.S. Ski & Snowboard Names 97 Athletes For 2026 Milano Cortina Olympic Winter Games",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/us-ski-snowboard-names-97-athletes-for-2026-milano-cortina-olympic-winter-games/",
      "content": "U.S. Ski & Snowboard has nominated 97 athletes to represent Team USA at the 2026 Milano Cortina Olympic Winter Games, Feb. 6-22, 2026. The athletes were selected to Team USA based on pre-determined Olympic Winter Games selection criteria by U.S. Ski & Snowboard and will be officially announced to Team USA on Jan. 26, 2026. The Milano Cortina Games will take place across Italy, becoming the most geographically widespread Games in history. Athletes will compete across 25 venues in four main clusters: Milan, Cortina d’Ampezzo, Valtellina and Val di Fiemme, with 116 medal events on the schedule. For ski and snowboard events, Bormio will host men’s alpine, Cortina will host women’s alpine, cross country, ski jumping and nordic combined will all take place in Val di Fiemme and freestyle, freeski and snowboard will be in Livigno. U.S. Ski & Snowboard will send 97 athletes to the Olympic Winter Games, including 73 athletes from the Stifel U.S. Ski Team and 24 athletes from the Hydro Flask U.S.",
      "pub_date": "2026-01-24",
      "id": "ad7232dd71e7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Unofficial Networks",
      "title": "Rowdy Revelstoke Partiers Get The Police Called On Them",
      "url": "https://unofficialnetworks.com/2026/01/24/rowdy-revelstoke-partiers-police/",
      "description": "An overnight stay at a Revelstoke hotel became a nightmare for guests due to a rambunctious group of partiers.",
      "content": "Revelstoke, British Columbia — There are pros and cons to having outdoor hot tubs at hotels, as demonstrated by an avid skier’s experience in Revelstoke. In Rise & Alpine’s latest video, he takes his fiancée on her first-ever trip to Revelstoke Mountain Resort. However, I’d argue the major story from this one is what happened before the ski day. While staying overnight at a hotel in Revelstoke, their attempts at sleeping were foiled by a group of rowdy guests. Throughout the evening, a group of guests kept making noise in the outdoor hot tub, which included bringing a bench into the water. What followed were shouting matches with other guests and hotel management. Eventually, the po-po stopped by the hot tub, but it wasn’t to take a soak. It’s an entertaining watch. If you’re curious about which hotel they were staying at, it’s the Stoke Hotel, which is part of the Best Western brand. It has a Google rating of 4.1 out of 5, which is decent, but noise is an issue. On the bright side, th",
      "pub_date": "2026-01-24",
      "id": "0bca245cbe8c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "canada"
      ],
      "approved_date": "2026-01-25"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "The Ski Guru",
      "title": "Aosta Council Backs Inter-Valley Link Between Pila and Cogne",
      "url": "https://www.the-ski-guru.com/2026/01/22/aosta-backs-inter-valley-link-pila-cogne/",
      "description": "The municipal council of Aosta has officially backed a proposal supporting the inter-valley link between the Pila ski resort and the village of Cogne — a move seen as a major step forward for regional tourism, connectivity and mountain mobility. The council approved the motion, presented by members of the Union Valdôtaine and Stella Alpina – Rassemblement Valdôtain, with 25 votes in favour … Continue reading \"Aosta Council Backs Inter-Valley Link Between Pila and Cogne\" The post Aosta Council Ba",
      "content": "The municipal council of Aosta has officially backed a proposal supporting the inter-valley link between the Pila ski resort and the village of Cogne — a move seen as a major step forward for regional tourism, connectivity and mountain mobility. The council approved the motion, presented by members of the Union Valdôtaine and Stella Alpina – Rassemblement Valdôtain , with 25 votes in favour out of 27 . Two councillors voted against it, but the overall support highlights broad political and community interest in exploring the proposal further. The sleepy town of Cogne, which is usually much colder than Aosta as it is in altitude, it is pretty cut off from the main valley, but part of its charm is that! Renown for its cross-country skiing, it has also a smaller alpine skiing resort, which is the one that they want to join to Pila. Photo: The-Ski-Guru. Proponents emphasised that while the council is not deciding how such a link would be built, the endorsement sends a clear message: the id",
      "pub_date": "2026-01-22",
      "id": "9d16839975b8",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "winter-sports"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "Death at Murren’s Inferno Race",
      "url": "https://planetski.eu/2026/01/25/death-at-murrens-inferno-race/",
      "description": "This year's 82nd International Inferno Race in Mürren was cancelled after a 69-year-old racer collapsed shortly before the finish line and died. NEW The post Death at Murren’s Inferno Race appeared first on PlanetSKI .",
      "content": "Medical staff were on hand straight away and despite immediate resuscitation efforts the person, who has not been identified, was pronounced dead at the scene. As a result the Organising Committee decided to immediately cancel the race. Around half the competitors had completed the grueling course. The organisers decided to evaluate the results up to the point when the race was cancelled and the winners were announced. “Despite the sad incident that forced the race to be abandoned, the celebrations at the Alpine Sports Centre in Mürren will continue in the evening in a modified format,” said the organisers in a statement shortly after the accident. See here for a press release on the incident. The Inferno Race is held annually in the Swiss resort of Mürren. It was started by the Kandahar Club in 1928 when 17 Kandahar members climbed to the summit of the Schilthorn over two days. They then set off in a mass start for the race to Lauterbrunnen in the valley bottom, a drop of 2,170m. It i",
      "pub_date": "2026-01-25",
      "id": "2490a285f08c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-25"
    },
    {
      "source": "SnowBrains",
      "title": "Monarch Mountain, CO, Report: Free Refill Friday",
      "url": "https://snowbrains.com/monarch-mountain-co-report-free-refill-friday/",
      "description": "Report from January 23 Monarch Mountain, Colorado, had a great start to this stormy weekend on Friday. Only one inch of new snow appeared on the snowstake by first chair, but as usual, conditions were much deeper. The first run felt more like a few inches on the existing hard pack. By the end of the day though, the skiing […] The post Monarch Mountain, CO, Report: Free Refill Friday appeared first on SnowBrains .",
      "content": "With heavy snow falling all day Friday, fresh tracks could be had on every run! Photo: Author Report from January 23 Monarch Mountain , Colorado, had a great start to this stormy weekend on Friday. Only one inch of new snow appeared on the snowstake by first chair, but as usual, conditions were much deeper. The first run felt more like a few inches on the existing hard pack. By the end of the day though, the skiing was borderline bottomless. The snowstake now shows about nine inches of new snow since this morning with more on the way! The moguls on Zorro were soft and bouncy after this refresh. Photo: Author I normally spend a lot of my day at Monarch around the Panorama lift. Today though, I could barely get myself to stop lapping the equally fun terrain under Garfield. The rocks, shrubs, and other hits on Cleanzer and Ajax are in and really fun right now. The mellower runs on the south side such as Drifter and North Forty have great coverage and kept filling up all day. I finally mad",
      "pub_date": "2026-01-24",
      "id": "7d806b51e754",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Unofficial Networks",
      "title": "How A Pro Skier Approaches The Steepest Tree Cut Run In The U.S.",
      "url": "https://unofficialnetworks.com/2026/01/24/steepest-tree-cut-run/",
      "description": "The steepest tree-cut run in the United States is usually considered to be Rambo, a double black diamond at Crested Butte.",
      "content": "The steepest tree-cut run in the United States is usually considered to be Rambo, a double black diamond at Colorado’s Crested Butte Mountain Resort . With a consistent 55-degree pitch, lots of moguls, and many obstacles like rocks and small trees spread throughout the run, it takes a lot of confidence and skill to ski without trouble. Drew Petersen , being a professional skier and Crested Butte frequenter, doesn’t just have the skills and confidence to ski it without trouble, he has the skills and confidence to ski it with impeccable style. View this post on Instagram A post shared by Drew Petersen (@drewpeterski) The United States’ steepest tree-cut run usually takes quite a lot of time to pick your way down, but Drew skis it at an impressive speed. He makes the line choice look truly effortless when we all know it’s nowhere near that. Crested Butte is home to 1,547 acres of skiable terrain. 165 named trails are accessible by 15 chairlifts, with 37% of the resort’s terrain being cons",
      "pub_date": "2026-01-24",
      "id": "fa7a59735346",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-01-25"
    },
    {
      "source": "Snow Industry News",
      "title": "Atomic Pays Homage To The \"Herminator\" With Retro-Inspired Hermann Maier Skis",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/atomic-pays-homage-to-the-herminator-with-retro-inspired-hermann-maier-skis/",
      "content": "Atomic is tapping into alpine skiing nostalgia with the launch of the limited-edition X9S Beta Race 10.26, a modern performance ski that pays homage to the legendary equipment once raced by Austrian great Hermann Maier during his dominant run in the late 1990s and early 2000s. The collector's edition ski blends unmistakable retro aesthetics drawn from the original Beta Race models with contemporary race-proven construction, creating a tribute to one of the sport's most formidable competitors while showcasing Atomic's enduring World Cup heritage. The X9S Beta Race 10.26 draws visual inspiration directly from those championship years while hiding thoroughly modern engineering beneath its nostalgic graphics. Built for aggressive on-piste skiers, the ski features a Multi Radius Sidecut that allows it to snap through short turns while remaining composed and stable in longer GS-style arcs. Performance remains central to the design. Ultrawall sidewalls deliver precise edge grip and efficient ",
      "pub_date": "2026-01-23",
      "id": "4d4aaa32aba7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "ski-history"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "The Ski Guru",
      "title": "What to Pack for a Half-Term Ski Trip with Your Family",
      "url": "https://www.the-ski-guru.com/2026/01/22/half-term-ski-packing-family/",
      "description": "Half-term ski holidays are exciting, busy, and often cold. Resorts are lively, temperatures can vary significantly, and when skiing with children, being well prepared makes all the difference. This practical guide focuses on layers, warmth, safety and comfort, with tips for both adults and children — especially younger kids, who feel the cold more quickly. The Golden … Continue reading \"What to Pack for a Half-Term Ski Trip with Your Family\" The post What to Pack for a Half-Term Ski Trip with Yo",
      "content": "Half-term ski holidays are exciting, busy, and often cold. Resorts are lively, temperatures can vary significantly, and when skiing with children, being well prepared makes all the difference . This practical guide focuses on layers, warmth, safety and comfort , with tips for both adults and children — especially younger kids, who feel the cold more quickly. The Golden Rule: Dress in Layers Layering allows you to adapt easily to changing weather, activity levels and temperatures. Family enjoys a day skiing on the mountain in Vail, CO. Photo Credit: Craig Orsini. Vail Resorts. Base Layer (Next to Skin) Thermal top and leggings Merino wool or synthetic fabrics (avoid cotton) For children: pack multiple base layers , as they get wet easily Mid-Layer (Warmth) Fleece or insulated mid-layer Wool or Merino jumper (excellent for colder days and for children) Lightweight down or synthetic jacket for very cold conditions Tip: two thin mid-layers are often more versatile than one bulky one. Outer",
      "pub_date": "2026-01-22",
      "id": "d891c86b7907",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "GB Ski & Snowboard Teams Announced for Milan-Cortina Olympics",
      "url": "https://planetski.eu/2026/01/24/gb-ski-snowboard-teams-announced-for-milan-cortina-olympics/",
      "description": "GB Snowsport has announced the athletes heading out to Italy to complete in The Games, that start on February 6th. NEW The post GB Ski & Snowboard Teams Announced for Milan-Cortina Olympics appeared first on PlanetSKI .",
      "content": "There are no great surprises as Team GB takes twenty snowsport athletes to the 2026 Winter Games – some realistic prospects of medals. Park & Pipe: Zoe Atkin – Freeski Halfpipe Gus Kenworthy – Freeski Halfpipe Liam Richards – Freeski Halfpipe Chris McCormick – Freeski Slopestyle and Big Air Kirsty Muir – Freeski Slopestyle and Big Air Mia Brookes – Snowboard Slopestyle and Big Air Maisie Hill – Snowboard Slopestyle and Big Air Txema Mazet-Brown – Snowboard Slopestyle and Big Air Alpine Skiing: Billy Major – Slalom Dave Ryding – Slalom Laurie Taylor – Slalom Cross-Country: James Clugnet Joe Davies Andrew Musgrave Anna Pryce Snowboard Cross: Charlotte Bankes – Individual and team Huw Nightingale – Individual and team Ski Cross: Ollie Davies Moguls: Makayla Gerken Schofield Mateo Jeannesson Some, including Mia Brookes , Charlotte Bankes, Zoe Atkin, & Kirsty Muir are medal contenders. Shortly after being officially told of her place on the Olympic team on Friday Mia Brookes won gold at the",
      "pub_date": "2026-01-24",
      "id": "0e36594be702",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Unofficial Networks",
      "title": "Skier Has Mammoth Crash On Double Black Diamond",
      "url": "https://unofficialnetworks.com/2026/01/24/kiwi-flats-mammoth-crash/",
      "description": "A skier crashed on the steep Kiwi Flats at Mammoth Mountain, but surprisingly left the situation unscathed.",
      "content": "Mammoth Lakes, California — If you’re looking for how to ski the Kiwi Flats, you’ll learn what not to do here. In this video, Brian Basconi shares his near-catastrophic crash on the Kiwi Flats at Mammoth Mountain. Situated off Chair 23, Kiwi Flats is one of the more technical chutes (if not the toughest trail) at the California ski resort. When Brian drops in, he accumulates a lot of speed. When Brian tries to get a turn to slow his momentum, he crashes and begins sliding down a rock-filled chute. Probably the craziest part of the video is when his right ski dislodged; it originally flew past him down the slope. However, as he picked up speed, that same ski came close to striking him. Remarkably, not only did he not get hurt by any of the equipment, but Basconi also left the crash unscathed. He attributed the slide to watching “too many Nikolai Schirmer videos the night before.” This Guy’s Crash Is A Perfect Guide On How NOT To Ski Corbet’s Couloir Image/Video Credits: Brian Basconi , ",
      "pub_date": "2026-01-24",
      "id": "92ddfdb90524",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-25"
    },
    {
      "source": "SnowBrains",
      "title": "2 Weeks Until the 2026 Winter Games—A Sneak Peek at the Alpine & Freestyle Skiing Highlights",
      "url": "https://snowbrains.com/100-days-until-the-2026-winter-games-a-sneak-peek-at-the-alpine-freestyle-skiing-highlights/",
      "description": "With only 14 days until the XXV Olympic Winter Games commence on February 6 it is time to start looking at the highlights of the Olympic calendar. There will be a total of 116 medal events at the Milano-Cortina Winter Games. We have highlighted some of the favorite events for the two weeks, with a focus on Alpine and Freestyle […] The post 2 Weeks Until the 2026 Winter Games—A Sneak Peek at the Alpine & Freestyle Skiing Highlights appeared first on SnowBrains .",
      "content": "Olympic rings in the Piazza della Scala in Milan, host of the 2026 Winter Games. | Image: Julia Schneemann With only 14 days until the XXV Olympic Winter Games commence on February 6 it is time to start looking at the highlights of the Olympic calendar. There will be a total of 116 medal events at the Milano-Cortina Winter Games. We have highlighted some of the favorite events for the two weeks, with a focus on Alpine and Freestyle skiing events. We will highlight Snowboard and Nordic events in a separate post to keep it visually digestible for readers—a LOT is going on! Please note that times are listed in local time (Central European Time). CET is 6 hours ahead of American Eastern Time, 8 hours ahead of Mountain Time, and 9 hours ahead of Pacific Time. (For our readers down under: this means 10 hours behind Australian Eastern Daylight Time, and 12 hours behind New Zealand Daylight Time). February 6 Opening Ceremony 8:30 p.m. Aleksander Aamodt Kilde pushing out off the starting gate a",
      "pub_date": "2026-01-23",
      "id": "e37a631aafb4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Snow Industry News",
      "title": "Belle Brockhoff Calls Time On Trailblazing Snowboard Cross Career",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/belle-brockhoff-calls-time-on-trailblazing-snowboard-cross-career/",
      "content": "Three-time Winter Olympian Belle Brockhoff has announced her retirement from competitive snowboarding, closing the curtain on a decade-long career that helped redefine Australia’s presence in Snowboard Cross. Born in Victoria in 1993, Brockhoff first hit the slopes as a toddler and was already winning national school titles by age ten. After debuting on the World Cup circuit as a teenager, she made the switch to Snowboard Cross, a move that would see her become one of Australia’s most successful and influential winter athletes. Across three Olympic campaigns in Sochi 2014, PyeongChang 2018, and Beijing 2022, Brockhoff was a consistent force on the world stage, highlighted by an eighth-place finish in her Olympic debut and a close fourth-place result in Beijing. Her World Cup career featured multiple podiums, including a historic gold medal in 2015 when she became the first Australian female to win a Snowboard Cross World Cup. In 2021, she added a World Championship title to her resume,",
      "pub_date": "2026-01-23",
      "id": "5278b8f2aac7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "ski-history",
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "The Ski Guru",
      "title": "Off-Piste & Backcountry Risks: Avalanche Safety – Read Before Skiing Off-Piste",
      "url": "https://www.the-ski-guru.com/2026/01/22/off-piste-backcountry-avalanche-risks/",
      "description": "Off-Piste & Backcountry Risks: Avalanche Safety Guide Off-piste skiing and backcountry travel offer freedom, fresh snow and adventure — but they also expose skiers to the highest avalanche risk in the mountains. Many avalanche accidents do not happen deep in remote terrain. They happen just outside marked pistes, in areas skiers believe are controlled, familiar or “not really … Continue reading \"Off-Piste & Backcountry Risks: Avalanche Safety – Read Before Skiing Off-Piste\" The post Off-Piste & ",
      "content": "Off-Piste & Backcountry Risks: Avalanche Safety Guide Off-piste skiing and backcountry travel offer freedom, fresh snow and adventure — but they also expose skiers to the highest avalanche risk in the mountains. Many avalanche accidents do not happen deep in remote terrain. They happen just outside marked pistes , in areas skiers believe are controlled, familiar or “not really off-piste”. Understanding why these situations are dangerous is essential for anyone leaving groomed slopes. What Does “Off-Piste” Really Mean? Off-piste skiing refers to any terrain outside marked and controlled ski runs . This includes: Slopes beside pistes Short traverses between runs Bowls accessed from lifts Areas beyond boundary ropes In most resorts, avalanche control is limited to marked pistes only . Once you leave them, you are responsible for your own safety — regardless of how close you remain to the ski area. Dan Egan skiing in Big Sky, Montana. Photo courtesy: Dan Egan. Dan offers ski clinics to tea",
      "pub_date": "2026-01-22",
      "id": "f90dc1385e9b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Ski Area Management",
      "title": "$100M Investment, Major Changes Coming to Mont-Sainte-Anne",
      "url": "https://www.saminfo.com/news/sam-headline-news/100m-investment-major-changes-coming-to-mont-sainte-anne",
      "description": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "content": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "pub_date": "2026-01-21",
      "id": "a1b0aac5f103",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "canada"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}