{
  "updated": "2026-01-23 11:14:29",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Snow Industry News",
      "title": "Atomic Pays Homage To The \"Herminator\" With Retro-Inspired Hermann Maier Skis",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/atomic-pays-homage-to-the-herminator-with-retro-inspired-hermann-maier-skis/",
      "content": "Atomic is tapping into alpine skiing nostalgia with the launch of the limited-edition X9S Beta Race 10.26, a modern performance ski that pays homage to the legendary equipment once raced by Austrian great Hermann Maier during his dominant run in the late 1990s and early 2000s. The collector's edition ski blends unmistakable retro aesthetics drawn from the original Beta Race models with contemporary race-proven construction, creating a tribute to one of the sport's most formidable competitors while showcasing Atomic's enduring World Cup heritage. The X9S Beta Race 10.26 draws visual inspiration directly from those championship years while hiding thoroughly modern engineering beneath its nostalgic graphics. Built for aggressive on-piste skiers, the ski features a Multi Radius Sidecut that allows it to snap through short turns while remaining composed and stable in longer GS-style arcs. Performance remains central to the design. Ultrawall sidewalls deliver precise edge grip and efficient ",
      "pub_date": "2026-01-23",
      "id": "4d4aaa32aba7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "ski-history"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "SnowBrains",
      "title": "2 Weeks Until the 2026 Winter Games—A Sneak Peek at the Alpine & Freestyle Skiing Highlights",
      "url": "https://snowbrains.com/100-days-until-the-2026-winter-games-a-sneak-peek-at-the-alpine-freestyle-skiing-highlights/",
      "description": "With only 14 days until the XXV Olympic Winter Games commence on February 6 it is time to start looking at the highlights of the Olympic calendar. There will be a total of 116 medal events at the Milano-Cortina Winter Games. We have highlighted some of the favorite events for the two weeks, with a focus on Alpine and Freestyle […] The post 2 Weeks Until the 2026 Winter Games—A Sneak Peek at the Alpine & Freestyle Skiing Highlights appeared first on SnowBrains .",
      "content": "Olympic rings in the Piazza della Scala in Milan, host of the 2026 Winter Games. | Image: Julia Schneemann With only 14 days until the XXV Olympic Winter Games commence on February 6 it is time to start looking at the highlights of the Olympic calendar. There will be a total of 116 medal events at the Milano-Cortina Winter Games. We have highlighted some of the favorite events for the two weeks, with a focus on Alpine and Freestyle skiing events. We will highlight Snowboard and Nordic events in a separate post to keep it visually digestible for readers—a LOT is going on! Please note that times are listed in local time (Central European Time). CET is 6 hours ahead of American Eastern Time, 8 hours ahead of Mountain Time, and 9 hours ahead of Pacific Time. (For our readers down under: this means 10 hours behind Australian Eastern Daylight Time, and 12 hours behind New Zealand Daylight Time). February 6 Opening Ceremony 8:30 p.m. Aleksander Aamodt Kilde pushing out off the starting gate a",
      "pub_date": "2026-01-23",
      "id": "e37a631aafb4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "PlanetSKI",
      "title": "Freeride World Tour Returns to Val Thorens",
      "url": "https://planetski.eu/2026/01/23/freeride-world-tour-returns-to-val-thorens/",
      "description": "The Freeride World Tour is in the high-altitude French resort for the Val Thorens Pro. The weather window is set from Saturday January 24th to Thursday 29th. NEW The post Freeride World Tour Returns to Val Thorens appeared first on PlanetSKI .",
      "content": "It marks the Tour’s return to Val Thorens for the second consecutive year and signals the revival of elite freeride competition on French soil after a long absence. PlanetSKI was in the resort last year for the buildup to the event: PlanetSKI is in France for the Freeride World Tour Val Thorens is in Les 3 Vallées, the world’s largest ski area, and it has once again been named World’s Best Ski Resort in the World Ski Awards. Its altitude of 2,300m, coupled with steep couloirs and dynamic faces, offers the perfect canvas for bold freeride performances. FWT at Val Thorens. Image c/o @freerideworldtour +J.Bernard. The French freeride star Léo Slemett will be competing as an Event Wildcard, making a special one-off appearance in the Ski Men category. The French freeride icon, who last appeared on the Tour in 2022, has since focused on personal film projects, including an emotional documentary released last autumn. Now fully recovered from injury and back on snow, Slemett will look to test ",
      "pub_date": "2026-01-23",
      "id": "bba3a4e4d137",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Unofficial Networks",
      "title": "Taos Ski Valley at 70: Why Better Still Beats Bigger",
      "url": "https://unofficialnetworks.com/2026/01/22/taos-ski-valley-at-70-why-better-still-beats-bigger/",
      "description": "As Taos Ski Valley celebrates its 70th anniversary, it’s hard not to notice how rare that kind of longevity feels in modern skiing. While many resorts chase expansion, amenities, and scale, Taos has spent seven decades doing something far harder, getting the fundamentals right. Over 72 hours on the mountain, Taos delivered a surprise powder […]",
      "content": "As Taos Ski Valley celebrates its 70th anniversary, it’s hard not to notice how rare that kind of longevity feels in modern skiing. While many resorts chase expansion, amenities, and scale, Taos has spent seven decades doing something far harder, getting the fundamentals right. Over 72 hours on the mountain, Taos delivered a surprise powder cycle, terrain that skis far bigger than it looks on paper, and an après scene that feels earned rather than manufactured. No mega villages. No endless lift sprawl. Just intentional skiing, strong snow, and a culture built around people who show up for the right reasons. Taos Ski Valley: Ski First. Always. Kachina Peak It was snowing in Taos when I arrived on Thursday afternoon. What started as moderate snowfall ended up delivering over a foot of fresh snow when all was said and done by Friday evening. Snowfall like this demands your attention at Taos. Long fall lines, hidden steeps, and features appear seemingly out of nowhere and terrain that you ",
      "pub_date": "2026-01-22",
      "id": "b6bc642da09a",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "weather-snow",
        "resort-operations"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "The Ski Guru",
      "title": "Aosta Council Backs Inter-Valley Link Between Pila and Cogne",
      "url": "https://www.the-ski-guru.com/2026/01/22/aosta-backs-inter-valley-link-pila-cogne/",
      "description": "The municipal council of Aosta has officially backed a proposal supporting the inter-valley link between the Pila ski resort and the village of Cogne — a move seen as a major step forward for regional tourism, connectivity and mountain mobility. The council approved the motion, presented by members of the Union Valdôtaine and Stella Alpina – Rassemblement Valdôtain, with 25 votes in favour … Continue reading \"Aosta Council Backs Inter-Valley Link Between Pila and Cogne\" The post Aosta Council Ba",
      "content": "The municipal council of Aosta has officially backed a proposal supporting the inter-valley link between the Pila ski resort and the village of Cogne — a move seen as a major step forward for regional tourism, connectivity and mountain mobility. The council approved the motion, presented by members of the Union Valdôtaine and Stella Alpina – Rassemblement Valdôtain , with 25 votes in favour out of 27 . Two councillors voted against it, but the overall support highlights broad political and community interest in exploring the proposal further. The sleepy town of Cogne, which is usually much colder than Aosta as it is in altitude, it is pretty cut off from the main valley, but part of its charm is that! Renown for its cross-country skiing, it has also a smaller alpine skiing resort, which is the one that they want to join to Pila. Photo: The-Ski-Guru. Proponents emphasised that while the council is not deciding how such a link would be built, the endorsement sends a clear message: the id",
      "pub_date": "2026-01-22",
      "id": "9d16839975b8",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "winter-sports"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "Belle Brockhoff Calls Time On Trailblazing Snowboard Cross Career",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/belle-brockhoff-calls-time-on-trailblazing-snowboard-cross-career/",
      "content": "Three-time Winter Olympian Belle Brockhoff has announced her retirement from competitive snowboarding, closing the curtain on a decade-long career that helped redefine Australia’s presence in Snowboard Cross. Born in Victoria in 1993, Brockhoff first hit the slopes as a toddler and was already winning national school titles by age ten. After debuting on the World Cup circuit as a teenager, she made the switch to Snowboard Cross, a move that would see her become one of Australia’s most successful and influential winter athletes. Across three Olympic campaigns in Sochi 2014, PyeongChang 2018, and Beijing 2022, Brockhoff was a consistent force on the world stage, highlighted by an eighth-place finish in her Olympic debut and a close fourth-place result in Beijing. Her World Cup career featured multiple podiums, including a historic gold medal in 2015 when she became the first Australian female to win a Snowboard Cross World Cup. In 2021, she added a World Championship title to her resume,",
      "pub_date": "2026-01-23",
      "id": "5278b8f2aac7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "ski-history",
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "SnowBrains",
      "title": "Wasatch Mountains, UT, Report: 3:30 A.M. Wake Up To Ski Scary ‘Glide Crack Gully’ in Wild Snow",
      "url": "https://snowbrains.com/wasatch-mountains-ut-report-330-a-m-wake-up-to-ski-scary-glide-crack-gully-in-wild-snow/",
      "description": "Report from January 21, 2025 3:30 am wake-up yesterday. Long drive through flashing lights and empty streets. Met up with local legend Juan Bakers. Hiking by 5:15 am. Goal: ski “Glide Crack Gully” in the light. Honestly, I was apprehensive about this line from the get-go, but I figured it was worth having a look in Juan was into it. […] The post Wasatch Mountains, UT, Report: 3:30 A.M. Wake Up To Ski Scary ‘Glide Crack Gully’ in Wild Snow appeared first on SnowBrains .",
      "content": "Report from January 21, 2025 3:30 am wake-up yesterday. Long drive through flashing lights and empty streets. Met up with local legend Juan Bakers . Hiking by 5:15 am. Goal: ski “Glide Crack Gully” in the light. Honestly, I was apprehensive about this line from the get-go, but I figured it was worth having a look in Juan was into it. He knows the Wasatch about as well as anyone after skiing all 91 lines in “The Chuting Gallery” and more. When we finally got eyes on the line, it looked OK. The glide cracks were clear, the main one had already released and it appeared that we could avoid its wrathful path nearly the entire climb and ski. We decided to keep moving. Juan was feeling it, as per usual, and put in the entire ski track and booter. Mini snow shoes were key this day. Zone one near dawn. Image: SnowBrains There was a crux or two where we pow-wowed and strongly considered turning around. Massive glide crack right in the chute proper revelaed themselves, the snow wasn’t great, and ",
      "pub_date": "2026-01-23",
      "id": "8228002c2c4f",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [],
      "approved_date": "2026-01-23"
    },
    {
      "source": "PlanetSKI",
      "title": "What A Time For PlanetSKI To Be In Canada",
      "url": "https://planetski.eu/2026/01/22/what-a-time-for-planetski-to-be-in-canada/",
      "description": "It’s an interesting time to be here – not just from a ski perspective with record-breaking amounts of snow, but also from a political one as Canada takes centre stage in the battle with Trump. NEW The post What A Time For PlanetSKI To Be In Canada appeared first on PlanetSKI .",
      "content": "The Canadian Prime Minister, Mark Carney, has just made what is being judged a landmark and historical speech in Davos as US President Trump threatens the existing world order with his ramblings and ‘policy statements’. Mark Carney’s words at the World Economic Forum seem to have galvanised opposition to Trump and given a strategy for the so-called ‘medium powers’ to rally and unify around. PlanetSKI has found that Canadians are shunning the USA – it’s neighbour and biggest trading partner. They have pretty much boycotted skiing there with numbers significantly down. The US has long been the number one travel destination for Canadians — an unsurprising statistic given the proximity of two countries. While it remains a top destination, the number of Canadians making trips south has dropped by more than 25%. That decline has been noticed by the American tourism industry, which forecast a loss of $5.7bn (£4.3bn) in tourism spending. For years Canadians have been the biggest source of inte",
      "pub_date": "2026-01-22",
      "id": "33b8a8a3cca4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "canada",
        "business-investment"
      ],
      "approved_date": "2026-01-22"
    },
    {
      "source": "Unofficial Networks",
      "title": "Chairlift Stalled Over Snowboard Competition Pummeled With Snowballs",
      "url": "https://unofficialnetworks.com/2026/01/22/chairlift-stalled-over-snowboard-competition-pummeled-with-snowballs/",
      "description": "Lets just say the peanut gallery temporarily turned into a shooting gallery as the crowd let loose a barrage of snowballs that would make Buddy The Elf smile.",
      "content": "The world’s best snowboarders were in the Swiss Alps last weekend to compete one of the biggest annual competitions and the final World Cup event before the Milan Cortina Olympics. The Laax Open featured tons of high flying theatrics as athletes soared out of the halfpipe and there also happen to be snowball bombardment next to the venue. This trio were on their way to score a better viewing spot of the finals when the chairlift stalled over the cheap seats and lets just say the peanut gallery temporarily turned into a shooting gallery as the crowd let loose a barrage of snowballs that would make Buddy The Elf smile. An unexpected moment happened on Saturday at the Laax Open Halfpipe Finals when a chairlift heading to a better viewing spot suddenly stopped, leaving three friends stranded as skiers below bombarded them with a heavy snowball barrage. Laax, Switzerland. pic.twitter.com/6xEeYIhFsb — Weather Monitor (@WeatherMonitors) January 22, 2026 It was all in good fun and once the cha",
      "pub_date": "2026-01-22",
      "id": "066534df22c7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "resort-operations",
        "international"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "The Ski Guru",
      "title": "What to Pack for a Half-Term Ski Trip with Your Family",
      "url": "https://www.the-ski-guru.com/2026/01/22/half-term-ski-packing-family/",
      "description": "Half-term ski holidays are exciting, busy, and often cold. Resorts are lively, temperatures can vary significantly, and when skiing with children, being well prepared makes all the difference. This practical guide focuses on layers, warmth, safety and comfort, with tips for both adults and children — especially younger kids, who feel the cold more quickly. The Golden … Continue reading \"What to Pack for a Half-Term Ski Trip with Your Family\" The post What to Pack for a Half-Term Ski Trip with Yo",
      "content": "Half-term ski holidays are exciting, busy, and often cold. Resorts are lively, temperatures can vary significantly, and when skiing with children, being well prepared makes all the difference . This practical guide focuses on layers, warmth, safety and comfort , with tips for both adults and children — especially younger kids, who feel the cold more quickly. The Golden Rule: Dress in Layers Layering allows you to adapt easily to changing weather, activity levels and temperatures. Family enjoys a day skiing on the mountain in Vail, CO. Photo Credit: Craig Orsini. Vail Resorts. Base Layer (Next to Skin) Thermal top and leggings Merino wool or synthetic fabrics (avoid cotton) For children: pack multiple base layers , as they get wet easily Mid-Layer (Warmth) Fleece or insulated mid-layer Wool or Merino jumper (excellent for colder days and for children) Lightweight down or synthetic jacket for very cold conditions Tip: two thin mid-layers are often more versatile than one bulky one. Outer",
      "pub_date": "2026-01-22",
      "id": "d891c86b7907",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Ski Area Management",
      "title": "$100M Investment, Major Changes Coming to Mont-Sainte-Anne",
      "url": "https://www.saminfo.com/news/sam-headline-news/100m-investment-major-changes-coming-to-mont-sainte-anne",
      "description": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "content": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "pub_date": "2026-01-21",
      "id": "a1b0aac5f103",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "canada"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "Skida x U.S. Ski & Snowboard Team: Gear That Supports The Journey",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/skida-x-us-ski-snowboard-team-gear-that-supports-the-journey/",
      "content": "Team USA apparel collaborations are having a distinct moment this winter, and with the Olympic Games Opening Ceremony just 16 days away, spiritwear has never looked better. Make your support count toward the athletes themselves and opt for winter accessories from Skida’s U.S. Ski & Snowboard Team Collection . For the beloved Vermont brand, backing the athletes has always been at the heart of its existence. It’s a cornerstone of why Corinne Prevot started the brand in the first place; to show up for the people who dedicate their lives to the sport, in spirit and in sales , as they chase their wildest dreams. For each signature pattern, Skida’s athlete ambassadors—olympians Paula Moltzan , Julia Kern , Ryan Cochran-Seigle , Gus Shumacher —work alongside Skida’s team to ensure their respective stories remain at the center of the pattern’s concept. From the local slopes of the Northeast to the towering glaciers of Alaska, each athlete brings his or her individual style and personality to t",
      "pub_date": "2026-01-23",
      "id": "8d16b7e96e35",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "SnowBrains",
      "title": "Matterhorn Paradise, Switzerland/Italy, Report: Crossing Countries on Skis—A Full Day Linking Zermatt and Cervinia",
      "url": "https://snowbrains.com/matterhorn-paradise-switzerland-italy-report-crossing-countries-on-skis-a-full-day-linking-zermatt-and-cervinia/",
      "description": "Report from January 20 There are ski days that feel productive. Then there are ski days that feel like you’ve unlocked a cheat code to the Alps. January 20 at Matterhorn Paradise, which spreads between Zermatt, Switzerland, and Breuil-Cervinia, Italy, was firmly the latter. We began the morning first thing, stepping out of our hotel into crisp alpine air and […] The post Matterhorn Paradise, Switzerland/Italy, Report: Crossing Countries on Skis—A Full Day Linking Zermatt and Cervinia appeared fi",
      "content": "The Matterhorn as viewed from the Gornergrat. | Image: Brett Ploss Report from January 20 There are ski days that feel productive. Then there are ski days that feel like you’ve unlocked a cheat code to the Alps. January 20 at Matterhorn Paradise , which spreads between Zermatt, Switzerland, and Breuil-Cervinia, Italy, was firmly the latter. We began the morning first thing, stepping out of our hotel into crisp alpine air and directly onto a train platform. Within minutes, we were boarding the Gornergrat Bahn , the iconic red cogwheel railway that climbs 5.8 miles from the village to the Gornergrat Observatory at 10,135 feet in just 33 minutes. No car, no parking lot, no shuttle bus. Just seamless rail-to-ski access that remains unmatched anywhere outside of the Alps. We met people who had left their apartments in Zurich or Geneva in ski boots that morning, rode public trains across Switzerland, and were there just like any other day. The Matterhorn during early day sunlight as viewed f",
      "pub_date": "2026-01-22",
      "id": "2427c1bf083f",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "international",
        "business-investment",
        "hospitality"
      ],
      "approved_date": "2026-01-22"
    },
    {
      "source": "PlanetSKI",
      "title": "PlanetSKI Heads Out with the Glenshee Ski Patrol",
      "url": "https://planetski.eu/2026/01/22/planetski-heads-out-with-the-glenshee-ski-patrol/",
      "description": "What is it like to be rescued by ski patrol? We went downhill in a stretcher to find out. PlanetSKI joins two days of professional ski patrol training in the Scottish Highlands. NEW The post PlanetSKI Heads Out with the Glenshee Ski Patrol appeared first on PlanetSKI .",
      "content": "Despite over 20 years of skiing, I’ve never been the most technical or agile person on the slopes. But that’s not the reason I find myself wrapped around a fence halfway down a green run at Glenshee Ski Centre on a Saturday afternoon in January. It is, thankfully, a training exercise that myself and others are taking part in. PlanetSKI with the Glenshee Ski Patrol. Image © Julia Clarke/PlanetSKI I’m here in the Scottish Highlands to shadow two days of training with the British Association of Ski Patrollers, BASP, and it’s my turn to be the casualty. Under the guidance of BASP president Gerard “Gerry” Cameron, I’ve skied about halfway down Claybokie, positioned myself as though my day has ended with a yard sale, and am now awaiting rescue from two men who are going through today’s training. Skiing and snowboarding are of course inherently risky – patroller and retired surgeon John Holmes, who’s here overseeing the first aid sessions, recalls seeing 13 broken collarbones in a single day ",
      "pub_date": "2026-01-22",
      "id": "6870bdf81d75",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-22"
    },
    {
      "source": "Unofficial Networks",
      "title": "Canadian Ski Resort Installs “Aurora Cam” To Watch Northern Lights From Home",
      "url": "https://unofficialnetworks.com/2026/01/22/canadian-ski-resort-installs-aurora-cam-to-watch-northern-lights-from-home/",
      "description": "We truly appreciate the folks at Sunshine Village Ski Resort in Alberta, Canada who placed a webcam pointed at the night skies over the Canadian Rockies.",
      "content": "While it is universally understood that there is no replacing the experience of witnessing the Northern Lights in person, we truly appreciate the folks at Sunshine Village Ski Resort in Alberta, Canada who placed a webcam pointed at the skies over the Canadian Rockies so anyone from anywhere around the world can tune in during Aurora Borealis events and watch the show. Predicting the probability of Aurora Borealis depends on geomagnetic activity, clear skies, and darkness. There is a moderate aurora possible tonight and the next few days in Alberta so perhaps the skies will light up on the webcam tonight. Here are a few resource for real-time monitoring of geomagnetic activity, which produces Aurora Borealis: – https://www.spaceweatherlive.com/en/auroral-activity/aurora-forecast.html – https://www.swpc.noaa.gov/products/aurora-viewline-tonight-and-tomorrow-night-experimental – https://auroraforecast.com/ – https://www.aurorawatch.ca/ Remember, Aurora can ramp up quickly with 30-60 minu",
      "pub_date": "2026-01-22",
      "id": "b9711ebdce62",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [],
      "approved_date": "2026-01-23"
    },
    {
      "source": "The Ski Guru",
      "title": "Crevasses & Glaciers: The Hidden Winter Danger",
      "url": "https://www.the-ski-guru.com/2026/01/21/crevasses-glaciers-hidden-winter-danger/",
      "description": "Crevasses & Glaciers: The Hidden Winter Danger Glaciers are often associated with summer mountaineering — ropes, harnesses and visible crevasses. In winter, however, glaciers can appear deceptively smooth, white and skiable. This illusion of safety is one of the reasons crevasses and glaciers remain among the most underestimated winter dangers in the mountains. This article explains why glaciers … Continue reading \"Crevasses & Glaciers: The Hidden Winter Danger\" The post Crevasses & Glaciers: Th",
      "content": "Crevasses & Glaciers: The Hidden Winter Danger Glaciers are often associated with summer mountaineering — ropes, harnesses and visible crevasses. In winter, however, glaciers can appear deceptively smooth, white and skiable. This illusion of safety is one of the reasons crevasses and glaciers remain among the most underestimated winter dangers in the mountains. This article explains why glaciers are still hazardous in winter , how crevasses behave under snow, and why even experienced skiers can fall victim to hidden traps. Hansbreen Glacier, Svalsbard. Photo: Bartek Luks Aya. Unsplash. Crevasses & Glaciers: The Hidden Winter Danger. Why Glaciers Are Still Dangerous in Winter Snow does not remove crevasses — it hides them . During winter: Crevasses are covered by snow bridges Surface terrain appears uniform Visual warning signs are often absent Snow bridges can collapse suddenly under the weight of a skier, snowboarder or group — often without warning . Unlike avalanches, crevasse falls",
      "pub_date": "2026-01-21",
      "id": "b7f740bf0134",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Ski Area Management",
      "title": "Boyne Resorts Launches Independent Charitable Foundation",
      "url": "https://www.saminfo.com/news/sam-headline-news/boyne-resorts-launches-independent-charitable-foundation",
      "description": "SAM Magazine—Boyne Falls, Mich., Jan. 21, 2026— Boyne Resorts has launched the Boyne Forever Foundation, an independent 501(c)(3) public charity that will coordinate philanthropic giving and grantmaking across the company’s 13 North American properties. The foundation will focus on three areas: environmental stewardship, community investment, and support for employees. Structured as a standalone public charity, the Boyne Forever Foundation consolidates philanthropic efforts that were previously ",
      "content": "SAM Magazine—Boyne Falls, Mich., Jan. 21, 2026— Boyne Resorts has launched the Boyne Forever Foundation, an independent 501(c)(3) public charity that will coordinate philanthropic giving and grantmaking across the company’s 13 North American properties. The foundation will focus on three areas: environmental stewardship, community investment, and support for employees. Structured as a standalone public charity, the Boyne Forever Foundation consolidates philanthropic efforts that were previously ",
      "pub_date": "2026-01-21",
      "id": "65f06376605b",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}