{
  "updated": "2026-01-08 11:14:47",
  "total_articles": 38,
  "articles": [
    {
      "source": "PlanetSKI",
      "title": "SIGB Launches New Facilities Membership",
      "url": "https://planetski.eu/2026/01/07/sigb-launches-new-facilities-membership/",
      "description": "It is designed to bring UK snowsports venues, including artificial slopes, indoor snowdomes, revolving slopes, and mountain resorts, closer to the heart of the industry. NEW The post SIGB Launches New Facilities Membership appeared first on PlanetSKI .",
      "content": "This new category from The Snowsports Industry of Great Britain (SIGB) provides facilities with deeper industry connections, shared resources, and opportunities to collaborate with the industry across the UK. Facilities Members will join a national network already made up of snowsport brands, agents, distributors, retailers, travel organisations, and media, uniting to help the sport to thrive. To learn more, download the application information here . Apply to become an SIGB Facilities Member via the SIGB website . To further support grassroots growth, the SIGB has introduced the Grassroots Growth Grant, a funding programme open exclusively to Facilities Members. This initiative is designed to help the SIGB identify and support deserving projects across the UK that aim to increase snowsports participation: Subsidising sessions Reducing access barriers Developing innovative community programmes. By welcoming facilities into membership, the SIGB can directly connect with operators delive",
      "pub_date": "Wed, 07 Jan 2026 17:36:43 +0000",
      "id": "265fe768e00f",
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "hospitality",
      "secondary_categories": []
    },
    {
      "source": "The Ski Guru",
      "title": "❄️ Alpine Weather: Cold and Snowier Patterns Moving In",
      "url": "https://www.the-ski-guru.com/2026/01/07/alps-snow-forecast-jan-2026/",
      "description": "🔥 Colder Temperatures & Increasing Snowfall Alps Snow Forecast & North American Winter Storm Update – Jan 2026 After a period of cold but relatively dry conditions, the weather in the Alps is about to shift. Snow forecasts over the next few days are much stronger than earlier this week: 🌨 Why This Matters This shift from … Continue reading \"❄️ Alpine Weather: Cold and Snowier Patterns Moving In\" The post ❄️ Alpine Weather: Cold and Snowier Patterns Moving In appeared first on The-Ski-Guru .",
      "content": "Colder Temperatures & Increasing Snowfall Alps Snow Forecast & North American Winter Storm Update – Jan 2026 After a period of cold but relatively dry conditions , the weather in the Alps is about to shift. Snow forecasts over the next few days are much stronger than earlier this week : Up to 50–70 cm of snow is forecast above ~1500 m across the northern and western Alps — including parts of the French Alps (e.g., 3 Valleys, Portes du Soleil) and western Swiss Alps (Verbier, Valais) by Sunday. weathertoski.co.uk More widespread accumulations of 25–50 cm are expected over much of the northwestern Alpine chain . weathertoski.co.uk A stronger snowstorm continues to track for the northern Alps , with models even suggesting local 2 m+ totals at very high elevations if moisture and cold align. OpenSnow Snow on the way to Kirkwood. Lake Tahoe photo. Alpine Weather: Cold and Snowier Patterns Moving In Colder Temperatures & Increasing Snowfall. Why This Matters This shift from dry, cold air to ",
      "pub_date": "Wed, 07 Jan 2026 17:09:05 +0000",
      "id": "110936be9588",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "weather-snow",
      "secondary_categories": [
        "international"
      ]
    },
    {
      "source": "Ski Area Management",
      "title": "Minnesota Ski Areas Generated $359 Million Economic Impact in Winter 2024-25",
      "url": "https://www.saminfo.com/news/sam-headline-news/minnesota-ski-areas-generated-359-million-economic-impact-in-winter-2024-25",
      "description": "SAM Magazine—St. Paul, Minn., Jan. 7, 2026—Minnesota’s 18 operating ski areas generated $359.1 million in total economic value to the state during the 2024-25 winter season, according to an analysis commissioned by the Minnesota Ski Areas Association (MNSAA) and conducted by RRC Associates. The study captured both direct spending at ski areas and the broader ripple effects across local and regional economies. Direct economic activity, including visitor spending and ski area capital investments, ",
      "content": "SAM Magazine—St. Paul, Minn., Jan. 7, 2026—Minnesota’s 18 operating ski areas generated $359.1 million in total economic value to the state during the 2024-25 winter season, according to an analysis commissioned by the Minnesota Ski Areas Association (MNSAA) and conducted by RRC Associates. The study captured both direct spending at ski areas and the broader ripple effects across local and regional economies. Direct economic activity, including visitor spending and ski area capital investments, ",
      "pub_date": "Wed, 07 Jan 2026 13:05:35 -0500",
      "id": "aa9821d1f882",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality",
        "transportation"
      ]
    },
    {
      "source": "Ski Area Management",
      "title": "Special Report: SAM Technology Survey Shows Tech’s Rising Strategic Role at Ski Resorts",
      "url": "https://www.saminfo.com/news/sam-headline-news/special-report-sam-technology-survey-shows-techs-rising-strategic-role-at-ski-resorts",
      "description": "SAM Magazine—Natick, Mass., Jan. 7, 2026—Resorts are investing more in technology and increasingly treating it as a strategic priority, according to SAM’s 2025–26 Technology Survey . Respondents indicated the next wave of investment is focused on system integration, guest-facing services, and using data to inform operational and revenue decisions, even as cost and vendor constraints persist. SAM collected responses from 75 resort professionals across North America who hail from a diverse mix of ",
      "content": "SAM Magazine—Natick, Mass., Jan. 7, 2026—Resorts are investing more in technology and increasingly treating it as a strategic priority, according to SAM’s 2025–26 Technology Survey . Respondents indicated the next wave of investment is focused on system integration, guest-facing services, and using data to inform operational and revenue decisions, even as cost and vendor constraints persist. SAM collected responses from 75 resort professionals across North America who hail from a diverse mix of ",
      "pub_date": "Wed, 07 Jan 2026 10:09:13 -0500",
      "id": "18f0d7e6bd4d",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "business-investment",
      "secondary_categories": [
        "transportation"
      ]
    },
    {
      "source": "New York Times - Travel",
      "title": "5 Places to Channel the Olympic Spirit Without Attending the Games in Italy",
      "url": "https://www.nytimes.com/2026/01/07/travel/winter-olympic-sites-united-states-canada.html",
      "description": "Can’t make it to Italy for the Winter Olympics? No worries, these spots in North America offer a taste of the Games (and let you try everything from speedskating to ski jumping, if you dare).",
      "content": "Can’t make it to Italy for the Winter Olympics? No worries, these spots in North America offer a taste of the Games (and let you try everything from speedskating to ski jumping, if you dare).",
      "pub_date": "Wed, 07 Jan 2026 10:02:20 +0000",
      "id": "cd3df9ef8b29",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 3)"
      },
      "approved_date": "2026-01-08",
      "category": "winter-sports",
      "secondary_categories": []
    },
    {
      "source": "PlanetSKI",
      "title": "Crans-Montana Bar Not Safety Checked for Five Years",
      "url": "https://planetski.eu/2026/01/07/crans-montana-bar-not-safety-checked-for-5-years/",
      "description": "A catalogue of errors is emerging following the fire at Le Constellation Bar in the Swiss resort that killed 40 people & injured 116. Questions are asked about regulation authorities. UPDATED The post Crans-Montana Bar Not Safety Checked for Five Years appeared first on PlanetSKI .",
      "content": "The Mayor of Crans-Montana, Nicolas Feraud, has said that he could not explain why Le Constellation bar had not been checked in so long, but that the council was “profoundly sorry”. Venues in the Swiss ski resort should have been checked on a regular basis. “We regret that – we owe it to the families and we will accept the responsibility,” he said at a news conference. Taking repeated questions on why the bar had not been checked in so long, Feraud said: “I have no answer for you today.” “We’re profoundly sorry about that and I know how hard that will be for the families.” Sparklers on bottles being carried too close to the ceiling were the likely cause of the fire, a preliminary investigation has found. The Mayor said he was not considering resigning after the tragedy. “You don’t leave the ship in the middle of a storm,” Feraud said. “We are also victims and those affected by this drama.” He said he will carry the suffering of all affected families for a lifetime and “I will never be ",
      "pub_date": "Wed, 07 Jan 2026 02:43:52 +0000",
      "id": "49a6365f283e",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "safety-incidents",
      "secondary_categories": []
    },
    {
      "source": "New York Times - Travel",
      "title": "In Norway, Skiing Through a Winter Wonderland",
      "url": "https://www.nytimes.com/2025/12/23/travel/norway-crosscountry-skiing.html",
      "description": "A 100-mile journey along the country’s Troll Trail includes stunning vistas, snowbound mountain hotels and waffles.",
      "content": "A 100-mile journey along the country’s Troll Trail includes stunning vistas, snowbound mountain hotels and waffles.",
      "pub_date": "Tue, 23 Dec 2025 10:00:45 +0000",
      "id": "5da734010477",
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 3)"
      },
      "approved_date": "2026-01-08",
      "category": "hospitality",
      "secondary_categories": [
        "transportation"
      ]
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "We’re Excited to Announce a New Strategic Partnership Between SIA and the European Outdoor Group (EOG), Uniting Two Industry Leaders to Better Support Our Members and Strengthen the Global Ecosystem.",
      "url": "https://www.snowsports.org/were-excited-to-announce-a-new-strategic-partnership-between-sia-and-the-european-outdoor-group-eog-uniting-two-industry-leaders-to-better-support-our-members-and-strengthen-the-global-eco/",
      "description": "Current SIA Premium voting members (to be assessed on a case-by-case basis) can now purchase anInternational Add-On EOG Membership for $500/year. This membership grants you fullaccess to EOG’s premium benefits, including exclusive data, webinars, and eventinvitations. Benefits include: To learn more, reach out to Bill Stone, SIA Membership Director at bstone@snowsports.org or call +1 435-659-3729. The post We’re Excited to Announce a New Strategic Partnership Between SIA and the European Outdoor",
      "content": "Current SIA Premium voting members (to be assessed on a case-by-case basis) can now purchase an International Add-On EOG Membership for $500/year. This membership grants you full access to EOG’s premium benefits, including exclusive data, webinars, and event invitations. Benefits include: Complimentary access to EOG’s CSR Newsletter and Executive Updates. EOG’s State of Trade topline insights: The State of Trade report delivers annual sell-in data for the European outdoor market. The report measures wholesale value and units by season across Apparel, Footwear and Equipment. European Outdoor Market Intelligence Service (@ EOG Member pricing): This new data service from the EOG and Sporting Insights provides retail sell-out analysis for the outdoor market. The dashboard is now live in the UK and France and will launch in Germany, Austria and Switzerland in Fall 2025. A Winter Sports dashboard is set to launch in 2026. Carbon Reduction Project (@ EOG Member pricing): The aim of this proje",
      "pub_date": "Tue, 22 Jul 2025 22:46:36 +0000",
      "id": "2aa67a59c266",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "international",
      "secondary_categories": [
        "business-investment"
      ]
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "Tue, 16 Dec 2025 22:40:21 +0000",
      "id": "1d9a748dbb2c",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ]
    },
    {
      "source": "The Ski Guru",
      "title": "Too Many Skiers, Too Much Speed?",
      "url": "https://www.the-ski-guru.com/2026/01/06/ski-slope-overcrowding-safety/",
      "description": "What Overcrowded Slopes, High-Speed Lifts & Artificial Snow Mean for Your Safety Too Many Skiers on the Slopes? Crowding, Speed & Safety Explained If you’ve skied during peak weeks in recent seasons, you’ve probably felt it:busier slopes, faster lifts, more people moving at very different speeds — all at once. While skiing has always involved … Continue reading \"Too Many Skiers, Too Much Speed?\" The post Too Many Skiers, Too Much Speed? appeared first on The-Ski-Guru .",
      "content": "What Overcrowded Slopes, High-Speed Lifts & Artificial Snow Mean for Your Safety Too Many Skiers on the Slopes? Crowding, Speed & Safety Explained If you’ve skied during peak weeks in recent seasons, you’ve probably felt it: busier slopes, faster lifts, more people moving at very different speeds — all at once. While skiing has always involved risk, many skiers are now asking a valid question: Are modern ski resorts becoming less safe — not because of the mountains, but because of how many of us are on them at the same time? Let’s break this down in a realistic, skier-to-skier way , without panic — just facts, context, and common sense. 1. When Slopes Get Crowded, Risk Goes Up (It’s Simple Physics) Crowding doesn’t just affect your enjoyment — it changes how accidents happen . Studies on ski injuries consistently show that: Collision risk increases with slope density Most serious accidents happen on groomed runs , not off-piste The biggest factor is not equipment — it’s human behaviour",
      "pub_date": "Tue, 06 Jan 2026 13:39:59 +0000",
      "id": "7b1a023430a6",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations"
      ]
    },
    {
      "source": "PlanetSKI",
      "title": "Victims of Crans-Montana Bar Fire Identified",
      "url": "https://planetski.eu/2026/01/06/victims-of-crans-montana-bar-fire-identified/",
      "description": "Forty people were killed when a fire tore through a busy venue in Crans-Montana on New Year's Eve. NEW The post Victims of Crans-Montana Bar Fire Identified appeared first on PlanetSKI .",
      "content": "The victims ranged from 14 to 39 years old. The drinking age at the bar was 16. While the dead had been identified work has been taking place to establish the identities of the injured. Some remain in a critical condition. Swiss police confirmed on Monday that 83 people are still in hospital. Most of the injured suffered severe burns, which in some cases meant they could not be identified. See here for our main news report on the incident: 40 people killed in fire at bar in Crans-Montana Plus a post on the reaction from the snowsport world: Global ski community comes together to support Crans-Montana A criminal investigation has been launched into the French couple that ran the Le Constellation bar. Sparklers on bottles being carried too close to the ceiling were the likely cause of the fire, a preliminary investigation has found. Beatrice Pilloud, Valais canton lead prosecutor, said in a statement that investigators were looking into whether the acoustic foam on the venue’s ceiling wa",
      "pub_date": "Tue, 06 Jan 2026 02:40:26 +0000",
      "id": "a0b57e9837d0",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": []
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "Thu, 21 Aug 2025 07:01:00 +0000",
      "id": "49d7a2d2d62b",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "business-investment",
      "secondary_categories": []
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "Thu, 12 Dec 2024 00:18:25 +0000",
      "id": "c0daeacca788",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "international",
      "secondary_categories": []
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Upper Midwest’s premier outdoor & snowsports trade associations merge",
      "url": "https://www.snowsports.org/upper-midwests-premier-outdoor-snowsports-trade-associations-merge/",
      "description": "Madison, WI, January 1, 2025–Effective January 1, Midwest Winter Sports Reps Association (MWSRA) and Outdoor Reps Association (ORA) will merge to form Midwest Professional Reps Organization, or M-Pro. The new group will be an all-season resource for sales reps and retailers in outdoor, winter sports, and the various categories that touch them. Founded in the […] The post Upper Midwest’s premier outdoor & snowsports trade associations merge appeared first on Snowsports Industries America .",
      "content": "Madison, WI, January 1, 2025– Effective January 1, Midwest Winter Sports Reps Association (MWSRA) and Outdoor Reps Association (ORA) will merge to form Midwest Professional Reps Organization, or M-Pro. The new group will be an all-season resource for sales reps and retailers in outdoor, winter sports, and the various categories that touch them. Founded in the 70s (MWSRA) and 80s (ORA), the two predecessor organizations have for decades provided trade shows and informational resources to facilitate rep/retailer relationships. With substantial member overlap, the two boards of directors proposed a merger and the combined membership voted overwhelmingly to approve. The new organization is currently planning 4 shows per year, 2 summer and 2 winter, with one per season in Saint Paul, MN and Madison, WI. These show attract retailers from as far west as Nebraska and the Dakotas, south to Missouri, east to Illinois, and north to the Michigan upper peninsula. The association website is configur",
      "pub_date": "Thu, 02 Jan 2025 20:33:38 +0000",
      "id": "82f8502a6dfd",
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "business-investment",
      "secondary_categories": []
    },
    {
      "source": "The Ski Guru",
      "title": "Telluride Ski Patrol Strike: What’s Happening, What’s Been Agreed — and Why It Matters",
      "url": "https://www.the-ski-guru.com/2025/12/28/telluride-ski-patrol-strike-update/",
      "description": "Telluride Ski Patrol Strike Shuts Down Resort — What We Know One of Colorado’s most iconic ski resorts has become the focal point of a major labor dispute this winter. The ski patrol strike at Telluride Ski Resort has already led to resort closures during the critical holiday period — an unusually strong signal of how unresolved workforce issues … Continue reading \"Telluride Ski Patrol Strike: What’s Happening, What’s Been Agreed — and Why It Matters\" The post Telluride Ski Patrol Strike: What’s",
      "content": "Telluride Ski Patrol Strike Shuts Down Resort — What We Know One of Colorado’s most iconic ski resorts has become the focal point of a major labor dispute this winter. The ski patrol strike at Telluride Ski Resort has already led to resort closures during the critical holiday period — an unusually strong signal of how unresolved workforce issues are increasingly affecting ski operations in North America. Here’s where things currently stand, what (if anything) has been agreed, and whether similar actions are emerging elsewhere in the U.S. or Canada. The beautiful ski resort of Telluride. Photo: Visit Telluride. Telluride Ski Patrol Strike: What’s Happening, What’s Been Agreed — and Why It Matters. What Triggered the Telluride Ski Patrol Strike? The dispute involves the Telluride Professional Ski Patrol Association (TPSPA) , which represents the resort’s ski patrollers at Telluride Ski Resort . Contract negotiations between patrol representatives and resort management had been ongoing fo",
      "pub_date": "Sun, 28 Dec 2025 16:44:42 +0000",
      "id": "e723bafa4f89",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": [
        "safety-incidents",
        "canada"
      ]
    },
    {
      "source": "The Ski Guru",
      "title": "Colorado Ski Resorts Face One of the Weakest Starts on Record",
      "url": "https://www.the-ski-guru.com/2025/12/28/colorado-ski-resorts-2025-26-season-update/",
      "description": "Colorado Ski Resorts Face One of the Weakest Starts on Record. Winter 2025–26 Season Update The winter season has officially begun in Colorado, but for many of its ski resorts, the start could hardly be described as typical. Historically low snowpack, unusually warm temperatures, and even rain in mountain towns over Christmas have combined to create one of … Continue reading \"Colorado Ski Resorts Face One of the Weakest Starts on Record\" The post Colorado Ski Resorts Face One of the Weakest Star",
      "content": "Colorado Ski Resorts Face One of the Weakest Starts on Record. Winter 2025–26 Season Update The winter season has officially begun in Colorado , but for many of its ski resorts, the start could hardly be described as typical. Historically low snowpack, unusually warm temperatures, and even rain in mountain towns over Christmas have combined to create one of the weakest early-season openings on record. While January and February still hold the potential to reshape the season, current conditions are raising concerns for ski resorts, travelers, and mountain communities alike. Webcam of the base area of Crested Butte Mountain Resort with some new inches of snow on 28th Decamber 2025. Photo: skicb.com Colorado Ski Resorts Face One of the Weakest Starts on Record . Historic Low Snowpack Across Colorado According to statewide monitoring data, Colorado entered the winter season with snowpack levels around 54% of the historical median — tied for the lowest start on record . This early deficit i",
      "pub_date": "Sun, 28 Dec 2025 16:03:15 +0000",
      "id": "94f4ffa33181",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": [
        "weather-snow"
      ]
    },
    {
      "source": "The Ski Guru",
      "title": "Tourists Arrive, but the Snow Doesn’t: A Worrying Winter Across the Italian Alps",
      "url": "https://www.the-ski-guru.com/2025/12/20/italian-alps-winter-no-snow-tourism-impact/",
      "description": "Seiser Alms. Photo: IDM Südtirol. One of the best reporting better snow conditions. The post Tourists Arrive, but the Snow Doesn’t: A Worrying Winter Across the Italian Alps appeared first on The-Ski-Guru .",
      "content": "Tourists Arrive, but Snow Is Missing Across the Italian Alps Introduction The 2025 winter season in the Italian Alps is once again highlighting a difficult and increasingly familiar reality: tourists are arriving on schedule, but snow conditions are not. Skiers may also enjoy sunbathing on a terrace in the wintery landscape of Plan de Corones/Kronplatz, one of the most popular ski resorts of South Tyrol/Südtirol. Tourists Arrive, but the Snow Doesn’t: A Worrying Winter Across the Italian Alps. From South Tyrol to Trentino and across the Dolomites, ski resorts are facing closed pistes, rain at altitude, reduced snowpack, and mounting climate-related risks — all with immediate consequences for tourism and long-term implications for mountain regions. South Tyrol & Trentino: Pistes Closed, Rain Falling at 1,800 Metres In South Tyrol , approximately 25% of ski slopes are currently closed due to insufficient snow cover. Despite peak holiday demand, resorts are struggling to maintain skiable ",
      "pub_date": "Sat, 20 Dec 2025 16:46:14 +0000",
      "id": "c0d9e1b8cf61",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "international",
      "secondary_categories": [
        "weather-snow",
        "safety-incidents"
      ]
    },
    {
      "source": "PlanetSKI",
      "title": "Two People Die in Avalanches in Italy",
      "url": "https://planetski.eu/2026/01/03/two-people-die-in-avalanches-in-italy/",
      "description": "The accidents happened in Piedmont and in the north eastern Italian region of Veneto. Poor weather hindered rescue efforts. The post Two People Die in Avalanches in Italy appeared first on PlanetSKI .",
      "content": "A first avalanche hit the southwest Alpine Maira Valley, near the French border in the Italian region of Piedmont. It killed one person and injured two others. One of them is in critical condition. Rescue teams had to set out on foot as strong winds prevented helicopters from taking off. In the north eastern Italian region of Veneto, an avalanche on the Vajo Gabene slope in the Small Dolomites killed a 50-year-old ski mountaineer. Rescue teams reached him by helicopter but were unable to save him. A combination of heavy snowfall and strong winds has raised avalanche risks across some parts of the Alps in recent days. A second avalanche occurred near Pragelato – a ski area about 60 km to the west of Turin. A woman caught in the avalanche was able to free herself, but was unable to move because of injuries. Rescue teams were working to evacuate her, with helicopters again limited by adverse weather conditions. Authorities said they were monitoring reports of a third avalanche in Piedmont",
      "pub_date": "Sat, 03 Jan 2026 07:14:56 +0000",
      "id": "b858c560a7f4",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "safety-incidents",
      "secondary_categories": [
        "international",
        "weather-snow"
      ]
    },
    {
      "source": "The Ski Guru",
      "title": "Madonna di Campiglio Introduces Daily Ski Pass Limits: A First for Major Italian Resorts",
      "url": "https://www.the-ski-guru.com/2025/12/29/madonna-di-campiglio-ski-pass-limit/",
      "description": "Madonna di Campiglio Introduces Daily Ski Pass Limits For the first time, Madonna di Campiglio is introducing a daily capacity limit on ski passes, marking an important shift in how Alpine resorts are addressing overcrowding, safety, and guest experience during peak periods. According to Corriere del Trentino, the resort has set a maximum threshold of 14,000 daily ski pass entries during the … Continue reading \"Madonna di Campiglio Introduces Daily Ski Pass Limits: A First for Major Italian Reso",
      "content": "Madonna di Campiglio Introduces Daily Ski Pass Limits For the first time, Madonna di Campiglio is introducing a daily capacity limit on ski passes, marking an important shift in how Alpine resorts are addressing overcrowding, safety, and guest experience during peak periods. According to Corriere del Trentino , the resort has set a maximum threshold of 14,000 daily ski pass entries during the busiest hours of the day, in an effort to better manage skier flows on the mountain. Why a Cap on Ski Passes? The reasoning is refreshingly straightforward. Resort management summed it up with a simple analogy: “A restaurant with 200 seats cannot serve 300 people.” The Dolomiti di Brenta. Photo: Visit Trentino. Madonna di Campiglio. Madonna di Campiglio Introduces Daily Ski Pass Limits: A First for Major Italian Resorts. Applied to skiing, the message is clear: pistes, lifts, and mountain services have a natural capacity limit . When that limit is exceeded, the experience deteriorates for everyone",
      "pub_date": "Mon, 29 Dec 2025 19:08:52 +0000",
      "id": "263b2adba13a",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": [
        "safety-incidents"
      ]
    },
    {
      "source": "The Ski Guru",
      "title": "West Coast Ski Resorts: From a Slow Start to Extreme Swings",
      "url": "https://www.the-ski-guru.com/2025/12/29/west-coast-ski-resorts-winter-update/",
      "description": "Mammoth, Tahoe, Whistler & the Pacific Coast — Winter Update West Coast Ski Resorts See Extreme Swings as Winter Takes Hold After a hesitant and uneven start to winter, West Coast ski resorts in the United States and Canada are now experiencing some of the most dramatic weather swings of the season — from drought-like conditions to intense snowstorms, … Continue reading \"West Coast Ski Resorts: From a Slow Start to Extreme Swings\" The post West Coast Ski Resorts: From a Slow Start to Extreme Swi",
      "content": "Mammoth, Tahoe, Whistler & the Pacific Coast — Winter Update West Coast Ski Resorts See Extreme Swings as Winter Takes Hold After a hesitant and uneven start to winter, West Coast ski resorts in the United States and Canada are now experiencing some of the most dramatic weather swings of the season — from drought-like conditions to intense snowstorms, rapid snowpack gains, and heightened avalanche risk. This volatility is shaping operations, safety decisions, and traveler expectations across the Pacific mountain corridor. Mammoth, Tahoe, Whistler & the Pacific Coast — Winter Update. Mammoth Mountain: Big Snow Comes With Big Risk At Mammoth Mountain , the season flipped almost overnight. After a slow early December, powerful Sierra Nevada storms delivered several feet of snow in a short period , dramatically improving base depths and terrain coverage. Mammoth’s high elevation allowed it to capitalize quickly on the storms, pushing the resort back into mid-winter conditions. However, the",
      "pub_date": "Mon, 29 Dec 2025 18:53:52 +0000",
      "id": "72afaeeba552",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "weather-snow",
      "secondary_categories": [
        "safety-incidents",
        "canada",
        "hospitality"
      ]
    },
    {
      "source": "The Ski Guru",
      "title": "Glaciers Are No Longer “Stable”: What Alpine Authorities Are Being Told to Do About It",
      "url": "https://www.the-ski-guru.com/2025/12/22/glacial-periglacial-risk-alps/",
      "description": "Glacial and Periglacial Risk in the Alps: What Authorities Are Being Told to Do For decades, glaciers in the Alps were treated as slow, predictable features of the mountain landscape. Today, that assumption no longer holds. A new technical document published by Fondazione Montagna Sicura, in collaboration with Italy’s Civil Protection system and scientific partners, makes this … Continue reading \"Glaciers Are No Longer “Stable”: What Alpine Authorities Are Being Told to Do About It\" The post Gla",
      "content": "Glacial and Periglacial Risk in the Alps: What Authorities Are Being Told to Do For decades, glaciers in the Alps were treated as slow, predictable features of the mountain landscape . Today, that assumption no longer holds. A new technical document published by Fondazione Montagna Sicura , in collaboration with Italy’s Civil Protection system and scientific partners, makes this very clear: glacial and periglacial areas are becoming more unstable, more unpredictable, and more dangerous — and everyone involved in mountain management needs to adapt. The report, “Glacial and Periglacial Risk in Alpine Environments – A Methodological Framework” , is not written for tourists. It is written for the people responsible for keeping mountain regions safe — and its recommendations reveal how deeply climate change is reshaping the Alps. Photo: Mauro Hernandez. Unsplash. Glaciers Are No Longer “Stable”: What Alpine Authorities Are Being Told to Do About It. The Core Message: Risk Is No Longer Excep",
      "pub_date": "Mon, 22 Dec 2025 21:04:16 +0000",
      "id": "7384b95ea4ca",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "weather-snow",
      "secondary_categories": [
        "international"
      ]
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Protect the U.S. Winter Outdoor Industry from Harmful Tariffs",
      "url": "https://www.snowsports.org/protect-the-u-s-winter-outdoor-industry-from-harmful-tariffs/",
      "description": "As the winter season begins, burdensome tariffs are currently applied to key products essential to winter sports participation. These unnecessary tariffs act as a direct tax on our consumers, discouraging them from purchasing new gear and participating in winter outdoor sports. This, in turn, threatens the health of the outdoor recreation economy, which generates $1.2 […] The post Protect the U.S. Winter Outdoor Industry from Harmful Tariffs appeared first on Snowsports Industries America .",
      "content": "As the winter season begins, burdensome tariffs are currently applied to key products essential to winter sports participation. These unnecessary tariffs act as a direct tax on our consumers, discouraging them from purchasing new gear and participating in winter outdoor sports. This, in turn, threatens the health of the outdoor recreation economy, which generates $1.2 trillion for the US economy, and the economic stability of our small and medium-sized businesses and local retailers. Please send a note to your Congressperson below, urging them to help eliminate the tariffs on winter outdoor gear. Take Action Now! It’s Easy, Here’s How: Send a letter to your congressperson. We’ve made it very easy with a few clicks. Personal letters are the most powerful, so please edit the copy however you wish by clicking on the yellow “edit message” button or include a personal story about the impacts of the tariffs on your business, employees, etc., at the “share your story” prompt. Make a phone cal",
      "pub_date": "Mon, 17 Nov 2025 20:13:01 +0000",
      "id": "a0ba8c1d600e",
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": []
    },
    {
      "source": "PlanetSKI",
      "title": "Plans for Longest UK Indoor Slope Get the Go Ahead",
      "url": "https://planetski.eu/2026/01/05/decision-due-on-uk-biggest-indoor-snow-slope/",
      "description": "Plans for the slope at Rhydycar West in Wales have been approved by local councilors. Skiers & snowboarders have welcomed the move. UPDATED The post Plans for Longest UK Indoor Slope Get the Go Ahead appeared first on PlanetSKI .",
      "content": "It is set to become the UK’s longest indoor real‑snow slope, measuring between 400m and 424m in length. The snow centre will also include year‑round training facilities for skiing and snowboarding, designed to support GB and Welsh Olympic and Paralympic athletes. The scheme includes a large indoor ski centre, a tropical‑style water park, indoor and outdoor activity zones, up to 418 hotel rooms, 30 woodland lodges, and around 830 parking spaces. The application went to Merthyr Tydfil Council’s planning committee on Wednesday January 7th, following earlier direction from Welsh Government. Councillors voted unanimously in favour of the application subject to 53 conditions being met by developers. The council leader, Brent Carter, dubbed the scheme a “game changer” for the town. There were claps and cheers from the public as the vote went through. Councillors previously voted against officer advice to refuse the scheme, and ministers then confirmed they would not intervene. We reported on ",
      "pub_date": "Mon, 05 Jan 2026 21:42:20 +0000",
      "id": "9608caeb1f3b",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "transportation",
      "secondary_categories": [
        "hospitality"
      ]
    },
    {
      "source": "PlanetSKI",
      "title": "Ski Patrol Strike in US Resort Gets Bitter",
      "url": "https://planetski.eu/2026/01/05/ski-patrol-strike-in-us-resort-gets-bitter/",
      "description": "The dispute has been going on over two weeks and now the resort management team has launched a recruitment campaign to hire temporary workers in a bid to reopen the mountain. The post Ski Patrol Strike in US Resort Gets Bitter appeared first on PlanetSKI .",
      "content": "The resort shut its slopes on 27 th December after a 99% strike vote by the Telluride Professional Ski Patrol Association. We reported on it at the time on PlanetSKI: Telluride ski patrollers strike on Saturday The dispute is over pay. Job postings for temporary roles have appeared offering hourly wages between $24.50 and $37.50—a rate higher than the starting pay for many current union members. “The ski resort is actively working on a plan to safely reopen Lifts 1 and 4 as quickly as possible,” said a statement from Telluride. “A defined number of medical providers are needed in order to do that, so the resort has formed a recruitment team, led by industry professionals. “The goal is to hire qualified and experienced personnel to temporarily fill the gaps, allowing the resort to open as soon as possible.” The union, which represents 78 patrollers, does not believe the resort can find adequate replacements. They argue that Telluride’s steep terrain—including the high-altitude Palmyra P",
      "pub_date": "Mon, 05 Jan 2026 21:21:01 +0000",
      "id": "aad6234c9967",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": [
        "safety-incidents"
      ]
    },
    {
      "source": "PlanetSKI",
      "title": "GB Athletes in Action",
      "url": "https://planetski.eu/2026/01/05/gb-athletes-in-action-20/",
      "description": "A host of GB snowsport athletes are competing in World Cup events this week. Check out the full details. The post GB Athletes in Action appeared first on PlanetSKI .",
      "content": "Athletes Competing Park & Pipe Halfpipe and Slopestyle World Cups – Aspen – 7-10 January Zoe Atkin (FS HP) Gus Kenworthy (FS HP) Liam Richards (FS HP) Sam Gaskin (FS HP) Siddhartha Ullah (SB HP) Aaron Wild (SB HP) Kirsty Muir (FS SS) Chris McCormick (FS SS) James Pouch (FS SS) Tzema Mazet-Brown (SB SS) Alpine SL World Cup – Madonna di Campiglio – 7 January Luca Carrick-Smith Billy Major Dave Ryding Laurie Taylor See here for a full-length feature on the Carrick-Smith brothers, Luca, Freddy & Zac: A BIG year for GB ski racingbrothers Team Carrick-Smith. Image © Team Carrick-Smith. SL and GS World Cup – Adelboden – 10-11 January Freddy Carrick-Smith (GS) Luca Carrick-Smith (SL) Billy Major (SL) Dave Ryding (SL) Laurie Taylor (SL) Moguls World Cup – Val St. Come – 9-10 January Makayla Gerken Schofield Bets of luck to them all and do check back for the results… PlanetSKI: Number 1 for digital ski news Your digital platform for ski news, resort information, travel, equipment rental, sport, ",
      "pub_date": "Mon, 05 Jan 2026 19:10:42 +0000",
      "id": "1035874c1edb",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "winter-sports",
      "secondary_categories": []
    },
    {
      "source": "PlanetSKI",
      "title": "A Big Year for GB Ski Racing Brothers",
      "url": "https://planetski.eu/2026/01/05/a-big-year-for-gb-ski-racing-brothers/",
      "description": "January is a big month in a big year for British ski racing brothers, the Carrick-Smiths. The siblings will be competing in World and Europa Cups. But, as self-funded athletes, the challenges they face simply to get to the start gate are huge. The post A Big Year for GB Ski Racing Brothers appeared first on PlanetSKI .",
      "content": "Skiing is expensive. Every PlanetSKI reader knows that. It’s even more expensive if you’re an alpine racer. Imagine the costs if there are three racers in the family. Emma Carrick-Anderson doesn’t have to imagine. The four-time Winter Olympian and her husband, Phil Smith, know all too well. Their sons are Luca (21) and 18-year-old twins Freddy and Zak Carrick-Smith. The Carrick-Smith family. Image © Team Carrick-Smith They are phenomenally talented racers who have already had significant success as juniors. PlanetSKI focused on the rising stars way back in 2018. Boy Racers The Carrick-Smith boys, aged 13 and 11 in December 2018. Image © PlanetSKI Their achievements include Luca’s slalom bronze at the Junior World Championships last March, the first Junior Worlds medal for the nation since Graham Bell in 1984. Now, they’ve stepped up to mix it with the big boys of the alpine world. Luca made his World Cup debut at Levi, in Finland, in November. Luca Carrick-Smith Makes World Cup Debut A",
      "pub_date": "Mon, 05 Jan 2026 18:43:36 +0000",
      "id": "7e746b096560",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "winter-sports",
      "secondary_categories": []
    },
    {
      "source": "Ski Area Management",
      "title": "Telluride Partially Reopens as Patrol Strike Continues",
      "url": "https://www.saminfo.com/news/sam-headline-news/telluride-partially-reopens-as-patrol-strike-continues",
      "description": "SAM Magazine—Telluride, Colo., Jan. 5, 2026—After nine days of the resort being closed entirely during a strike by its unionized ski patrollers, Telluride opened two lower mountain trails served by one aerial lift and two conveyors today. The free village gondola is also spinning. Failed contract negotiations led to a Telluride Professional Ski Patrol Association (TPSPA) union vote to strike during the busy Christmas and New Year holidays, beginning Dec. 27. Telluride Resort ownership responded ",
      "content": "SAM Magazine—Telluride, Colo., Jan. 5, 2026—After nine days of the resort being closed entirely during a strike by its unionized ski patrollers, Telluride opened two lower mountain trails served by one aerial lift and two conveyors today. The free village gondola is also spinning. Failed contract negotiations led to a Telluride Professional Ski Patrol Association (TPSPA) union vote to strike during the busy Christmas and New Year holidays, beginning Dec. 27. Telluride Resort ownership responded ",
      "pub_date": "Mon, 05 Jan 2026 16:08:51 -0500",
      "id": "1a981b24c77d",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": [
        "safety-incidents",
        "business-investment",
        "transportation"
      ]
    },
    {
      "source": "PlanetSKI",
      "title": "Heavy Snow Set to Fall in the Alps",
      "url": "https://planetski.eu/2026/01/05/the-new-planetski-snow-report-2/",
      "description": "Some very welcome snow is set to start falling from Thursday. Up to 1m in places. UPDATED The post Heavy Snow Set to Fall in the Alps appeared first on PlanetSKI .",
      "content": "Thursday 8th January A large storm is starting in the Alps bringing some much-needed snow to parts of the mountains that have not seen snow for four weeks. Some forecasts predict up to 1m of snow, but as always we shall have to wait and see. We’ll have a round up later in the day as the storm develops. It is spreading across the western and north-western Alps, affecting mainly France and Switzerland. The storm will continue tomorrow with the freezing level at around 1,000m. On Saturday further flurries will continue until the weather clears by Sunday. Ski resorts in France expected to see some of the best snow include Tignes , Val Thorens & Les Menuires . It will be very welcome. Les Menuires, France. Image © PlanetSKI/Helen Gillespie. Les Menuires, France. Image © PlanetSKI/Helen Gillespie. In Switzerland Verbier should have a decent fall and in Italy resorts in the Aosta Valley should do well. The ski areas in the Italian Dolomites will see precious little snow. Resorts in the east o",
      "pub_date": "Mon, 05 Jan 2026 04:09:13 +0000",
      "id": "cd205afb2fce",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "international",
      "secondary_categories": []
    },
    {
      "source": "The Ski Guru",
      "title": "Epic & Ikon Pass Fraud: What This Means for Trust, Pricing & the Future of Ski Passes",
      "url": "https://www.the-ski-guru.com/2025/12/19/epic-ikon-pass-fraud-trust-future/",
      "description": "Opinion | By Martina Diez-Routh – The-Ski-Guru.com Epic & Ikon Pass Fraud: What This Means for Trust, Pricing & the Future The recent federal fraud case involving Epic and Ikon ski passes is more than a shocking crime story — it’s a wake-up call for the ski industry. While the criminal responsibility clearly lies with those … Continue reading \"Epic & Ikon Pass Fraud: What This Means for Trust, Pricing & the Future of Ski Passes\" The post Epic & Ikon Pass Fraud: What This Means for Trust, Pricing",
      "content": "Opinion | By Martina Diez-Routh – The-Ski-Guru.com Epic & Ikon Pass Fraud: What This Means for Trust, Pricing & the Future The r ecent federal fraud case involving Epic and Ikon ski passes is more than a shocking crime story — it’s a wake-up call for the ski industry . While the criminal responsibility clearly lies with those who orchestrated the scam, the case exposes deeper structural issues around pricing, consumer trust, and how global ski passes are sold and perceived . As someone who has worked for decades in international ski tourism — with resorts, tour operators, and global buyers — I believe this case will have long-term consequences that go well beyond a single court ruling. The IKON Pass extends into Europe. Ikon Pass to include Zermatt and Cervinia for the 2019/20 ski season. 1. The Trust Gap Is Growing Multi-resort passes were built on a simple promise: Pay once, ski everywhere, hassle-free. For most consumers, Epic and Ikon passes feel almost like currency — a digital ke",
      "pub_date": "Fri, 19 Dec 2025 20:41:26 +0000",
      "id": "6446b991b2c6",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": [
        "international",
        "business-investment"
      ]
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Snowball Effect and Mount Southington Launch ON BOARD: Youth-Powered Movement for Sport & Sustainability",
      "url": "https://www.snowsports.org/snowball-effect-and-mount-southington-launch-on-board-youth-powered-movement-for-sport-sustainability/",
      "description": "Play. Learn. Sustain. A next-generation way to mobilize communities, spark climate action, and connect local kids to the outdoors through sport. Southington, CT – April 29, 2025 – Snowball Effect and Mount Southington have teamed up to launch ON BOARD, a breakthrough initiative that connects sport, sustainability, and education to create real impact for local […] The post Snowball Effect and Mount Southington Launch ON BOARD: Youth-Powered Movement for Sport & Sustainability appeared first on Sn",
      "content": "Play. Learn. Sustain. A next-generation way to mobilize communities, spark climate action, and connect local kids to the outdoors through sport. Southington, CT – April 29, 2025 – Snowball Effect and Mount Southington have teamed up to launch ON BOARD , a breakthrough initiative that connects sport, sustainability, and education to create real impact for local families. With a focus on environmental stewardship and youth engagement, ON BOARD is reinventing how ski areas and resorts connect with their communities, starting right here in Connecticut. “ ON BOARD is about inspiring the next generation to take action for the planet,” said Jeff Boliba, Founder of Snowball Effect. “We’re using the joy of movement and the power of play to help kids build climate awareness, connect with their communities, and gain confidence. Whether in the school gym, at local events, or on the slopes, young learners are discovering that sorting waste, composting food scraps, and caring for nature are fun, pow",
      "pub_date": "Fri, 02 May 2025 21:20:17 +0000",
      "id": "12d33e84fdea",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": []
    },
    {
      "source": "PlanetSKI",
      "title": "Global Ski Community Pulls Together to Support Crans-Montana",
      "url": "https://planetski.eu/2026/01/02/gobal-ski-community-pulls-together-to-offer-support-for-crans-montana/",
      "description": "The tragedy has been felt across the ski world. It is one of the worst disasters in a ski resort in recent times. PlanetSKI editor, James Cove, assesses its impact, historical position & reaction from the ski world. The post Global Ski Community Pulls Together to Support Crans-Montana appeared first on PlanetSKI .",
      "content": "I am currently in Canada, 4,850 miles from Crans-Montana, in the ski community of Banff in Alberta. It is headline news in Canada with the tragedy dominating news bulletins, front pages and conversations in ski resorts. I thought it would be mentioned in the media, but not to the extent it has been. It is resonating with the ski community here. It is being discussed by people in lifts and bars – the mood is sombre, reflective and sympathetic. “It’s just awful and the victims are so, so young with their lives ahead of them,” said a man I was chatting to in the Mineshaft Tavern bar in Canmore on Thursday evening. “People in Switzerland may have little interest to know that we are thinking about them at this difficult time, but we are.” If the impact is felt almost 5,000 miles away I can only imagine the feeling and mood in the Alps. The Swiss skier, Camille Rast, won the World Cup GS race at Kranjska Gora, Slovenia on Saturday. The Swiss star’s primary thoughts on securing her first ever",
      "pub_date": "Fri, 02 Jan 2026 05:43:04 +0000",
      "id": "01f1e59c6612",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 1)"
      },
      "approved_date": "2026-01-08",
      "category": "canada",
      "secondary_categories": [
        "resort-operations",
        "international"
      ]
    },
    {
      "source": "Snow Industry News",
      "title": "Brundage Mountain Opens 100% Of Terrain As Winter Storms Drop Two Feet of Fresh Snow",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/brundage-mountain-opens-100-of-terrain-as-winter-storms-drop-two-feet-of-fresh-snow/",
      "content": "Snow dances turned into happy dances at Brundage Mountain today, after a four-day snowstorm allowed the Brundage team to open the resort’s fabled Hidden Valley zone. Brundage Mountain now has 100 percent of its terrain open. Winter storms have dropped between 21 and 26 inches of fresh snow across the mountain this week, boosting the snowpack and spreading powder grins across the slopes. Brundage has a current snow depth of 38” in the base area with 60 inches at the Lakeview snow marker (the base area measurement is taken at an elevation of 6,000 feet, the Lakeview marker is at approximately 7,000 feet elevation). Lakeview has seen a total of 108” of snowfall this season and the base area has received 84” of season snowfall. “The snow this week has truly been a game changer for the slopes,” says Brundage Mountain General Manager, Ken Rider. “Our team overcame incredible challenges to open terrain safely during less-than-ideal conditions earlier in the season, so this milestone feels eve",
      "pub_date": "2026-01-08T00:00:00",
      "id": "2d1fa27365c3",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "weather-snow",
      "secondary_categories": [
        "business-investment"
      ]
    },
    {
      "source": "The Atlantic",
      "url": "https://www.theatlantic.com/science/2026/01/palisades-la-fire-one-year/685535/?utm_source=feed",
      "title": "The View From the Palisades",
      "description": "A year is only the beginning of recovery from disaster.",
      "content": "A year is only the beginning of recovery from disaster.",
      "pub_date": "2026-01-07T13:12:16-05:00",
      "id": "a6a9dd3ca74f",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 3)"
      },
      "approved_date": "2026-01-08",
      "category": "hospitality",
      "secondary_categories": []
    },
    {
      "source": "Snow Industry News",
      "title": "Ski Report From FeWo-Direkt Published - How Ski Resorts Are Winning Over Generation Z",
      "url": "https://www.snowindustrynews.com/articles/2025/dec/ski-report-from-fewo-direkt-published-how-ski-resorts-are-winning-over-generation-z/",
      "content": "Generation Z takes ski holidays literally: 53 percent want to spend at least three-quarters of their winter vacation actively skiing or snowboarding in the mountains. 22 percent of 18- to 24-year-olds even plan to hit the slopes every day. This is shown in the new ski report from the vacation rental platform and app FeWo-direkt, for which a survey¹ was conducted among 1,000 Germans planning a holiday in the snow. About the ski report from FeWo-direkt Q: What is the FeWo-direkt Ski Report? A: The FeWo-direkt Ski Report is based on a survey of 1,000 Germans planning a winter holiday. From the choice of destination to preferred activities, the report reveals trends and preferences of different age groups. Q: What distinguishes Gen Z from older vacationers? A: Gen Z primarily wants to ski or snowboard and is open to events and shopping. Older generations prefer quieter activities like winter hiking. Q: Why is Generation Z important for ski resorts? A: 18- to 24-year-olds are the guests of ",
      "pub_date": "2026-01-07T00:00:00",
      "id": "24ebd0ded858",
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "hospitality",
      "secondary_categories": []
    },
    {
      "source": "Snow Industry News",
      "title": "Revelstoke Mountain Resort Releases New Real Estate Offerings",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/revelstoke-mountain-resort-releases-new-real-estate-offerings/",
      "content": "Revelstoke Mountain Resort (RMR) is unveiling its newest homes for sale, advancing a larger vision for the resort's growing mountain community. This latest phase marks an important milestone in the evolution of RMR's residential neighbourhoods, giving discerning potential homeowners the opportunity to invest in and join a community poised for world-class growth in the years to come. The latest release of homes includes new estate lots in the Mountain Road Estates neighbourhood and modern townhomes and condos in the Benchlands Residences. \"This release marks our second major launch of new real estate in the community, and the response to our earlier phase has been exceptional,\" says Jason Kelder, President, Revelstoke Mountain Resort. \"For potential homeowners, this is a rare opportunity to invest in a thriving mountain community where they can be themselves, embrace adventure and enjoy a simpler, more connected lifestyle, whether as a second home or a primary residence.\" Mountain Road ",
      "pub_date": "2026-01-07T00:00:00",
      "id": "8691bae63919",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "canada",
      "secondary_categories": [
        "transportation",
        "hospitality"
      ]
    },
    {
      "source": "Snow Industry News",
      "title": "Garaventa Has Completely Modernized The Gondola Lift Connection Between Crap Masegn, Fuorcla & Vorab Glacier For LAAX",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/garaventa-has-completely-modernized-the-gondola-lift-connection-between-crap-masegn-fuorcla-vorab-glacier-for-laax/",
      "content": "Garaventa has completely modernized the gondola lift connection between Crap Masegn, Fuorcla and the Vorab Glacier for Weisse Arena Bergbahnen AG. Modern technology ensures higher transport capacity and more efficient operation. The gondola lift connecting Crap Masegn, Fuorcla, and the Vorab Glacier has a long history. In 1978, Weisse Arena Bergbahnen AG put the six-person gondola lift, built by Habegger, into operation, thus opening up the Vorab Glacier, the highest point in the LAAX ski area. This historic lift has now been replaced by a new one, as the old lift could no longer be operated for licensing reasons. The new eight-person gondola lift follows the existing route and features state-of-the-art technology. Two sections with separate drive systems now allow for a transport capacity of 1,500 people per hour at a speed of six meters per second. If needed, the Fuorcla–Crap Masegn section can increase its capacity to up to 2,000 people per hour by transferring cabins from the other",
      "pub_date": "2026-01-07T00:00:00",
      "id": "3587f00fc591",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": []
    },
    {
      "source": "Snow Industry News",
      "title": "Mt. Ashland CEO Says \"Why We Must Replace Windsor Now\"",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/mt-ashland-ceo-says-why-we-must-replace-windsor-now/",
      "content": "Mt. Ashland CEO: has issued a letter highlighting the need to replace the aging windsor chair. They say: \"Earlier in 2025 we announced the next phase of the “Elevate Mt. Ashland” initiative- the Chairlift Replacement Project to replace the Windsor and Ariel Chairlifts. Here is an update: Every ski area has one piece of infrastructure that quietly holds everything together. At Mt. Ashland, that piece is the Windsor chairlift. Windsor isn’t flashy. It doesn’t get Instagram glory. Few people buy a season pass because of Windsor. But if Windsor goes down, the entire mountain feels it immediately. That’s why we’re talking about replacing it now. This isn’t about comfort. It’s not about modernization for the sake of modernization. It’s about reliability — and protecting the future of Mt. Ashland. Windsor serves the middle of the mountain. It connects terrain, spreads skier traffic, supports lessons, and keeps lift lines manageable across the entire ski area. There’s a reason we often refer t",
      "pub_date": "2026-01-07T00:00:00",
      "id": "6cd28c0170c2",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "transportation",
        "safety-incidents"
      ]
    },
    {
      "source": "Snow Industry News",
      "title": "Hochkar Celebrates 60 Years Of Skiing History",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/hochkar-celebrates-60-years-of-skiing-history/",
      "content": "The Hochkar ski resort in the municipality of Göstling is celebrating its 60th anniversary. To mark the occasion, a jubilee celebration was held today, Thursday, at the \"Latschen Alm\" mountain hut. Governor Johanna Mikl-Leitner spoke of a \"success story that is also a mission for the next 60 years. 60 years of Hochkar – that brings to mind the pioneering spirit of the Geischläger family and the state of Lower Austria. This pioneering spirit is still palpable and tangible here at Hochkar.\" The people of the region have always been the driving force behind this ski resort, the governor continued. Its success story began with the construction of the Hochkar Alpine Road. \"Then, step by step, everything else was created,\" she said, referring to the construction of the ski lifts and slopes, as well as the development of accommodation and restaurants. \"A whole world has been created here.\" The involvement of the state of Lower Austria in 2012 was a \"good, important, and correct step,\" and sin",
      "pub_date": "2026-01-07T00:00:00",
      "id": "ee21c07f035a",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)"
      },
      "approved_date": "2026-01-08",
      "category": "ski-history",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "hospitality"
      ]
    }
  ]
}