{
  "updated": "2026-01-30 11:21:58",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Snow Industry News",
      "title": "ASSQ Encourages Skiers To Adopt The Right Habits In Ski Slope Safety Month",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/assq-encourages-skiers-to-adopt-the-right-habits-in-ski-slope-safety-month/",
      "content": "Thanks to an exceptional start to the season, marked by abundant snowfall, remarkable skiing conditions, and high visitor numbers at ski resorts, more Quebecers than ever are enjoying winter. In this context, the Quebec Ski Areas Association (ASSQ) wishes to remind everyone that a successful winter also depends on responsible and safe behavior in the mountains. In collaboration with the Ministry of Education, the ASSQ is launching the 3rd edition of the \" Good skier, good player \" awareness campaign , which aims to encourage skiers and snowboarders, regardless of their level of experience, to adopt the right reflexes on the slopes and to use ski lifts safely, so that everyone can have a positive experience at the resort. To effectively reach all audiences, the ASSQ is deploying a dynamic campaign across multiple platforms, combining digital content, social media presence, and interactive initiatives. The ASSQ also invites the public to visit the Safety page of the maneige.ski website t",
      "pub_date": "2026-01-30",
      "id": "cab1b9153586",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "safety-incidents",
        "weather-snow",
        "resort-operations"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "PlanetSKI",
      "title": "Man Critical After Les2Alpes Avalanche",
      "url": "https://planetski.eu/2026/01/30/man-critical-after-les2alpes-avalanche/",
      "description": "It is the latest incident in what has been a grim month across the Alps and the Pyrenees. The snow pack remains highly unstable in places. NEW The post Man Critical After Les2Alpes Avalanche appeared first on PlanetSKI .",
      "content": "The avalanche occurred shortly before 11 a.m. in an off-piste area in the Fée Ouest sector, at an altitude of around 2,500m. A 59 year old man was found in cardiac arrest when the emergency services arrived. Resuscitation efforts succeeded in restoring his cardiac activity. He was evacuated by helicopter to hospital in Grenoble in a critical condition. We will update this article when we receive additional information. Earlier this week there were further deaths in the French Alps and French Pyrenees. Three more avalanche deaths in France Avalanche in Tignes. Image c/o David Morgan. PlanetSKI: Number 1 for digital ski news Your digital platform for ski news, resort information, travel, equipment rental, sport, money saving deals and everything connected with snowsports – web site, social media & more. The post Man Critical After Les2Alpes Avalanche appeared first on PlanetSKI .",
      "pub_date": "2026-01-30",
      "id": "c50cf44d26fe",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "business-investment",
        "international"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "The Ski Guru",
      "title": "Why Ski Resorts Close Terrain After Heavy Snowfall — And Why That’s a Safety Decision",
      "url": "https://www.the-ski-guru.com/2026/01/29/why-ski-resorts-close-terrain-heavy-snowfall/",
      "description": "Why Ski Resorts Close Terrain After Heavy Snowfall Introduction After major snowstorms, skiers and snowboarders often arrive expecting perfect powder conditions — only to find lifts closed, terrain restricted, or entire sectors shut down. Frustration is common, especially during short holidays or peak winter weeks. But more snow does not automatically mean safer skiing. In fact, … Continue reading \"Why Ski Resorts Close Terrain After Heavy Snowfall — And Why That’s a Safety Decision\" The post Wh",
      "content": "Why Ski Resorts Close Terrain After Heavy Snowfall Introduction After major snowstorms, skiers and snowboarders often arrive expecting perfect powder conditions — only to find lifts closed, terrain restricted, or entire sectors shut down. Frustration is common, especially during short holidays or peak winter weeks. But more snow does not automatically mean safer skiing . In fact, the period immediately after heavy snowfall is often when avalanche risk is highest. Terrain closures following big storms are not a failure to open — they are a deliberate risk-management decision designed to protect lives . Heavy snowfall doesn’t automatically mean safe skiing Large snowfalls can dramatically increase instability in the snowpack. Factors that contribute to heightened risk include: rapid accumulation of fresh snow wind loading on leeward slopes weak layers buried beneath new snow limited visibility preventing safe assessment In many cases, the first 24 to 72 hours after a storm are critical. ",
      "pub_date": "2026-01-29",
      "id": "174668746aac",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "resort-operations"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Unofficial Networks",
      "title": "Vermont Bank CEO Delivers $10,000 Donation Check On His Skis",
      "url": "https://unofficialnetworks.com/2026/01/29/vermont-bank-ceo-delivers-10000-donation-check-on-his-skis/",
      "description": "Northfield Savings Bank President & CEO, Joe Bator, took community support to new heights—skiing down Mad River Glen to present Stark Mountain Foundation with a $10,000 check to go towards the purchase and on-going stewardship of the 20th Hole.",
      "content": "Very cool news out of Vermont where “Operation Chairlift” conducted b y Northfield Savings Bank was pulled off flawlessly. “ Northfield Savings Bank President & CEO, Joe Bator, took community support to new heights—skiing down Mad River Glen to present Stark Mountain Foundation with a $10,000 check to go towards the purchase and on-going stewardship of the 20th Hole. Here’s to keeping Mad River Glen wild, community-owned, and one-of-a-kind. Thank you to our friends and neighbors at NSB for your generous gift and supporting local Builders, Makers and Doers!” The $10,000 donation will go towards Mad River Corporation’s effort to r to purchase approximately 1,100 acres of land surrounding the Mad River Glen ski area at a price of $2.5 million from Lyme Mill Brook LLC (an anonymous family foundation managed by Lyme Timber Company). As of January 20, 2026 they have raised $2,052,000. Very cool to see a the head honcho at a bank throw on his skis and get in the spirit of things. For more inf",
      "pub_date": "2026-01-29",
      "id": "acd6bc073ecd",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "SnowBrains",
      "title": "Bode Miller’s Revitalized Peak Skis is Back with 2 New Models: The Peak 88 & 98",
      "url": "https://snowbrains.com/bode-millers-revitalized-peak-skis-is-back-with-2-new-models-the-peak-88-98/",
      "description": "Bode Miller sent another mass email to Peak Skis followers saying that the company is officially back after the company went offline in June 2025—until last week. Miller explained that the company moved too fast and underestimated the responsibility that comes with asking for trust and investment. Peak has support from investors and experienced business leaders, and it has since regrouped, […] The post Bode Miller’s Revitalized Peak Skis is Back with 2 New Models: The Peak 88 & 98 appeared first",
      "content": "Peak 88s and 98s will be the only two models available this season. | Image: Peak Skis Bode Miller sent another mass email to Peak Skis followers saying that the company is officially back after the company went offline in June 2025—until last week. Miller explained that the company moved too fast and underestimated the responsibility that comes with asking for trust and investment. Peak has support from investors and experienced business leaders, and it has since regrouped, slowed down, and rebuilt its structure. Miller said that Peak Skis would do things the right way, committing to disciplined operations, quality products, and earning back trust through actions rather than words. In the email, Miller explained that the Peak 88s and Peak 98s would be the only skis that would be available this season. The Peak 88s are in their third generation and are an all-mountain ski with a “slightly relaxed sidecut” compared to previous models. The ski is designed to make the skier feel more comp",
      "pub_date": "2026-01-29",
      "id": "e97c0e522ec5",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-30"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "Tuff Shed Returns As Proud Partner Of The World Pro Ski Tour",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/tuff-shed-returns-as-proud-partner-of-the-world-pro-ski-tour/",
      "content": "The World Pro Ski Tour (WPST) is pleased to announce the renewal of its partnership with Tuff Shed for the 2026 season, welcoming the brand back as a valued supporter of professional skiing for another electrifying year. Tuff Shed has long been recognized as an industry leader in high-quality storage solutions, helping families across the country create unique, functional, and beautifully designed outdoor spaces. Their commitment to craftsmanship, durability, and innovation aligns seamlessly with the values of the World Pro Ski Tour and the high standards of excellence seen on our competition circuit. “We’re incredibly excited to continue our partnership with Tuff Shed for the 2026 season,” says Christopher Neary. “Their dedication to quality and their ability to provide families with practical, lasting outdoor solutions make them a natural fit for our tour and our community.” As the World Pro Ski Tour continues to grow and evolve, partnerships like this play a critical role in support",
      "pub_date": "2026-01-30",
      "id": "d44fec59d7da",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "PlanetSKI",
      "title": "Crans-Montana Remembers",
      "url": "https://planetski.eu/2026/01/29/crans-montana-remembers/",
      "description": "Four weeks after the fatal fire in a bar at a New Year's Eve party the resorts is hosting an alpine ski World Cup event ahead of the Olympics. Thoughts remain with those who died or were injured. NEW The post Crans-Montana Remembers appeared first on PlanetSKI .",
      "content": "The event goes ahead as planned but without the usual festivities that take over any ski venue on race day. The finish area stripped of its usual vibrant color and advertising. Instead, white and black signs of mourning that read “Our thoughts are with you” in multiple languages were displayed. Crans-Montana World Cup races to go ahead after fire tragedy “This is, I think, a good point to find a good balance between tributes and a little bit of hope,” said race organiser, Didier Défago. The the fire in the early hours of New Year’s Day killed 40 people, most of them youngsters, and injured 116. We reported on it here Crans-Montana, Switzerland. Image © PlanetSKI Flowers were laid by participants on the steps of the boarded-up Le Constellation bar. The women race on Friday and Saturday at Crans-Montana, and the men Sunday. “Now we have to focus a little on the sport to bring the people together,” added Défago. Défago opened an eve-of-training meeting of coaches and team leaders Tuesday ",
      "pub_date": "2026-01-29",
      "id": "d4ff195e20f0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "winter-sports",
        "transportation"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "The Ski Guru",
      "title": "🏔️ Telluride Resort Sale Scandal Sparks Resignations and Investigations",
      "url": "https://www.the-ski-guru.com/2026/01/29/telluride-ski-resort-sale-scandal/",
      "description": "📢 Summary A controversial attempt to broker the sale of Telluride Ski & Golf Co. has unfolded into a major local scandal — involving resignations, town investigations, and public outcry — after a proposed $127.5 million offer for a 51 % stake in the resort was revealed during a heated community climate. This controversy adds to a growing list … Continue reading \"🏔️ Telluride Resort Sale Scandal Sparks Resignations and Investigations\" The post 🏔️ Telluride Resort Sale Scandal Sparks Resignations ",
      "content": "Summary A controversial attempt to broker the sale of Telluride Ski & Golf Co. has unfolded into a major local scandal — involving resignations, town investigations, and public outcry — after a proposed $127.5 million offer for a 51 % stake in the resort was revealed during a heated community climate. This controversy adds to a growing list of issues shaping the global ski business, which we regularly cover in our ski industry developments. . The Offer That Shook a Ski Town In late December 2025 , two local leaders — Mountain Village Mayor Marti Prohaska and Telluride Mayor Pro Tem Meehan Fee — traveled to Southern California to meet with Telluride Ski Resort owner Chuck Horning . Their goal reportedly was to put forward a deal backed by investors to acquire 51 % of the resort for $127.5 million , while Horning would remain board chair. Similar concerns about corporate influence on mountain culture have emerged elsewhere in the U.S., including debates over whether Vail is harming the s",
      "pub_date": "2026-01-29",
      "id": "b05ee992e097",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-30"
    },
    {
      "source": "Unofficial Networks",
      "title": "Cross Country Skier Nearly Enters Orbital Altitude",
      "url": "https://unofficialnetworks.com/2026/01/29/cross-country-skier-nearly-enters-orbital-altitude/",
      "description": "Competing at the highest levels of cross country skiing is definitely serious business. Athletes spend untold hours toiling away crafting their bodies into finely tuned machines designed for dashing across snow at super human speeds. These same athletes are also not allergic to a good time and when the opportunity presents itself, are know to […]",
      "content": "Competing at the highest levels of cross country skiing is definitely serious business. Athletes spend untold hours toiling away crafting their bodies into finely tuned machines designed for dashing across snow at super human speeds. These same athletes are also not allergic to a good time and when the opportunity presents itself, are know to send it. The following video is a classic case of cross country ski team blowing off some steam as a squad. The official governing body of the Cross-Country World Cup celebrated the team effort and individual heroics but questioned if they might be confusing the assignment for ski jumping: View this post on Instagram A post shared by FIS Cross-Country World Cup (@fiscrosscountry) While the boys above have nailed distance jumping, we have to say Swiss cross country skier Antonin Savary takes the cake for style: View this post on Instagram A post shared by Antonin Savary (@antonin_savary) Categories: Ski News",
      "pub_date": "2026-01-29",
      "id": "e6edc3a51f8c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-30"
    },
    {
      "source": "SnowBrains",
      "title": "Fernie Alpine Resort, BC, Report: Cedar-Scented Turns & Local Advice",
      "url": "https://snowbrains.com/fernie-alpine-resort-bc-report-cedar-scented-turns-local-advice/",
      "description": "Report from January 28, 2026 Fernie Alpine Resort has a way of quietly reminding skiers why it holds legendary status in British Columbia. Tucked into the Lizard Range of the Canadian Rockies, Fernie blends deep-snow credibility with a layout that rewards curiosity, patience, and a willingness to venture just beyond the obvious. Conditions delivered a glimpse of for what Fernie […] The post Fernie Alpine Resort, BC, Report: Cedar-Scented Turns & Local Advice appeared first on SnowBrains .",
      "content": "A skier rips a sunny powder turn. | Photo: Fernie Alpine Resort Guest Services Building Report from January 28, 2026 Fernie Alpine Resort has a way of quietly reminding skiers why it holds legendary status in British Columbia. Tucked into the Lizard Range of the Canadian Rockies, Fernie blends deep-snow credibility with a layout that rewards curiosity, patience, and a willingness to venture just beyond the obvious. Conditions delivered a glimpse of for what Fernie is known. Soft snow lingered across much of the mountain, especially on shaded aspects and in the trees, where cold temperatures preserved quality turns and wind pushed snow into healthy pockets. Visibility fluctuated at times, but when the clouds lifted, the terrain revealed itself in layers—bowls feeding into glades, ridgelines spilling into natural halfpipes, and sustained fall lines that can keep a rider’s legs burning. One of Fernie’s defining strengths is its tree skiing. Vast, well-spaced glades stretch across multiple",
      "pub_date": "2026-01-29",
      "id": "5721c93fc5d0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "canada",
        "resort-operations"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "Armada Launches New Antimatter Freeride Ski Line Alongside Max Palm",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/armada-launches-new-antimatter-freeride-ski-line-alongside-max-palm/",
      "content": "Armada is launching a new line of freeride skis, the Antimatter Series, designed alongside athlete Max Palm. Development of Antimatter involved collaboration with the athletes who inspire Armada’s vision of freeride, one that combines refined technical skills with an aesthetic, creative approach. The full line of Antimatter skis, men’s and women’s models, range from a 75mm waist to a 114mm waist. The line will be available to buy online and in-store Fall 2026. Find out more here: https://www.armadaskis.com/en-us/antimatter-early-release THE SERIES: The Antimatter Series is a collection of skis that blend playful, freestyle-inspired camber profiles with subtly directional shaping, utilizing constructions with tailored, hybrid metal. Essentially, Antimatter skis can pin it at top speeds in demanding terrain, while maintaining an intuitive character that can slash, pop and make a variety of turn shapes. THE 114: The flagship of the line, the Antimatter 114, is Max Palm’s signature ski. Pa",
      "pub_date": "2026-01-29",
      "id": "cd379b6a1f9d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Unofficial Networks",
      "title": "Park City Mountain Reapplies For Chairlift Replacements",
      "url": "https://unofficialnetworks.com/2026/01/29/park-city-chairlift-redo/",
      "description": "After the Utah Court of Appeals sided with locals, Park City Mountain has resubmitted applications to Park City for new lifts.",
      "content": "Park City, Utah — Groundhog Day came early to Park City. TownLift reports that Vail Resorts has resubmitted permit applications for the replacement of three chairlifts at Park City Mountain Resort . These projects would see the replacement of the Eagle, Eaglet, and Silverlode chairlifts. Eagle is currently a fixed-grip triple chairlift, while Eaglet is a standing but not operating chairlift that served a terrain park. This would be replaced by a high-speed six-pack chairlift with a mid-station for unloading. This would also be a key lift for ski racers and terrain park riders, providing access to the Three Kings terrain park zone. As part of the plan, Three Kings would reduce its operational schedule. The top terminal would be situated near the top of the King Con Express chairlift, providing easier access to that carving-filled terrain pod. Silverlode is currently a detachable high-speed six-pack chairlift. The proposal has that lift being replaced by a detachable high-speed eight-pac",
      "pub_date": "2026-01-29",
      "id": "e96784e9a122",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "winter-sports"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "SnowBrains",
      "title": "Utah’s Only Free Ski Area Is Officially Open Again After 45 Years",
      "url": "https://snowbrains.com/utahs-only-free-ski-area-is-officially-open-again-after-45-years/",
      "description": "Snowland is located about 100 miles south of Salt Lake City and has officially reopened for its first official season since 1980. Snowland has long been a destination for road served backcountry skiing for Utah locals, but a non-profit known as Snowland Recreation and Education, has installed a rope tow for the first time. Located up at the top of […] The post Utah’s Only Free Ski Area Is Officially Open Again After 45 Years appeared first on SnowBrains .",
      "content": "Overview of Snowland, UT.| Photo Credit: Bethany Baker | The Salt Lake Tribune Snowland is located about 100 miles south of Salt Lake City and has officially reopened for its first official season since 1980. Snowland has long been a destination for road served backcountry skiing for Utah locals, but a non-profit known as Snowland Recreation and Education , has installed a rope tow for the first time. Located up at the top of the Fairview Canyon, the ski area gets plenty of that world famous Utah powder the area is known for. That powder accumulation, however, and ease of road access led to some dangerous conditions involving vehicles dropping off and picking up skiers along the treacherous mountain road. Snowland is located about 100 miles south of Salt Lake City, UT. Photo Credit: Visit The USA Prior to 1980, the area operated as a ski area before rising insurance costs proved the venture unprofitable. Over 40 years later, thanks in part to danger mitigation efforts and largely due t",
      "pub_date": "2026-01-29",
      "id": "4ab357127857",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "business-investment"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "The Ski Guru",
      "title": "Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base",
      "url": "https://www.the-ski-guru.com/2026/01/28/andorra-snow-update-slopes-open-january-2026/",
      "description": "Andorra Snow Update: 100% of Slopes Open, Up to 200 cm Base All ski resorts in Andorra are now operating at 100% capacity, making this one of the strongest winterperiods the Pyrenees have seen in recent years. Following a week of sustained snowfall, the country currently offers a total of 308 kilometres of open pistes, with … Continue reading \"Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base\" The post Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base appeared first o",
      "content": "Andorra Snow Update: 100% of Slopes Open, Up to 200 cm Base All ski resorts in Andorra are now operating at 100% capacity , making this one of the strongest winterperiods the Pyrenees have seen in recent years. Following a week of sustained snowfall, the country currently offers a total of 308 kilometres of open pistes , with snow depths exceeding one metre at resort level and reaching up to 200 cm at higher elevations . The view of Ordino Arcalis. 27th January 2026. Photo: Grandvalira Resorts. Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base. Across the main ski areas: Grandvalira Resorts has all 215 km of slopes fully open Pal Arinsal is operating with complete piste and lift access Ordino Arcalís reports the deepest snowpack, with bases up to 200 cm Conditions across the resorts are described as fully wintery , with excellent coverage, consistent snow quality, and strong conditions both on and off the main pistes. Forecasts also point to additional snowfall in the com",
      "pub_date": "2026-01-28",
      "id": "f0ef59ab9d06",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-28"
    },
    {
      "source": "PlanetSKI",
      "title": "GB Athletes in Action as Winter Olympics Approaches",
      "url": "https://planetski.eu/2026/01/27/gb-athletes-in-action-as-winter-olympics-approaches/",
      "description": "The Winter Olympics start a week on Friday, February 6th. It's the final World Cup competitions ahead of The Games. NEW The post GB Athletes in Action as Winter Olympics Approaches appeared first on PlanetSKI .",
      "content": "Athletes Competing this Week Alpine Slalom World Cup – Schladming –28 January Luca Carrick-Smith Billy Major Dave Ryding Laurie Taylor Downhill World Cup – Crans Montana – 28 January – 1 February Owen Vinter Ski Cross World Cup – Val di Fassa – 28-31 January Ollie Davies Para Snowboard Snowboard Cross World Cup – Big White – 31 January – 1 February James Barnes-Miller Ollie Hill Para Alpine Slalom and Giant Slalom World Cup – Meribel – 27-30 January Neil Simpson / Rob Poth Last Week’s Results X Games Aspen Kirsty Muir – 1 st (SS), 2 nd (BA) Mia Brookes – 1 st (SS), 3 rd (BA) Zoe Atkin – 1 st (HP) Gus Kenworthy – 9 th See here for our reports on the strong performance of the British Team ahead of the Milan-Cortina Winter Olympics with three golds: Kirsty Muir takes gold at the X Games Mia Brookes wins X Games gold Zoe Atkin wins second X Games gold for GB Kitzbuehel Alpine World Cup Dave Ryding – 20 th Billy Major – 24 th Laurie Taylor – DNQ Luca Carrick-Smith – DNF 1 Roy Steudle – DNF ",
      "pub_date": "2026-01-27",
      "id": "c5f79bc413cc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "canada"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}