{
  "updated": "2026-01-31 11:14:03",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "SnowBrains",
      "title": "Monarch Mountain, CO, Report: No Name Basin Makes History",
      "url": "https://snowbrains.com/monarch-mountain-co-report-no-name-basin-makes-history/",
      "description": "Report From January 29 Monarch Mountain, Colorado, opened its No Name Terrain expansion today, January 29. The expansion is Monarch’s largest in history and Colorado’s largest since 2023. The 377 new acres of intermediate and advanced terrain allows visitors to ski off either side of the continental divide. The new Tomichi lift has also greatly increased the mountain’s uphill capacity […] The post Monarch Mountain, CO, Report: No Name Basin Makes History appeared first on SnowBrains .",
      "content": "“Ambush” had fresh powder and great views on opening day. Photo: Author Report From January 29 Monarch Mountain, Colorado , opened its No Name Terrain expansion today, January 29. The expansion is Monarch’s largest in history and Colorado’s largest since 2023. The 377 new acres of intermediate and advanced terrain allows visitors to ski off either side of the continental divide. The new Tomichi lift has also greatly increased the mountain’s uphill capacity and overall flow. The lift was built by Skytrac this past summer and climbs 980 vertical feet in about six minutes. Opening day was a huge success. No Name Basin held awesome powder, dense trees, and runs of different pitch and length. The Tomichi lift and its new terrain will be a staple at Monarch for generations to come. Tomichi’s liftline “Buckhorn” is this zones only tree-cut advanced run. Photo: Author The top of Tomichi and No Name Basin is best accessed from the top of the Breezeway lift. I knew many would gather for this mom",
      "pub_date": "2026-01-31",
      "id": "a61a11e93ec1",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-31"
    },
    {
      "source": "The Ski Guru",
      "title": "Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain",
      "url": "https://www.the-ski-guru.com/2026/01/31/winter-mountain-safety-guide/",
      "description": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing.They are also complex, constantly changing environments, where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety, helping skiers, snowshoers and … Continue reading \"Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain\" The post Winter Mountain Safety G",
      "content": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing. They are also complex, constantly changing environments , where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety , helping skiers, snowshoers and Nordic users better understand terrain, conditions and context . It is written for awareness — not blame — and is designed to be read alongside official safety advice and avalanche bulletins. 1. Winter mountain risk goes beyond marked pistes A common misconception is that avalanche danger only concerns off-piste or backcountry skiers. In reality: Avalanches can cross groomed ski pistes Snowshoe routes may pass beneath steep, uncontrolled slopes Cross-country ski tracks can lie within avalanche run-out zones Valley floors, access roads and ice-climbing approaches may all be exposed Several recent accidents in th",
      "pub_date": "2026-01-31",
      "id": "51f89304d637",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "winter-sports"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Snow Industry News",
      "title": "ASSQ Encourages Skiers To Adopt The Right Habits In Ski Slope Safety Month",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/assq-encourages-skiers-to-adopt-the-right-habits-in-ski-slope-safety-month/",
      "content": "Thanks to an exceptional start to the season, marked by abundant snowfall, remarkable skiing conditions, and high visitor numbers at ski resorts, more Quebecers than ever are enjoying winter. In this context, the Quebec Ski Areas Association (ASSQ) wishes to remind everyone that a successful winter also depends on responsible and safe behavior in the mountains. In collaboration with the Ministry of Education, the ASSQ is launching the 3rd edition of the \" Good skier, good player \" awareness campaign , which aims to encourage skiers and snowboarders, regardless of their level of experience, to adopt the right reflexes on the slopes and to use ski lifts safely, so that everyone can have a positive experience at the resort. To effectively reach all audiences, the ASSQ is deploying a dynamic campaign across multiple platforms, combining digital content, social media presence, and interactive initiatives. The ASSQ also invites the public to visit the Safety page of the maneige.ski website t",
      "pub_date": "2026-01-30",
      "id": "cab1b9153586",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "safety-incidents",
        "weather-snow",
        "resort-operations"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "PlanetSKI",
      "title": "Man Critical After Les2Alpes Avalanche",
      "url": "https://planetski.eu/2026/01/30/man-critical-after-les2alpes-avalanche/",
      "description": "It is the latest incident in what has been a grim month across the Alps and the Pyrenees. The snow pack remains highly unstable in places. NEW The post Man Critical After Les2Alpes Avalanche appeared first on PlanetSKI .",
      "content": "The avalanche occurred shortly before 11 a.m. in an off-piste area in the Fée Ouest sector, at an altitude of around 2,500m. A 59 year old man was found in cardiac arrest when the emergency services arrived. Resuscitation efforts succeeded in restoring his cardiac activity. He was evacuated by helicopter to hospital in Grenoble in a critical condition. We will update this article when we receive additional information. Earlier this week there were further deaths in the French Alps and French Pyrenees. Three more avalanche deaths in France Avalanche in Tignes. Image c/o David Morgan. PlanetSKI: Number 1 for digital ski news Your digital platform for ski news, resort information, travel, equipment rental, sport, money saving deals and everything connected with snowsports – web site, social media & more. The post Man Critical After Les2Alpes Avalanche appeared first on PlanetSKI .",
      "pub_date": "2026-01-30",
      "id": "c50cf44d26fe",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "business-investment",
        "international"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "Unofficial Networks",
      "title": "Maine’s Finest Athlete Races 2-Time Olympic Gold Medalist Ted Ligety",
      "url": "https://unofficialnetworks.com/2026/01/30/donny-pelletier-races-ted-ligety/",
      "description": "Maine's finest athlete Donny Pelletier took on 2-time Olympic gold medalist Ted Ligety on the slopes of Deer Valley.",
      "content": "Everyone knows that Donny Pelletier is the finest athlete from the great state of Maine. He’s got speed, skills, and style that easily outweigh some of the world’s most iconic ski racers and competitors. But can he beat 2-time Olympic gold medalist Ted Ligety in a race? Well they met up on the slopes of Deer Valley to find out. View this post on Instagram A post shared by Donny Pelletier (@donnypelletier207) Technically Ligety won the race thanks to Donny’s disqualification, but anyone with eyes can see the the Mainer was by far the faster skier. Apparently this ski racing stuff has a lot more rules that Mr. Pelletier would like to follow. It certainly seems a little rigged to us. Ligety won his first Olympic gold at the Turin 2006 Winter Olympics, earning the win in the alpine combined event after two remarkable slalom runs. At the Sochi 2014 Winter Olympics, Ligety earned his second gold, this time in the Giant Slalom. Colorado’s Monarch Mountain Opens 377-Acre Terrain Expansion Cate",
      "pub_date": "2026-01-30",
      "id": "91f1b2f59f05",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "Winter Park Resort, CO, Report: Winter Makes A Return",
      "url": "https://snowbrains.com/winter-park-resort-co-report-winter-makes-a-return/",
      "description": "This report is from Saturday and Sunday, January 24-25, 2026. Winter made a return this weekend in Winter Park, Colorado. The second-to-last weekend in January delivered some of the most consistent conditions of the season in Colorado. The mountain reported 5 inches of overnight snowfall, and it was still falling as we made our way to the Gondola. Large flakes […] The post Winter Park Resort, CO, Report: Winter Makes A Return appeared first on SnowBrains .",
      "content": "Saturday morning lift line report. Image: Noah Wehrman This report is from Saturday and Sunday, January 24-25, 2026. Winter made a return this weekend in Winter Park, Colorado. The second-to-last weekend in January delivered some of the most consistent conditions of the season in Colorado. The mountain reported 5 inches of overnight snowfall, and it was still falling as we made our way to the Gondola. Large flakes falling steadily eliminated any visibility to the surrounding Fraser Valley. Our first run, a Winter Park classic, was Cranmer. Opposite the bulletproof snow we had skied for the last week, these turns were soft. Each one better than the last, our group took turns flying by each other, popping in and out of the fresh snow. Following our first run, a group of ski patrollers surrounded the entrance of Bradley’s Bash. First in line for a directed opening meant we would be getting to ski the run for the first time this season. Aside from a few branches poking through the 33-inch ",
      "pub_date": "2026-01-31",
      "id": "aac0e1323331",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "weather-snow",
        "hospitality"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "The Ski Guru",
      "title": "French Alps Avalanche Danger: 48-Hour Roundup & Current Risk by Massif",
      "url": "https://www.the-ski-guru.com/2026/01/30/french-alps-avalanche-danger-update/",
      "description": "Avalanche activity has remained elevated across several French Alpine massifs over the past 48 hours, with confirmed incidents, multiple rescue checks, and continued warnings from Météo-France. Below is a clear roundup of what has happened, followed by current avalanche danger by massif and direct links to the official bulletins skiers should consult before heading into the mountains. 48-Hour Avalanche … Continue reading \"French Alps Avalanche Danger: 48-Hour Roundup & Current Risk by Massif\" Th",
      "content": "Avalanche activity has remained elevated across several French Alpine massifs over the past 48 hours, with confirmed incidents, multiple rescue checks, and continued warnings from Météo-France. Below is a clear roundup of what has happened, followed by current avalanche danger by massif and direct links to the official bulletins skiers should consult before heading into the mountains. 48-Hour Avalanche Roundup (28–29 January) Les Deux Alpes (Isère – Oisans) On Thursday 29 January , an off-piste avalanche occurred in the La Fée sector at Les Deux Alpes. A 59-year-old skier was recovered and taken to hospital in critical condition . Regional reporting indicates the skier suffered a cardiac arrest, was resuscitated on scene, and transferred to hospital in Grenoble. The incident occurred mid-morning, around 2,500 m , in a well-known off-piste area frequently accessed from the ski domain. Les Deux Alpes, near to St Christoph-en-Oisans. Photo: Toa Heftiba/Unsplash. French Alps Avalanche Dang",
      "pub_date": "2026-01-30",
      "id": "91cc7e98a26a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Snow Industry News",
      "title": "Tuff Shed Returns As Proud Partner Of The World Pro Ski Tour",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/tuff-shed-returns-as-proud-partner-of-the-world-pro-ski-tour/",
      "content": "The World Pro Ski Tour (WPST) is pleased to announce the renewal of its partnership with Tuff Shed for the 2026 season, welcoming the brand back as a valued supporter of professional skiing for another electrifying year. Tuff Shed has long been recognized as an industry leader in high-quality storage solutions, helping families across the country create unique, functional, and beautifully designed outdoor spaces. Their commitment to craftsmanship, durability, and innovation aligns seamlessly with the values of the World Pro Ski Tour and the high standards of excellence seen on our competition circuit. “We’re incredibly excited to continue our partnership with Tuff Shed for the 2026 season,” says Christopher Neary. “Their dedication to quality and their ability to provide families with practical, lasting outdoor solutions make them a natural fit for our tour and our community.” As the World Pro Ski Tour continues to grow and evolve, partnerships like this play a critical role in support",
      "pub_date": "2026-01-30",
      "id": "d44fec59d7da",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "PlanetSKI",
      "title": "Skiing in St Gervais",
      "url": "https://planetski.eu/2026/01/30/skiing-in-st-gervais/",
      "description": "Think of it as the interesting but less well-known cousin of Chamonix. As a winter resort, St-Gervais-Mont-Blanc, to give its preferred name, is often overlooked in favour of its world-famous neighbour. But for many skiers, it's a far better option. NEW The post Skiing in St Gervais appeared first on PlanetSKI .",
      "content": "Why? There are many reasons. But a big one is that it’s part of the Evasion Mont-Blanc ski area with 400km of runs. Unlike Chamonix, a large part of the terrain is linked by lift. What you can’t get to on skis is reached easily by shuttle bus. Domaine Evasion Mont-Blanc. The Evasion Mont-Blanc lift pass covers: St-Gervais-Mont-Blanc St Nicolas de Véroce Megève Combloux Les Contamines Hauteluce La Giettaz The top three are all accessible by lift from St Gervais, and are where I spent my first day on the slopes. SKI DAY ONE – St Gervais, St Nicolas, Megève St-Gervais-Mont-Blanc. Image © PlanetSKI Sadly, it was overcast, but the cloud was high and the views were, nonetheless, spectacular. If only the sun had shone and the sky had been blue… St-Gervais-Mont-Blanc. Image © PlanetSKI From the highest point of the resort, Mont Joly at 2,300m, I could see the cloud-covered Mont Blanc peak, the Aiguille du Midi and, down in the valley, Chamonix. There are few challenging on-piste runs for exper",
      "pub_date": "2026-01-30",
      "id": "6a65eb99b923",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "transportation",
        "international"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Unofficial Networks",
      "title": "6 Ski Resorts On The Rise In 2026",
      "url": "https://unofficialnetworks.com/2026/01/30/ski-resorts-rise-2026/",
      "description": "These six ski resorts have made notable improvements recently, and are bound to keep getting better in the years to come.",
      "content": "North America — While North American skiing and riding can feel bloated and expensive at times, there are still some gems out there. In honor of the new year, we’ve compiled a list of ski resorts that have been attracting more attention recently. These picks are based on recent investments, and other skiers are beginning to notice these places. Here are our picks for six ski resorts on the rise in 2026. Angel Fire Resort: A lot of changes came to Angel Fire this winter, and more improvements are on tap for next winter. The marquee addition for this winter is seven new trails, including the ski resort’s first double black diamonds . Other additions at the New Mexico ski resort include a new fixed-grip quad chairlift (which serves The Steeps), a new covered conveyor lift, snowmaking upgrades, new snow groomers, additional parking, and more. As of 2026, the ski resort features 95 trails, 8 lifts, and a vertical drop of 2,077 feet. View this post on Instagram Next winter will see a new det",
      "pub_date": "2026-01-30",
      "id": "46b1a92d7acc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "transportation",
        "business-investment",
        "hospitality"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "Be Bold, Start Cold",
      "url": "https://snowbrains.com/be-bold-start-cold/",
      "description": "“Hey, old man! Aren’t you cold, hiking in just THAT? It’s freaking dumping out!” A curious grom asks a white-whiskered, veteran of the slopes who’s wearing nothing but a light sweater and ski pants as he tours up into the gray abyss. “You would think that, but I’m actually the perfect temperature right now. It’s YOU that’s going to be hot […] The post Be Bold, Start Cold appeared first on SnowBrains .",
      "content": "Be bold and start cold! | Photo: SnowBrains. | Location: Alta Ski Area 11/11/20 “Hey, old man! Aren’t you cold, hiking in just THAT? It’s freaking dumping out!” A curious grom asks a white-whiskered, veteran of the slopes who’s wearing nothing but a light sweater and ski pants as he tours up into the gray abyss. “You would think that, but I’m actually the perfect temperature right now. It’s YOU that’s going to be hot in that puffy,” he replies. “Remember: Be bold, start cold ,” the old man of the snow said to the eager tourer. And the old man wasn’t just rambling or lost—he had a damn point. If you start a tour wearing minimal layers and are already feeling cold (which, given the current conditions will likely require a certain degree of bravery), then your body will warm itself up as you shed calories hiking up the hill. This will prevent you from overheating, and keep you more comfortable on the way up. You’ll also get to avoid stopping and shedding a layer or having to cool off. Thi",
      "pub_date": "2026-01-30",
      "id": "61bd41001274",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Unofficial Networks",
      "title": "Tordrillo Mountain Lodge Celebrates 20th Season of Alaskan Heli-Skiing",
      "url": "https://unofficialnetworks.com/2026/01/30/tordrillo-mountain-lodge-celebrates-20th-season-of-alaskan-heli-skiing/",
      "description": "Tordrillo Mountain Lodge opens up February 20th and there's a ton to look forward to as for the 2026 season including the first-ever women’s luxury heli-ski camp",
      "content": "While many skiers and snowboarders are lamenting what has been a lack luster year for snow totals, the folks up in Anchorage, Alaska just got hit with a massive storm which made this their snowiest January on record. Perfect timing for the operators of Tordrillo Mountain Lodge who are celebrating a milestone season as 2026 marks their 20th year of offering millions of acres of pristine terrain to skiers and snowboarders from around the world. Just a short hop flight from Anchorage (40-minutes) TML is a truly remote, luxury experience in the heart of the Alaska Range where snow totals average 600+ inches each season. The resort offers some of the best heli-skiing in Alaska as well as incredible on-site experiences including lakeside après with mountain views and daily gourmet meals prepared to order by the lodge’s private chef. TML guests can also enjoy winter activities like snowshoeing or Nordic skiing on the property’s 20km of groomed trails or enjoy contrast therapy between cold plu",
      "pub_date": "2026-01-30",
      "id": "0973df01544a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "hospitality",
        "transportation",
        "business-investment"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "The Ski Guru",
      "title": "Why Ski Resorts Close Terrain After Heavy Snowfall — And Why That’s a Safety Decision",
      "url": "https://www.the-ski-guru.com/2026/01/29/why-ski-resorts-close-terrain-heavy-snowfall/",
      "description": "Why Ski Resorts Close Terrain After Heavy Snowfall Introduction After major snowstorms, skiers and snowboarders often arrive expecting perfect powder conditions — only to find lifts closed, terrain restricted, or entire sectors shut down. Frustration is common, especially during short holidays or peak winter weeks. But more snow does not automatically mean safer skiing. In fact, … Continue reading \"Why Ski Resorts Close Terrain After Heavy Snowfall — And Why That’s a Safety Decision\" The post Wh",
      "content": "Why Ski Resorts Close Terrain After Heavy Snowfall Introduction After major snowstorms, skiers and snowboarders often arrive expecting perfect powder conditions — only to find lifts closed, terrain restricted, or entire sectors shut down. Frustration is common, especially during short holidays or peak winter weeks. But more snow does not automatically mean safer skiing . In fact, the period immediately after heavy snowfall is often when avalanche risk is highest. Terrain closures following big storms are not a failure to open — they are a deliberate risk-management decision designed to protect lives . Heavy snowfall doesn’t automatically mean safe skiing Large snowfalls can dramatically increase instability in the snowpack. Factors that contribute to heightened risk include: rapid accumulation of fresh snow wind loading on leeward slopes weak layers buried beneath new snow limited visibility preventing safe assessment In many cases, the first 24 to 72 hours after a storm are critical. ",
      "pub_date": "2026-01-29",
      "id": "174668746aac",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "resort-operations"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Snow Industry News",
      "title": "Armada Launches New Antimatter Freeride Ski Line Alongside Max Palm",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/armada-launches-new-antimatter-freeride-ski-line-alongside-max-palm/",
      "content": "Armada is launching a new line of freeride skis, the Antimatter Series, designed alongside athlete Max Palm. Development of Antimatter involved collaboration with the athletes who inspire Armada’s vision of freeride, one that combines refined technical skills with an aesthetic, creative approach. The full line of Antimatter skis, men’s and women’s models, range from a 75mm waist to a 114mm waist. The line will be available to buy online and in-store Fall 2026. Find out more here: https://www.armadaskis.com/en-us/antimatter-early-release THE SERIES: The Antimatter Series is a collection of skis that blend playful, freestyle-inspired camber profiles with subtly directional shaping, utilizing constructions with tailored, hybrid metal. Essentially, Antimatter skis can pin it at top speeds in demanding terrain, while maintaining an intuitive character that can slash, pop and make a variety of turn shapes. THE 114: The flagship of the line, the Antimatter 114, is Max Palm’s signature ski. Pa",
      "pub_date": "2026-01-29",
      "id": "cd379b6a1f9d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-29"
    },
    {
      "source": "PlanetSKI",
      "title": "Crans-Montana Remembers",
      "url": "https://planetski.eu/2026/01/29/crans-montana-remembers/",
      "description": "Four weeks after the fatal fire in a bar at a New Year's Eve party the resorts is hosting an alpine ski World Cup event ahead of the Olympics. Thoughts remain with those who died or were injured. NEW The post Crans-Montana Remembers appeared first on PlanetSKI .",
      "content": "The event goes ahead as planned but without the usual festivities that take over any ski venue on race day. The finish area stripped of its usual vibrant color and advertising. Instead, white and black signs of mourning that read “Our thoughts are with you” in multiple languages were displayed. Crans-Montana World Cup races to go ahead after fire tragedy “This is, I think, a good point to find a good balance between tributes and a little bit of hope,” said race organiser, Didier Défago. The the fire in the early hours of New Year’s Day killed 40 people, most of them youngsters, and injured 116. We reported on it here Crans-Montana, Switzerland. Image © PlanetSKI Flowers were laid by participants on the steps of the boarded-up Le Constellation bar. The women race on Friday and Saturday at Crans-Montana, and the men Sunday. “Now we have to focus a little on the sport to bring the people together,” added Défago. Défago opened an eve-of-training meeting of coaches and team leaders Tuesday ",
      "pub_date": "2026-01-29",
      "id": "d4ff195e20f0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "winter-sports",
        "transportation"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}