{
  "updated": "2026-02-07 11:15:34",
  "total_articles": 15,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Google News - Ski Industry",
      "title": "Ski resort CEO issues warning amid unprecedented trend in US region: 'We can never let [this] happen again' - The Cool Down",
      "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPTkZ1aU5CSGw0U1JmNlZrRTNtS2F4NjBJdUo1YXhNYlRmVmhjSjl4TXJIc2xjNVJCQ3UtVklJSzdMWktRYkRvMkZEZGMyVU16MHNzNHVvVGh1QkRZRXgxM2t0TXYwTEhpT1R4R3IxU2xpQnhmdFJtel9TZF9EbldvZWhoQS1CUENJajJjOWJlRQ?oc=5",
      "description": "Ski resort CEO issues warning amid unprecedented trend in US region: 'We can never let [this] happen again' The Cool Down",
      "content": "Ski resort CEO issues warning amid unprecedented trend in US region: 'We can never let [this] happen again' The Cool Down",
      "pub_date": "2026-02-05",
      "id": "0a2b1a7886cf",
      "prefilter_business_score": 2,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-02-07",
      "display_score": 29.5
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-02-04",
      "display_score": 25
    },
    {
      "source": "Snow Industry News",
      "title": "Two New 6-Seater Chairlifts Open In Dachstein-West",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/two-new-6-seater-chairlifts-open-in-dachstein-west/",
      "content": "With the grand opening of the two new 6-seater chairlifts, Aussichtsberg and Angeralm, the Dachstein West ski region has reached another significant milestone in its tourism development. The two new lifts connect the ski resorts in Gosau (Upper Austria) and Annaberg (Salzburg) and thus serve as a powerful symbol of cross-border cooperation in alpine tourism. Since their commissioning last December, they have noticeably improved traffic flow in the ski area and provided a new, modern skiing experience. “With the new Aussichtsberg and Angeralm 6-seater chairlifts, Dachstein West has achieved a true vision for the future. These lifts are a visible sign that targeted investments in quality, safety, and guest comfort are having an immediate impact. The high level of guest satisfaction confirms that we are on the right track. Around €22 million was invested in the two new lifts. This sustainably strengthens Dachstein West's position as Upper Austria's largest ski region and as a high-perform",
      "pub_date": "2026-02-03",
      "id": "a22103710f5c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-02-04",
      "display_score": 22
    },
    {
      "source": "Ski Area Management",
      "title": "Oregon’s Snow Drought Leads to Indefinite Closures",
      "url": "https://www.saminfo.com/news/sam-headline-news/oregons-snow-drought-leads-to-indefinite-closures",
      "description": "SAM Magazine—Happy Valley, Ore., Feb. 6, 2026— Mt. Ashland Ski Area The historic snow drought gripping the Pacific Northwest claimed more operational days this week as four of Oregon’s ski areas announced indefinite suspensions or significant reductions in operations, leaving lift chairs empty and slopes bare across the lower Cascades and Siskiyous. With unseasonably warm temperatures and rain eroding an already fragile snowpack, resort operators at Hoodoo Ski Area, Mt. Hood Skibowl, Mt. Ashland",
      "content": "SAM Magazine—Happy Valley, Ore., Feb. 6, 2026— Mt. Ashland Ski Area The historic snow drought gripping the Pacific Northwest claimed more operational days this week as four of Oregon’s ski areas announced indefinite suspensions or significant reductions in operations, leaving lift chairs empty and slopes bare across the lower Cascades and Siskiyous. With unseasonably warm temperatures and rain eroding an already fragile snowpack, resort operators at Hoodoo Ski Area, Mt. Hood Skibowl, Mt. Ashland",
      "pub_date": "2026-02-06",
      "id": "fd23652accba",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "resort-operations"
      ],
      "approved_date": "2026-02-06",
      "display_score": 20
    },
    {
      "source": "SnowBrains",
      "title": "With the Worst Ski Season in Decades Underway Out West, 70% of Skiers in the West Say They Still Wouldn’t Fly Out East to Ski",
      "url": "https://snowbrains.com/with-the-worst-ski-season-in-decades-underway-out-west-70-of-skiers-in-the-west-say-they-still-wouldnt-fly-out-east-to-ski/",
      "description": "The 2025-26 season is an enigma, with snowstorms and temperatures across the United States not following traditional weather patterns. The current situation for skiing and snowboarding has been flipped upside down. The East has been consistently receiving adequate snow, and more importantly, the temperatures have remained below freezing for months. The West is in the middle of a snow drought, […] The post With the Worst Ski Season in Decades Underway Out West, 70% of Skiers in the West Say They ",
      "content": "Winter Park, Colorado, has 111 inches so far this season. Photo taken in January 2026.| Image: SnowBrains The 2025-26 season is an enigma, with snowstorms and temperatures across the United States not following traditional weather patterns. The current situation for skiing and snowboarding has been flipped upside down. The East has been consistently receiving adequate snow, and more importantly, the temperatures have remained below freezing for months. The West is in the middle of a snow drought, with its worst season in 25 years, as rain and warmer temperatures have made conditions horrible for skiers and snowboarders. Many resorts out west have limited terrain, poor snowpack, and some have even halted their operations completely. With the current poor skiing and snowboarding conditions out West, have skiers and snowboarders made adjustments to their travel plans? It is common for people living in the East to make one or two trips out West throughout the winter, but it is not very com",
      "pub_date": "2026-02-06",
      "id": "7940db9c9a2a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 0,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +0)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [],
      "approved_date": "2026-02-06",
      "display_score": 18
    },
    {
      "source": "Unofficial Networks",
      "title": "This Japanese Ski Resort Has A Karaoke Gondola Cabin",
      "url": "https://unofficialnetworks.com/2026/02/05/japan-ski-resort-karaoke-gondola/",
      "description": "Skiers and snowboarders at Hakuba Goryu Snow Resort in Japan can sing karaoke while riding up the mountain.",
      "content": "Anyone who visits Japan, whether it’s just for sightseeing or for skiing/snowboarding, needs to do some karaoke. In the U.S., most karaoke is done in a bar with everyone watching. In Japan, most karaoke is done in private rooms for just you and your friends. It really takes things to the next level. Skiers and snowboarders at Hakuba Goryu Snow Resort in Japan don’t need to go far out of their way to get some karaoke in. In fact if they wind up on the resort’s #55 gondola cabin, they can sing karaoke while riding up the mountain. View this post on Instagram A post shared by 白馬五竜 : エイブル白馬五竜 ABLE Hakuba Goryu / 白馬五竜高山植物園 (@hakubagoryuofficial) The karaoke gondola celebrates the ski area’s 55th season in operation. As the 55th gondola cabin, it has a fancy warp on the outside and a party on the inside. Certainly quite the way to celebrate a birthday! Pennsylvania Ski Resort Is Already Shooting To Stay Open Into May Categories: Japan Skiing Snowboarding Travel",
      "pub_date": "2026-02-05",
      "id": "3950f0f259d9",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [
        "resort-operations",
        "hospitality"
      ],
      "approved_date": "2026-02-06",
      "display_score": 18
    },
    {
      "source": "SnowBrains",
      "title": "Hoodoo Ski Area, OR, Suspends Operations Indefinitely Amid Ongoing Snow Drought",
      "url": "https://snowbrains.com/hoodoo-ski-area-or-suspends-operations-indefinitely-amid-ongoing-snow-drought/",
      "description": "Hoodoo Ski Area has announced it will now suspend operations indefinitely, escalating an earlier plan to close for a single assessment day as warm temperatures and a critically thin snowpack continue to impact the mountain. The decision comes amid one of the most snow-starved winters the Pacific Northwest has seen in years. Originally, Hoodoo planned to close on Wednesday, February […] The post Hoodoo Ski Area, OR, Suspends Operations Indefinitely Amid Ongoing Snow Drought appeared first on Snow",
      "content": "Hoodoo ski area is currently closed until more snow can arrive to safely operate the mountain. | Photo: Hoodoo Facebook Hoodoo Ski Area has announced it will now suspend operations indefinitely, escalating an earlier plan to close for a single assessment day as warm temperatures and a critically thin snowpack continue to impact the mountain. The decision comes amid one of the most snow-starved winters the Pacific Northwest has seen in years. Originally, Hoodoo planned to close on Wednesday, February 4, for a full assessment day to evaluate conditions and preserve what little snow remained. Forecasts calling for daytime highs above 50°F throughout much of the week raised concerns about accelerated snowmelt on an already fragile base. At the time, the resort expressed cautious optimism that shoveling and snow management efforts could allow limited operations to resume later in the week. That optimism has since given way to a harder reality. In an updated statement shared by the resort, H",
      "pub_date": "2026-02-05",
      "id": "32c57f38001d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 0,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +0)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-02-06",
      "display_score": 18
    },
    {
      "source": "Unofficial Networks",
      "title": "How Snowmakers Are Making Skiing Possible During An Extremely Dry Season",
      "url": "https://unofficialnetworks.com/2026/02/06/snowmakers-battle-dry-conditions/",
      "description": "Much of the 2025/2026 ski season in the Western United States probably wouldn't exist without the hard work of snowmakers.",
      "content": "The state of Colorado is currently experiencing a record-low snowpack throughout the mountains, with a January dry spell making things even worse. Fortunately mid-February looks like it will come with a major pattern change across the Western United States, potentially bringing some solid snowfall to the Colorado Rockies, but it’s still worth noting that much of this season probably wouldn’t exist without the hard work of snowmakers. Rocky Mountain PBS met with some snowmakers at Eldora Mountain to discuss how snowmaking is done during such an extremely dry season. The snowmakers really are on the front lines of fighting weather, and we’re incredibly grateful for all of their work. Eldora currently has 10 of 10 lifts spinning for skiers and snowboarders, though only 37 of 63 trails are open. When entirely open, Eldora has 680 acres of skiable terrain and a vertical drop of 1,400 feet. Major Pattern Change Could Bring Heavy Snow to Western Mountains in Mid-February Categories: Eldora Co",
      "pub_date": "2026-02-06",
      "id": "581769020dc8",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 0,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +0)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations",
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-02-06",
      "display_score": 16
    },
    {
      "source": "SnowBrains",
      "title": "[OLYMPICS] Pre-Opening Day Recap: Big Air Qualis & Downhill Training (Oh, and Curling)",
      "url": "https://snowbrains.com/olympics-pre-opening-day-recap-big-air-qualis-downhill-training-oh-and-curling/",
      "description": "The Opening Ceremony of the Milano-Cortina 2026 Winter Olympics is still a day away, but the Winter Games are already rolling across northern Italy. From freestyle qualifiers in Livigno to blistering downhill training runs in Bormio, the early storylines are taking place even before the flame is lit in Milan. Livigno: Men’s Snowboard Big Air Qualifying Delivers The first official […] The post [OLYMPICS] Pre-Opening Day Recap: Big Air Qualis & Downhill Training (Oh, and Curling) appeared first on",
      "content": "17-year-old Oliver Martin advances to the finals. | Image: U.S. Snowboard The Opening Ceremony of the Milano-Cortina 2026 Winter Olympics is still a day away, but the Winter Games are already rolling across northern Italy. From freestyle qualifiers in Livigno to blistering downhill training runs in Bormio, the early storylines are taking place even before the flame is lit in Milan. Livigno: Men’s Snowboard Big Air Qualifying Delivers The first official Olympic results came in Livigno, where the men’s snowboard Big Air qualifiers were contested under a three-run format, with riders counting their best two scores. Japan’s Ogiwara Hiroto set the benchmark early and never looked back. He became the first rider to crack the 90-point mark, landing a massive switch backside 1980 for 90.5 on his opening run. A backside 1800 Indy on run two scored 88, giving him a commanding combined score of 178.50, nearly 15 points clear of the rest of the field. Japan had a total of four snowboarders qualify",
      "pub_date": "2026-02-06",
      "id": "1a747dbaaac0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "international"
      ],
      "approved_date": "2026-02-06",
      "display_score": 16
    },
    {
      "source": "Ski Area Management",
      "title": "The 2026 I Am a Snowmaker Contest Winner",
      "url": "https://www.saminfo.com/news/sam-headline-news/the-2026-i-am-a-snowmaker-contest-winner",
      "description": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "content": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "pub_date": "2026-02-03",
      "id": "6a5af2600c40",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-07",
      "display_score": 16
    },
    {
      "source": "PlanetSKI",
      "title": "2026 Winter Olympics Starts Today",
      "url": "https://planetski.eu/2026/02/05/2026-winter-olympics-starts-on-friday/",
      "description": "It is the highlight of competitive world snowsport and Team GB has some realistic medal chances on snow. PlanetSKI looks ahead to The Games. UPDATED The post 2026 Winter Olympics Starts Today appeared first on PlanetSKI .",
      "content": "“The Milano Cortina 2026 Olympic Winter Games are ready for competition,” announced the International Olympic Committe. It said that all venues as well as the key timing systems are fully operational. The Opening Ceremony takes place on Friday evening. The show will combine musical performances by artists including Mariah Carey, Laura Pausini and Andrea Bocelli, with a staging concept designed to extend beyond the stadium itself. The lighting of two cauldrons —one at Milan’s Arco della Pace and the other in Cortina d’Ampezzo’s Piazza Dibona — will embody the desire to multiply traditional rituals in order to reflect the Games’ multi-hub nature. Organisers describe the show as “an extended invitation, a shared embrace, celebrating Italian uniqueness and made in Italy.” Image c/o Milan-Cortina 2026 Events are spread between Milan, as the urban and ceremonial core, and the Alpine locations of Cortina d’Ampezzo, Valtellina, Val di Fiemme and Livigno, extending across Lombardy and Veneto an",
      "pub_date": "2026-02-05",
      "id": "e12def122455",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-02-06",
      "display_score": 14
    },
    {
      "source": "Unofficial Networks",
      "title": "Flying A $10,000 FPV Drone Over Europe’s Deadliest Mountain",
      "url": "https://unofficialnetworks.com/2026/02/05/flying-10k-drone-matterhorn-summit/",
      "description": "Swiss cinematographer Noah Malin took his $10k FPV drone to the Matterhorn to shoot a commercial, flying all the way to the summit.",
      "content": "The Matterhorn is among the deadliest mountains in the world, with more than 500 deaths on the mountain since 1865. Every year the mountain sees 8-10 deaths, with up to 3000 mountaineers attempting to summit the iconic peak. With a summit altitude of 14,692 feet, it theoretically shouldn’t be incredibly difficult to fly a drone to the summit. However, the concept of flying a $10,000 piece of equipment far beyond your reach seems pretty stressful. Swiss cinematographer Noah Malin took his $10k FPV drone to the Matterhorn to shoot a commercial. Because of the drone’s size, he had to walk up to the Hörnlihütte at 10,695 feet. This wasn’t the first time someone’s flown a drone to the summit of the iconic European peak, but the fact that this is a high-end piece of equipment with a very nice camera truly shines in the footage. It’s absolutely stunning to look at. Noah has a ton of very cool drone footage on his YouTube channel, with shots of water, mountains, and stunning scenery. Make sure",
      "pub_date": "2026-02-05",
      "id": "907a096c4ca3",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-02-06",
      "display_score": 14
    },
    {
      "source": "The Ski Guru",
      "title": "Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us",
      "url": "https://www.the-ski-guru.com/2026/02/02/avalanche-activity-france-switzerland-february-2026/",
      "description": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable, despite periods of fair weather and already-tracked slopes. Rather … Continue reading \"Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us\" The post Avalanche Acti",
      "content": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable , despite periods of fair weather and already-tracked slopes. Rather than isolated incidents, the reports collected since late January describe reactive slabs, remote triggers, and persistent weak layers affecting a wide range of aspects and elevations. Much of the recent instability is consistent with wind-loaded slabs and foehn-driven snow transport , which can rapidly overload weak layers and create large, reactive avalanche conditions. Further reading: Why Wind is one of the Most Dangerous Avalanches Triggers. Foehn Winds and Rising Avalanches in the Alps. This update summarises the most significant recent events and explains what they tell us about current conditions. Widesp",
      "pub_date": "2026-02-02",
      "id": "cacf361124bc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-04",
      "display_score": 13
    },
    {
      "source": "PlanetSKI",
      "title": "Snowboarder Dies After Backpack Caught on Chairlift",
      "url": "https://planetski.eu/2026/02/02/snowboarder-dies-after-backpack-caught-on-chairlift/",
      "description": "A 22-year old Australian woman died in Otari near Nagano in Japan. She suffered a heart attack after being dragged along the snow & left hanging in mid-air. The post Snowboarder Dies After Backpack Caught on Chairlift appeared first on PlanetSKI .",
      "content": "An unfastened waist belt buckle on her rucksack became caught on the chairlift while her chest strap was fastened. This caused her to be dragged along the snow and then suspended in mid-air. The lift was stopped by the attendant who pressed the emergency button. The woman was taken to hospital after suffering a cardiac arrest. The accident took place at the top of the two-person Tsuga No.2 Pair Lift. The woman had been riding the lift with another person. The Tsugaike Mountain resort and Tsugaike Gondola Lift Co jointly apologised for the accident and said an investigation would be launched. Police are questioning resort staff and inspecting the lift equipment as part of their inquiry. The company’s chief executive has expressed deep condolences to the woman’s family and promised to do the utmost to help them. “We will take concrete measures to prevent recurrence,” said the resort’s chief executive, Tsuneo Kubo. “We take this situation very seriously and will strive to operate the ski ",
      "pub_date": "2026-02-02",
      "id": "c2a0de8023b1",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 0,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +0)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "international",
        "business-investment"
      ],
      "approved_date": "2026-02-06",
      "display_score": 11
    },
    {
      "source": "PlanetSKI",
      "title": "Death Toll from Crans-Montana Fire Rises to 41",
      "url": "https://planetski.eu/2026/02/02/death-toll-from-crans-montana-fire-rises-to-41/",
      "description": "A teenager who was injured in the Swiss ski resort on New Year's Eve has died in hospital. It takes the death toll to 41. The post Death Toll from Crans-Montana Fire Rises to 41 appeared first on PlanetSKI .",
      "content": "“An 18-year-old Swiss national died at a hospital in Zurich on January 31 st ,” said the Valais canton’s public prosecutor, Beatrice Pilloud, No further information would be released at this stage, she added. Most of the victims of the fire were young – eight were under the age of 16 – and many are still being treated in hospital for severe burns. 44 patients are being treated abroad. They include: 18 in France 12 in Italy, 8 in Germany 6 in Belgium. The Valais health ministry said that 37 patients were still in Swiss hospitals. Initial findings from an investigation suggest the fire began as sparklers attached to champagne bottles ignited soundproof foam that lined the ceiling of the bar’s basement. Authorities have acknowledged that the bar had not undergone safety checks for five years. The owners of the bar, Jacques and Jessica Moretti, have been accused by authorities of manslaughter by negligence, bodily harm by negligence and arson by negligence. Criminal proceedings have also b",
      "pub_date": "2026-02-02",
      "id": "4a8c7002bfc4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 0,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +0)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-02-06",
      "display_score": 11
    }
  ]
}