{
  "updated": "2026-01-28 11:17:23",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "The Ski Guru",
      "title": "Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base",
      "url": "https://www.the-ski-guru.com/2026/01/28/andorra-snow-update-slopes-open-january-2026/",
      "description": "Andorra Snow Update: 100% of Slopes Open, Up to 200 cm Base All ski resorts in Andorra are now operating at 100% capacity, making this one of the strongest winterperiods the Pyrenees have seen in recent years. Following a week of sustained snowfall, the country currently offers a total of 308 kilometres of open pistes, with … Continue reading \"Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base\" The post Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base appeared first o",
      "content": "Andorra Snow Update: 100% of Slopes Open, Up to 200 cm Base All ski resorts in Andorra are now operating at 100% capacity , making this one of the strongest winterperiods the Pyrenees have seen in recent years. Following a week of sustained snowfall, the country currently offers a total of 308 kilometres of open pistes , with snow depths exceeding one metre at resort level and reaching up to 200 cm at higher elevations . The view of Ordino Arcalis. 27th January 2026. Photo: Grandvalira Resorts. Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base. Across the main ski areas: Grandvalira Resorts has all 215 km of slopes fully open Pal Arinsal is operating with complete piste and lift access Ordino Arcalís reports the deepest snowpack, with bases up to 200 cm Conditions across the resorts are described as fully wintery , with excellent coverage, consistent snow quality, and strong conditions both on and off the main pistes. Forecasts also point to additional snowfall in the com",
      "pub_date": "2026-01-28",
      "id": "f0ef59ab9d06",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-28"
    },
    {
      "source": "SnowBrains",
      "title": "Aspen Highlands, CO, Report: Snowboarding Above the Ozone",
      "url": "https://snowbrains.com/aspen-highlands-co-report-snowboarding-above-the-ozone/",
      "description": "Did you know that if you hike to the top of Aspen Highlands’ Highland Bowl, to 12,392 feet above sea level, your run literally starts above the Ozone? Well, not above the actual Ozone Layer, but the trail right below that is called Ozone. Aspen Highlands is one of four Aspen ski areas. It’s the steep one, the really really steep […] The post Aspen Highlands, CO, Report: Snowboarding Above the Ozone appeared first on SnowBrains .",
      "content": "The legendary Aspen Highland Bowl on January 27, 2026. Credit: SnowBrains. Did you know that if you hike to the top of Aspen Highlands’ Highland Bowl , to 12,392 feet above sea level, your run literally starts above the Ozone? Well, not above the actual Ozone Layer, but the trail right below that is called Ozone. Aspen Highlands is one of four Aspen ski areas. It’s the steep one, the really really steep one. According to the Highlands’ snow report , they are currently 94% open in terms of acreage; however, none of this terrain is for beginners. What makes this ski area so special is that it has no green runs, and it boasts an absolutely massive bowl (270 skiable acres) that is only accessible via roughly a 45-minute, breathtaking hike. That is exactly how I started my day: with a quick warm-up run and then straight to the bowl. The hike up to the peak is equally as challenging, rewarding, and exhilarating an experience as the way down the bowl. There is one especially long and steep se",
      "pub_date": "2026-01-28",
      "id": "5fd3dc66f641",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-01-28"
    },
    {
      "source": "Snow Industry News",
      "title": "National Ski Patrol Highlights Training Behind On-Mountain Response",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/national-ski-patrol-highlights-training-behind-on-mountain-response/",
      "content": "January is National Safety Month for the ski industry, and National Ski Patrol (NSP) is highlighting the rigorous medical and rescue training that prepares patrollers and that forms the backbone of every safety response on the mountain. With more than 30,000 members, NSP delivers one of the industry’s most advanced education pipelines — one that prepares patrollers not only to respond to emergencies, but to help ski areas operate confidently in a high-consequence environment. Patrollers are trained as mountain-safety professionals, combining advanced medical skills with technical rescue capabilities, operational awareness, and risk-management expertise, which collectively enhancen the safety of every guest on the slopes. “A safe day on the slopes starts long before anyone puts on skis and a helmet,” said Stephanie Cox, CEO of the National Ski Patrol. “Our patrollers put in hundreds of hours of training, so they’re ready for whatever the mountain throws at them. When a ski area knows it",
      "pub_date": "2026-01-27",
      "id": "948f6da2617d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "business-investment"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Unofficial Networks",
      "title": "Former Canadian Olympic Snowboarder Pleads Not Guilty To 17 Charges, Held Without Bond",
      "url": "https://unofficialnetworks.com/2026/01/26/former-canadian-olympic-snowboarder-pleads-not-guilty-to-17-charges-held-without-bond/",
      "description": "Judge John D. Early has ordered 44-year-old Wedding to be jailed without bond and remain in U.S. custody.",
      "content": "Former Canadian Olympic parallel giant slalom snowboarder, Ryan Wedding, has made Ryan Wedding his first court appearance following his arrest last week in Mexico City and extradition to America. TMZ Sports caught up with his attorney, Anthony Colombo , outside of a Santa Ana courtroom where he confirmed the alleged international drug kingpin is pleading not guilty to all 17 felony charges brought against him. Judge John D. Early has ordered 44-year-old Wedding to be jailed without bond and remain in U.S. custody. Wedding’s next court date is scheduled for February and a jury trial slated to get underway in March. Categories: Olympics Snowboarding",
      "pub_date": "2026-01-27",
      "id": "105ef90a85e1",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "safety-incidents",
        "canada"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "PlanetSKI",
      "title": "GB Athletes in Action as Winter Olympics Approaches",
      "url": "https://planetski.eu/2026/01/27/gb-athletes-in-action-as-winter-olympics-approaches/",
      "description": "The Winter Olympics start a week on Friday, February 6th. It's the final World Cup competitions ahead of The Games. NEW The post GB Athletes in Action as Winter Olympics Approaches appeared first on PlanetSKI .",
      "content": "Athletes Competing this Week Alpine Slalom World Cup – Schladming –28 January Luca Carrick-Smith Billy Major Dave Ryding Laurie Taylor Downhill World Cup – Crans Montana – 28 January – 1 February Owen Vinter Ski Cross World Cup – Val di Fassa – 28-31 January Ollie Davies Para Snowboard Snowboard Cross World Cup – Big White – 31 January – 1 February James Barnes-Miller Ollie Hill Para Alpine Slalom and Giant Slalom World Cup – Meribel – 27-30 January Neil Simpson / Rob Poth Last Week’s Results X Games Aspen Kirsty Muir – 1 st (SS), 2 nd (BA) Mia Brookes – 1 st (SS), 3 rd (BA) Zoe Atkin – 1 st (HP) Gus Kenworthy – 9 th See here for our reports on the strong performance of the British Team ahead of the Milan-Cortina Winter Olympics with three golds: Kirsty Muir takes gold at the X Games Mia Brookes wins X Games gold Zoe Atkin wins second X Games gold for GB Kitzbuehel Alpine World Cup Dave Ryding – 20 th Billy Major – 24 th Laurie Taylor – DNQ Luca Carrick-Smith – DNF 1 Roy Steudle – DNF ",
      "pub_date": "2026-01-27",
      "id": "c5f79bc413cc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "canada"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "The Ski Guru",
      "title": "Avalanche Fatalities in the French Alps: What Happened in Tignes and Across Savoie",
      "url": "https://www.the-ski-guru.com/2026/01/27/avalanche-death-tignes-savoie-risk-high/",
      "description": "Avalanche Death in Tignes and Multiple Incidents in the Alps as Risk Remains High Fatal Off-Piste Avalanche in Tignes A skier in his fifties, reported to be Spanish, died after being caught in an avalanche while skiing off-piste in the Tignes area (Savoie). According to regional authorities, the avalanche occurred in a non-secured, off-piste sector of the resort. The skier … Continue reading \"Avalanche Fatalities in the French Alps: What Happened in Tignes and Across Savoie\" The post Avalanche F",
      "content": "Avalanche Death in Tignes and Multiple Incidents in the Alps as Risk Remains High Fatal Off-Piste Avalanche in Tignes A skier in his fifties , reported to be Spanish , died after being caught in an avalanche while skiing off-piste in the Tignes area (Savoie) . According to regional authorities, the avalanche occurred in a non-secured, off-piste sector of the resort. The skier was fully buried by the slide and despite the rapid intervention of mountain rescue services, he could not be revived. The accident highlights once again the high risk currently affecting off-piste terrain , even in well-known and highly frequented ski resorts such as Tignes . Important: Off-piste areas, even when accessed directly from ski lifts, are not secured or controlled by ski patrols and remain subject to natural avalanche risk. Read more: France3 Map of the area. Avalanche Fatalities in the French Alps: What Happened in Tignes and Across Savoie. Avalanches Across the Alps: One Dead, Several Injured on the",
      "pub_date": "2026-01-27",
      "id": "d70be2aac8c8",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "international",
        "resort-operations"
      ],
      "approved_date": "2026-01-28"
    },
    {
      "source": "SnowBrains",
      "title": "Central Park, New York City, Report: Great Snow—and Shaun White!",
      "url": "https://snowbrains.com/central-park-new-york-city-report-great-snow-and-shaun-white/",
      "description": "This report is from Sunday, January 25, 2025. A surprise 12-inch snowfall transformed New York City’s Central Park into an improbable winter playground last Sunday, drawing out homesick skiers and snowboarders eager to make turns wherever gravity allowed. SnowBrains caught up with current New York resident Kristina Malzbender, who found herself at the center of one of the Big Apple’s […] The post Central Park, New York City, Report: Great Snow—and Shaun White! appeared first on SnowBrains .",
      "content": "Central Park Skiing the steps at Bethesda Fountain. | Photo: Kristina Malzbender This report is from Sunday, January 25, 2025. A surprise 12-inch snowfall transformed New York City’s Central Park into an improbable winter playground last Sunday, drawing out homesick skiers and snowboarders eager to make turns wherever gravity allowed. SnowBrains caught up with current New York resident Kristina Malzbender, who found herself at the center of one of the Big Apple’s most surreal ski days in recent memory-Central Park Skiing. Early in the week, as forecasts began hinting at a major storm, Malzbender tossed out a casual post on TikTok about organizing a Central Park ski meetup. The response snowballed quickly. What began as a simple idea turned into a group chat of nearly 180 skiers, all intrigued by the idea of sliding through one of the world’s most iconic urban parks. While it was a far cry from the deep, consistent snowpacks of her hometown, Boulder, Colorado, Malzbender saw opportunity",
      "pub_date": "2026-01-27",
      "id": "dbdb5185267d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Snow Industry News",
      "title": "Haglöfs Designs Olympic Race Suit For Swedish Alpine & Ski Cross Teams",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/hagloefs-designs-olympic-race-suit-for-swedish-alpine-ski-cross-teams/",
      "content": "Haglöfs, official partner of the Swedish Olympic Committee (SOK), proudly deepens its role with the Swedish Olympic Team ahead of the 2026 Winter Olympics in Milano Cortina. Already responsible for the lightweight mittens worn by Swedish athletes throughout the Games, Haglöfs can now announce it has been entrusted with the prestigious assignment of designing the official race suit for Sweden’s alpine skiing disciplines and ski cross. Designed in close collaboration with Olympic Alpine and Ski cross athletes, with an unmistakable Swedish identity. Drawing inspiration from Sweden’s deep winter darkness, raw winter elements, and the explosive movement of alpine skiing as skis carve through snow, the design reflects both speed and precision — anchored in Haglöfs’ 111-year heritage of Scandinavian craftsmanship and innovation. The result is a race suit visually expressing the strength, confidence, and modern character of Swedish winter sports on the world’s biggest stage. “Being part of Swe",
      "pub_date": "2026-01-27",
      "id": "ea897e8113e4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "ski-history",
        "hospitality"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Unofficial Networks",
      "title": "Japanese Ski Resort Photographer Unknowingly Asks Travis Rice For A Picture",
      "url": "https://unofficialnetworks.com/2026/01/27/japense-photographer-travis-rice/",
      "description": "A Japanese ski resort received quite the surprise when the random snowboarder he approached for a picture turned out to be Travis Rice",
      "content": "Gen , the official photographer for Myoko Suginohara ski resort in Japan, received quite the surprise when the random snowboarder he approached for a photograph turned out to be snowboarding legend Travis Rice . He initially approached the man simply because he thought he looked cool, at least according to his introduction, only realizing that it was the influential athlete after asking for his name. View this post on Instagram A post shared by 《公式》妙高杉ノ原スキー場 myokosuginohara (@suginohara_official) Travis Rice, if you somehow don’t know, is an X-Games gold medalist, snowboard film star, big mountain freestyle pioneer, and founder of the Natural Selection Tour . Based on how he acts in this video he’s also an incredibly nice guy, happily allowing Gen to grab some pictures of him and staying very kind throughout the encounter. Wyoming’s First Ski Resort Announces Loaded Summer Concert Lineup Categories: Japan Snowboarding",
      "pub_date": "2026-01-27",
      "id": "5e21e14927c3",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [
        "winter-sports",
        "ski-history",
        "hospitality"
      ],
      "approved_date": "2026-01-28"
    },
    {
      "source": "PlanetSKI",
      "title": "The Latest PlanetSKI Snow Report",
      "url": "https://planetski.eu/2026/01/27/the-latest-planetski-snow-report-2/",
      "description": "Our latest rolling snow report is out and we hear today from Canada and the USA. NEW The post The Latest PlanetSKI Snow Report appeared first on PlanetSKI .",
      "content": "Tuesday 27th January PlanetSKI has moved on from its current winter base near Banff in Alberta, Canada. We have been reporting on conditions in the resorts of Lake Louise , Sunshine Village and Mt Norquay . Now we’re off on little road trip to neighbouring British Columbia and then swinging back through the town of Jasper and its ski resort of Marmot Basin in Alberta. PlanetSKI editor, James Cove, starts in one of his favourite resorts in Canada. So, where might that be? View this post on Instagram A post shared by PlanetSKI (@planetski.eu) What James didn’t mention in the video was that it has been, er, rather chilly. The temperature was -9c, but it felt more like -14c in the wind chill. Fortunately Revelstoke has a few of these very welcome places – warming huts. Revelstoke, Canada. Image © PlanetSKI Revelstoke, Canada. Image © PlanetSKI Revelstoke, Canada. Image © PlanetSKI Tomorrow, weather permitting, we’re planning to boot up here: Revelstoke, Canada. Image © PlanetSKI That gives",
      "pub_date": "2026-01-27",
      "id": "8b1ba9caacde",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "canada",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "Jay Peak Resort, VT, is the Snowiest Resort in North America as it Surpasses 300″ for the Season",
      "url": "https://snowbrains.com/jay-peak-resort-vt-is-the-snowiest-resort-in-north-america-as-it-surpasses-300-for-the-season/",
      "description": "Vermont’s Jay Peak Resort continues its remarkable streak this winter, reaching the 300-inch snowfall mark faster than at any point in the past 25 years. On Sunday, the mountain received another 10 to 14 inches of fresh powder, with an additional 4 to 8 inches still forecast for tonight. Over the past week alone, Jay Peak has received 32 inches […] The post Jay Peak Resort, VT, is the Snowiest Resort in North America as it Surpasses 300″ for the Season appeared first on SnowBrains .",
      "content": "Jay Peak Resort goes over the 300-inch mark for the season. | Image: Jay Peak Resort Vermont’s Jay Peak Resort continues its remarkable streak this winter, reaching the 300-inch snowfall mark faster than at any point in the past 25 years. On Sunday, the mountain received another 10 to 14 inches of fresh powder, with an additional 4 to 8 inches still forecast for tonight. Over the past week alone, Jay Peak has received 32 inches of snow, and an impressive 60 inches over the last 16 days—putting it one day ahead of the resort’s record-setting 2000–2001 season. Nearly a month earlier, the resort celebrated another milestone by surpassing the 200-inch mark just two days before Christmas. An overnight dusting of 1 to 2 inches pushed the season total to 201 inches, marking the fastest Jay Peak has ever reached that benchmark. The season’s strong start began back on Thanksgiving, when Jay crossed the 100-inch threshold with totals already sitting at 103 inches. Related: Ski Resort Storm Total",
      "pub_date": "2026-01-27",
      "id": "0f33e13a063f",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations",
        "hospitality"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Snow Industry News",
      "title": "German Ski Areas Report Positive Interim Results",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/german-ski-areas-report-positive-interim-results/",
      "content": "The German Cable Car Association (VDS) has drawn a positive interim conclusion for the current winter season: The early start in November and the bitter cold from the end of December onwards, accompanied by mostly sunny weather, provided excellent conditions. The cold spell offered ideal conditions for artificial snowmaking, and ski resorts with good snowmaking infrastructure are recording increases or are at the very good level of the previous year. Purely natural snow resorts are currently benefiting from the snow conditions and are following suit. Particularly pleasing is the high demand for ski courses, primarily among young people, and the large number of sunbathers who, in addition to winter sports enthusiasts, are drawn to the mountains by the fantastic winter weather. The winter season was opened by the Söllereck, a family-friendly mountain in Oberstdorf, with the six neighboring ski resorts in the Allgäu region following suit. The area is delighted with the excellent slope con",
      "pub_date": "2026-01-27",
      "id": "421131710011",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "business-investment",
        "resort-operations"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "PlanetSKI",
      "title": "Three More Avalanche Deaths in France",
      "url": "https://planetski.eu/2026/01/27/three-more-avalanche-deaths-in-france/",
      "description": "One man died in Tignes in the Alps, while two others perished in Le Grand Tourmalet in the Pyrenees. The avalanche death toll this month continues to rise. NEW The post Three More Avalanche Deaths in France appeared first on PlanetSKI .",
      "content": "In Tignes and off piste skier was caught in the Lavachet area that is above Tignes Le Lac. He was in a group and it is understood they triggered the avalanche themselves. He was the only one caught in the slide. Ski patrollers from the resort, who witnessed the avalanche, and were quickly on the scene and were joined by rescuers from the Compagnies Républicaines de Sécurité, CRS. PlanetSKI reader, David Morgan, alerted us to the incident and took these images. Avalanche in Tignes. Image c/o David Morgan. Avalanche in Tignes. Image c/o David Morgan. The victim, who was equipped with an avalanche transceiver, was found unconscious by the rescuers. Despite resuscitation attempts, the man was pronounced dead at the scene at 3:19 pm. He was a Spanish man in his 50s who was on holiday in the resort. He was the father of two children in their twenties. Avalanche in Tignes. Image c/o David Morgan. Avalanche in Tignes. Image c/o David Morgan. In the French Pyrenees two men, aged 60 and 70, died",
      "pub_date": "2026-01-27",
      "id": "2190b9997f8e",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "international"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "The Ski Guru",
      "title": "Snowmass Ski Instructor Dies on the Slopes — Local Reports",
      "url": "https://www.the-ski-guru.com/2026/01/26/snowmass-ski-instructor-death-aspen/",
      "description": "A long-time ski instructor at Snowmass Ski Area has died after an incident on the mountain on Thursday morning, according to multiple local news sources. Aspen Daily News and the Aspen Times have both confirmed the death of an Aspen Skiing Company instructor at Snowmass Ski Area. Details remain limited as authorities continue to investigate and the family’s … Continue reading \"Snowmass Ski Instructor Dies on the Slopes — Local Reports\" The post Snowmass Ski Instructor Dies on the Slopes — Local ",
      "content": "A long-time ski instructor at Snowmass Ski Area has died after an incident on the mountain on Thursday morning, according to multiple local news sources. Aspen Daily News and the Aspen Times have both confirmed the death of an Aspen Skiing Company instructor at Snowmass Ski Area . Details remain limited as authorities continue to investigate and the family’s privacy is respected. Friends, colleagues and community members shared remembrances and tributes on social media, naming the instructor and acknowledging his longtime contribution to the local ski community. Local News Confirmation & Community Reaction Aspen Daily News posted on Facebook that a ski instructor died on a Snowmass slope Thursday morning , confirming the news via the resort’s communications. The Aspen Times also confirmed the death of an Aspen Skiing Company employee at Snowmass on its official Facebook page, expressing condolences and acknowledging the loss within the mountain community. Friends and colleagues have be",
      "pub_date": "2026-01-26",
      "id": "b13de370a0d9",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents",
        "hospitality"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "Unofficial Networks",
      "title": "Growing Utah Ski Resort Opens Two More New Chairlifts",
      "url": "https://unofficialnetworks.com/2026/01/26/deer-valley-two-more-chairlifts/",
      "description": "While its been a slower start than desired for Deer Valley Resort, they debuted two new lifts this past weekend.",
      "content": "Park City, Utah — While it’s been a low-snow year in Utah, Deer Valley is slowly progressing towards opening all of its new lifts. Before this past weekend, Deer Valley had opened the East Village Gondola and Pinyon Express. Two more chairlifts made their debut on Saturday. On Saturday, Deer Valley opened the Vulcan Express and Revelator Express chairlifts. This is despite the very below-average snowpack Utah has faced so far. For more information, check out the video below and a written explainer of the expansion. Revelator & Vulcan Originally, Deer Valley intended to have these be one continuous lift. However, due to the differences in terrain, in order to improve lapability, they went with two separate chairlifts. I’ll have to ski it to form a true opinion, but I feel like splitting these into two is the right decision. Just one run in this area looks like a true thigh burner. The Vulcan Express is a high-speed quad that services beginner, intermediate, and advanced terrain. However",
      "pub_date": "2026-01-26",
      "id": "12bc463b9135",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "weather-snow",
        "hospitality"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}