{
  "updated": "2026-01-26 11:15:19",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Snow Industry News",
      "title": "Resounding victory For Standing Rock IN 41st Snow Polo World Cup St. Moritz Final",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/resounding-victory-for-standing-rock-in-41st-snow-polo-world-cup-st-moritz-final/",
      "content": "After a night of sparkling celebrations across the über chic resort of St. Moritz – from the sold-out Gala Dinner at Badrutt’s Palace Hotel, to dancing until dawn with polo friends in King’s Social House – the stage was set for Finals’ Day today – the sporting summit of this truly unique tournament, the world’s oldest and best snow polo event. This truly is snow polo at its most iconic: glamorous, gri pping and gloriously unforgettable. Finals’ Day is not just three matches, but a magnificent moment in the winter calendar – a celebration of sport, spectacle and pure excitement which truly has to be experienced to be believed… and once is never enough. 2 6 ,000 spectators certainly agreed, with sellout crowds over the course of the weekend and an impressive 2, 4 00 tonnes of infrastructure placed upon the frozen Lake St. Moritz. As the players made their way on to the arena, the atmosphere was electric. Designer clad spectators filled the stands, Perrier Jouët Champagne glasses clinked ",
      "pub_date": "2026-01-26",
      "id": "0fa1ba3b429a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "international",
        "hospitality",
        "business-investment"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "PlanetSKI",
      "title": "Kirsty Muir Takes Gold at X-Games",
      "url": "https://planetski.eu/2026/01/26/kirsty-muir-takes-gold-at-x-games/",
      "description": "Kirsty Muir secured a third victory and fourth podium for British athletes at the 2026 X Games in Aspen, Colorado, finishing first in the Women’s Freeski Slopestyle. NEW The post Kirsty Muir Takes Gold at X-Games appeared first on PlanetSKI .",
      "content": "Kirsty Muir secured a third victory and fourth podium for British athletes at the 2026 X Games in Aspen, Colorado, finishing first in the Women’s Freeski Slopestyle. Muir’s victory marks her first X Games title having previously taken bronze medals in Slopestyle and Big Air at the 2023 edition. In a competition delayed by 24 hours due to poor weather conditions yesterday evening, Muir soared into top spot on her first run with a mammoth score of 93.66, leaving the rest of the field trailing in her wake. With no other skier able to exceed the 90 point mark, Muir’s victory made her the third Brit to stand atop the podium at this year’s X Games, following Mia Brookes’ victory in Women’s Snowboard Slopestyle, and Zoe Atkin’s gold medal winning performance in the Women’s Freeski Superpipe. Mia Brookes wins X Games gold Zoe Atkin wins second X Games gold for GB Full Podium Kirsty Muir (GBR) 93.66 – 2. Naomi Urness (CAN) 85.00 – 3. Mathilde Gremaud (SUI) 80.00 “Kirsty’s performance in today’s",
      "pub_date": "2026-01-26",
      "id": "9a9889771c73",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "The Ski Guru",
      "title": "Snowmass Ski Instructor Dies on the Slopes — Local Reports",
      "url": "https://www.the-ski-guru.com/2026/01/26/snowmass-ski-instructor-death-aspen/",
      "description": "A long-time ski instructor at Snowmass Ski Area has died after an incident on the mountain on Thursday morning, according to multiple local news sources. Aspen Daily News and the Aspen Times have both confirmed the death of an Aspen Skiing Company instructor at Snowmass Ski Area. Details remain limited as authorities continue to investigate and the family’s … Continue reading \"Snowmass Ski Instructor Dies on the Slopes — Local Reports\" The post Snowmass Ski Instructor Dies on the Slopes — Local ",
      "content": "A long-time ski instructor at Snowmass Ski Area has died after an incident on the mountain on Thursday morning, according to multiple local news sources. Aspen Daily News and the Aspen Times have both confirmed the death of an Aspen Skiing Company instructor at Snowmass Ski Area . Details remain limited as authorities continue to investigate and the family’s privacy is respected. Friends, colleagues and community members shared remembrances and tributes on social media, naming the instructor and acknowledging his longtime contribution to the local ski community. Local News Confirmation & Community Reaction Aspen Daily News posted on Facebook that a ski instructor died on a Snowmass slope Thursday morning , confirming the news via the resort’s communications. The Aspen Times also confirmed the death of an Aspen Skiing Company employee at Snowmass on its official Facebook page, expressing condolences and acknowledging the loss within the mountain community. Friends and colleagues have be",
      "pub_date": "2026-01-26",
      "id": "b13de370a0d9",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents",
        "hospitality"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "SnowBrains",
      "title": "Buttermilk Ski Resort, Aspen, CO, Report: Park Laps, Tiehack, and a Storm a-Brewin’",
      "url": "https://snowbrains.com/buttermilk-ski-resort-aspen-co-conditions-report-park-laps-tiehack-and-a-storm-a-brewin/",
      "description": "This report is from Saturday, January 24, 2026. Aspen, Colorado, most famously known for hosting the annual Winter X Games, is home to four mountains that offer excellent, unique skiing and snowboarding experiences. In the midst of an eerily dry Colorado winter, Aspen has the most skiable terrain in Colorado right now, with several thousand acres open for riding across all […] The post Buttermilk Ski Resort, Aspen, CO, Report: Park Laps, Tiehack, and a Storm a-Brewin’ appeared first on SnowBrain",
      "content": "Setting the Stage at X-Games Day One! Credit: SnowBrains This report is from Saturday, January 24, 2026. Aspen, Colorado, most famously known for hosting the annual Winter X Games, is home to four mountains that offer excellent, unique skiing and snowboarding experiences. In the midst of an eerily dry Colorado winter, Aspen has the most skiable terrain in Colorado right now, with several thousand acres open for riding across all skill levels. For my first day in Aspen and day one of the Winter X-Games, I cruised around Buttermilk Mountain, enjoyed beautiful vistas, some rolling groomers, and perfect park laps, and watched as world-class athletes practiced for their events and then competed at the highest level. View of the storm rolling in over Aspen Highlands as seen from the Tiehack side of Buttermilk! Credit: SnowBrains For my first few runs of the day, I headed over to the Tiehack side of the mountain. The Tiehack Express lift covers over 1,500 vertical feet and services several bl",
      "pub_date": "2026-01-25",
      "id": "c10ba0f976b6",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-25"
    },
    {
      "source": "Unofficial Networks",
      "title": "Experienced Skier Predicts Exactly Where Cornice Will Break & Triggers Avalanche",
      "url": "https://unofficialnetworks.com/2026/01/25/experienced-skier-predicts-exactly-where-cornice-will-break-triggers-avalanche/",
      "description": "Skier called his shot by drawing a line in the snow before delivering a well placed stomp that released a cornice that immediately triggered an avalanche.",
      "content": "Like Babe Ruth stepping up to the plate in the 1932 World Series against the Chicago Cubs and pointing to the bleachers before crushing a homerun to deep center field, this skier called his shot by drawing a line in the snow before delivering a well placed stomp that released a cornice that immediately triggered an avalanche. Releasing an overhanging mass of snow formed by wind deposits (triggering a cornice fall) in the backcountry may be a satisfying experience and mitigate dangerous build ups on ridgelines but being in the position to do so is dangerous in itself and should only be performed by trained professionals. Learn more about cornice fall safety below. AVALANCHE.ORG CORNICE SAFETY: Cornices grow through the winter on the leeward side of wind exposed ridges and summits. Cornices range from small wind lips of soft snow to overhangs of hard snow larger than a school bus. They can break off the terrain suddenly and unexpectedly and can sometimes be triggered from a distance. Ove",
      "pub_date": "2026-01-25",
      "id": "363e5cfa9fa9",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "Another Avalanche Death in the Alps",
      "url": "https://planetski.eu/2026/01/25/another-avalanche-death-in-the-alps-2/",
      "description": "A 42-year-old man has died in Maurienne in France. He was part of a group of three skiers. It follows dozens of deaths in the Alps in recent weeks. NEW The post Another Avalanche Death in the Alps appeared first on PlanetSKI .",
      "content": "The avalanche accident happened on the north face of the Cime du Sambuis, in Maurienne on Friday at 3pm. The victim was part of a group of three skiers from Chambéry and Lyon. The first skier went down the slope without incident but the second was carried away by an avalanche and he was thrown against rocks. The other two skiers alerted the rescue authorities. “The skier was carried away by a wind plate above rock bars,” and could not be resuscitated despite the intervention of the High Mountain Gendarmerie Platoon of Savoie (PGHM) and a Samu doctor, said the prefecture in a statement. The authorities continue to advise that people use extreme caution off piste with a generally unstable snow pack. It is the latest in a series of avalanche fatalities as we have reported on PlanetSKI: Irish skier is latest to die in avalanche in the Alps Eight skiers die in three separate avalanches in Austria 13 year old boy is latest avalanche fatality More avalanches in the Alps with ‘high’ risk in pl",
      "pub_date": "2026-01-25",
      "id": "c7ca4de8d314",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-25"
    },
    {
      "source": "SnowBrains",
      "title": "Winter X Games at Aspen, CO, Recap Day 2: Highlighting Snowboard Big Air",
      "url": "https://snowbrains.com/winter-x-games-at-aspen-co-recap-day-2-highlighting-snowboard-big-air/",
      "description": "Day two of the X Games was a nice show, with three different sports to watch. Yep, Snowmobiling is back. Several events were postponed because of the heavy snowfall overnight and throughout the day, so it was a bit chaotic at times, scrambling from one event to another, but I will never complain about snow, and it made for an […] The post Winter X Games at Aspen, CO, Recap Day 2: Highlighting Snowboard Big Air appeared first on SnowBrains .",
      "content": "The medals that we have all been waiting for. Credit: SnowBrains. Day two of the X Games was a nice show, with three different sports to watch. Yep, Snowmobiling is back. Several events were postponed because of the heavy snowfall overnight and throughout the day, so it was a bit chaotic at times, scrambling from one event to another, but I will never complain about snow, and it made for an active day. Celebrities, including Justin Bieber, Gunna, Johnny Knoxville, Alvin Kamara, and Alex Bregman, showed up at the X Games today to have fun. In my opinion, Men’s Ski Slopestyle might be the most technical event of the weekend, and it was the first competition I watched today. The way that the judges are so tight with scoring, between athletes coming off rails early or making sure tricks are landed precisely at the right angle, means that no skier on the podium can win with a bobbled run. A winning run has to flow from top to bottom, and the skiers need to maximize their use of every last s",
      "pub_date": "2026-01-25",
      "id": "a94e4b74fc43",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality",
        "weather-snow",
        "transportation"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "Unofficial Networks",
      "title": "Pennsylvania Ski Resort Closes In Effort To Stop Roadway Travel",
      "url": "https://unofficialnetworks.com/2026/01/25/pennsylvania-closes-in-effort-to-stop-roadway-travel/",
      "description": "While it may come as disappointment to local skiers and snowboarders, Blue Mountain stands by their decision to curb road traffic in accordance with state officials and local snow emergency orders.",
      "content": "Blue Mountain Resort in Palmerton, Pennsylvania will not be operating today. The resort was flooded with social media comments after the announcement and their Director of Mountain Operations, Nick Delich , addressed their concerns with the following video: “We hear you. We know it may seem odd for a ski resort to close during a snow storm. Nick is here to give you some insight into why we made the decision to close Sunday and open at Noon on Monday. The safety of you, our team members, and local first responders is our top priority. We are THRILLED to be receiving this much snow, but we need to keep roadway safety in mind. Blue Mountain Resort does not have onsite lodging. Our guests will be traveling in and traveling out during this storm that is spanning a 150 mile radius of the mountain. When we reopen on Monday, we will do it right. The pause will be worth the powder on your favorite ungroomed trails! We appreciate you all and can’t wait to see you back on the mountain!” While it ",
      "pub_date": "2026-01-25",
      "id": "81fe740e2c40",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "transportation",
        "safety-incidents",
        "resort-operations"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "Snow Industry News",
      "title": "U.S. Ski & Snowboard Names 97 Athletes For 2026 Milano Cortina Olympic Winter Games",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/us-ski-snowboard-names-97-athletes-for-2026-milano-cortina-olympic-winter-games/",
      "content": "U.S. Ski & Snowboard has nominated 97 athletes to represent Team USA at the 2026 Milano Cortina Olympic Winter Games, Feb. 6-22, 2026. The athletes were selected to Team USA based on pre-determined Olympic Winter Games selection criteria by U.S. Ski & Snowboard and will be officially announced to Team USA on Jan. 26, 2026. The Milano Cortina Games will take place across Italy, becoming the most geographically widespread Games in history. Athletes will compete across 25 venues in four main clusters: Milan, Cortina d’Ampezzo, Valtellina and Val di Fiemme, with 116 medal events on the schedule. For ski and snowboard events, Bormio will host men’s alpine, Cortina will host women’s alpine, cross country, ski jumping and nordic combined will all take place in Val di Fiemme and freestyle, freeski and snowboard will be in Livigno. U.S. Ski & Snowboard will send 97 athletes to the Olympic Winter Games, including 73 athletes from the Stifel U.S. Ski Team and 24 athletes from the Hydro Flask U.S.",
      "pub_date": "2026-01-24",
      "id": "ad7232dd71e7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-24"
    },
    {
      "source": "The Ski Guru",
      "title": "Aosta Council Backs Inter-Valley Link Between Pila and Cogne",
      "url": "https://www.the-ski-guru.com/2026/01/22/aosta-backs-inter-valley-link-pila-cogne/",
      "description": "The municipal council of Aosta has officially backed a proposal supporting the inter-valley link between the Pila ski resort and the village of Cogne — a move seen as a major step forward for regional tourism, connectivity and mountain mobility. The council approved the motion, presented by members of the Union Valdôtaine and Stella Alpina – Rassemblement Valdôtain, with 25 votes in favour … Continue reading \"Aosta Council Backs Inter-Valley Link Between Pila and Cogne\" The post Aosta Council Ba",
      "content": "The municipal council of Aosta has officially backed a proposal supporting the inter-valley link between the Pila ski resort and the village of Cogne — a move seen as a major step forward for regional tourism, connectivity and mountain mobility. The council approved the motion, presented by members of the Union Valdôtaine and Stella Alpina – Rassemblement Valdôtain , with 25 votes in favour out of 27 . Two councillors voted against it, but the overall support highlights broad political and community interest in exploring the proposal further. The sleepy town of Cogne, which is usually much colder than Aosta as it is in altitude, it is pretty cut off from the main valley, but part of its charm is that! Renown for its cross-country skiing, it has also a smaller alpine skiing resort, which is the one that they want to join to Pila. Photo: The-Ski-Guru. Proponents emphasised that while the council is not deciding how such a link would be built, the endorsement sends a clear message: the id",
      "pub_date": "2026-01-22",
      "id": "9d16839975b8",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "winter-sports"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "Death at Murren’s Inferno Race",
      "url": "https://planetski.eu/2026/01/25/death-at-murrens-inferno-race/",
      "description": "This year's 82nd International Inferno Race in Mürren was cancelled after a 69-year-old racer collapsed shortly before the finish line and died. NEW The post Death at Murren’s Inferno Race appeared first on PlanetSKI .",
      "content": "Medical staff were on hand straight away and despite immediate resuscitation efforts the person, who has not been identified, was pronounced dead at the scene. As a result the Organising Committee decided to immediately cancel the race. Around half the competitors had completed the grueling course. The organisers decided to evaluate the results up to the point when the race was cancelled and the winners were announced. “Despite the sad incident that forced the race to be abandoned, the celebrations at the Alpine Sports Centre in Mürren will continue in the evening in a modified format,” said the organisers in a statement shortly after the accident. See here for a press release on the incident. The Inferno Race is held annually in the Swiss resort of Mürren. It was started by the Kandahar Club in 1928 when 17 Kandahar members climbed to the summit of the Schilthorn over two days. They then set off in a mass start for the race to Lauterbrunnen in the valley bottom, a drop of 2,170m. It i",
      "pub_date": "2026-01-25",
      "id": "2490a285f08c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-25"
    },
    {
      "source": "SnowBrains",
      "title": "World Ski & Snowboard Festival Returns to Whistler, BC, to Celebrate 30 Years of Mountain Culture",
      "url": "https://snowbrains.com/world-ski-snowboard-festival-returns-to-whistler-bc-to-celebrate-30-years-of-mountain-culture/",
      "description": "This spring, the World Ski & Snowboard Festival (WSSF) returns to Whistler, British Columbia, to celebrate a milestone thirty years in the making. Running April 6–12, 2026, the 30th edition of WSSF brings together athletes, artists, musicians, filmmakers, and the local community for a week-long celebration of mountain culture, creativity, and connection. Founded in 1996, WSSF grew alongside a generation […] The post World Ski & Snowboard Festival Returns to Whistler, BC, to Celebrate 30 Years of",
      "content": "World Ski and Snowboard Festival, Whistler, BC. | Image: WSSF This spring, the World Ski & Snowboard Festival (WSSF) returns to Whistler, British Columbia , to celebrate a milestone thirty years in the making. Running April 6–12, 2026, the 30th edition of WSSF brings together athletes, artists, musicians, filmmakers, and the local community for a week-long celebration of mountain culture, creativity, and connection. Founded in 1996, WSSF grew alongside a generation of skiers, snowboarders, filmmakers, and musicians. It became the place where spring skiing met late nights, where film premieres turned into lifelong careers, and where iconic concerts, competitions, and après moments became part of Whistler folklore. What to Expect at WSSF 2026 The anniversary edition blends the festival’s most iconic elements with an expanded, multi-disciplinary program spanning sport, music, film, art, and nightlife, including: Signature snow sport competitions such as The Grind, Mini Pipe, Rail Jams, an",
      "pub_date": "2026-01-25",
      "id": "38851f3eea55",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "canada",
        "transportation"
      ],
      "approved_date": "2026-01-26"
    },
    {
      "source": "Unofficial Networks",
      "title": "If You Think Corbet’s Couloir Is Intimidating, Wait Until You See Its Nextdoor Neighbor",
      "url": "https://unofficialnetworks.com/2026/01/25/courbets-couloir-scarier-neighbor/",
      "description": "Corbet's Couloir is the most well known trail at Jackson Hole, but it's not scariest. That title might go to its monstrous neighbor.",
      "content": "Corbet’s Couloir at Jackson Hole is well known as one of the most famous ski runs in North America, hosting an endless number of highlights and crash reels. But when it comes to the scariest trail on the mountain, Corbet’s Couloir just isn’t it. Looker’s left of Corbet’s sits its much scarier neighbor, S&S Couloir. Whether or not it’s the most difficult run at Jackson Hole might be up for debate, but it certainly requires more commitment than the famous run. S&S Couloir has a mandatory air or wall ride (which might as well be an air) for entrance. It’s also steeper, narrower, and likely more dangerous than Corbet’s Couloir, so why doesn’t it get all the attention that’s directed toward its neighbor? The answer is simple: it’s too hard. Corbet’s is very difficult, but it’s approachable enough that plenty of people are willing to try it every day. As such a crowd gathers hoping to see some wild stunts or brutal crashes. S&S Couloir, on the other hand, is hardly touched, so there’s no poi",
      "pub_date": "2026-01-25",
      "id": "c12ad3fcae9e",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [],
      "approved_date": "2026-01-26"
    },
    {
      "source": "Snow Industry News",
      "title": "Atomic Pays Homage To The \"Herminator\" With Retro-Inspired Hermann Maier Skis",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/atomic-pays-homage-to-the-herminator-with-retro-inspired-hermann-maier-skis/",
      "content": "Atomic is tapping into alpine skiing nostalgia with the launch of the limited-edition X9S Beta Race 10.26, a modern performance ski that pays homage to the legendary equipment once raced by Austrian great Hermann Maier during his dominant run in the late 1990s and early 2000s. The collector's edition ski blends unmistakable retro aesthetics drawn from the original Beta Race models with contemporary race-proven construction, creating a tribute to one of the sport's most formidable competitors while showcasing Atomic's enduring World Cup heritage. The X9S Beta Race 10.26 draws visual inspiration directly from those championship years while hiding thoroughly modern engineering beneath its nostalgic graphics. Built for aggressive on-piste skiers, the ski features a Multi Radius Sidecut that allows it to snap through short turns while remaining composed and stable in longer GS-style arcs. Performance remains central to the design. Ultrawall sidewalls deliver precise edge grip and efficient ",
      "pub_date": "2026-01-23",
      "id": "4d4aaa32aba7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "ski-history"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "The Ski Guru",
      "title": "What to Pack for a Half-Term Ski Trip with Your Family",
      "url": "https://www.the-ski-guru.com/2026/01/22/half-term-ski-packing-family/",
      "description": "Half-term ski holidays are exciting, busy, and often cold. Resorts are lively, temperatures can vary significantly, and when skiing with children, being well prepared makes all the difference. This practical guide focuses on layers, warmth, safety and comfort, with tips for both adults and children — especially younger kids, who feel the cold more quickly. The Golden … Continue reading \"What to Pack for a Half-Term Ski Trip with Your Family\" The post What to Pack for a Half-Term Ski Trip with Yo",
      "content": "Half-term ski holidays are exciting, busy, and often cold. Resorts are lively, temperatures can vary significantly, and when skiing with children, being well prepared makes all the difference . This practical guide focuses on layers, warmth, safety and comfort , with tips for both adults and children — especially younger kids, who feel the cold more quickly. The Golden Rule: Dress in Layers Layering allows you to adapt easily to changing weather, activity levels and temperatures. Family enjoys a day skiing on the mountain in Vail, CO. Photo Credit: Craig Orsini. Vail Resorts. Base Layer (Next to Skin) Thermal top and leggings Merino wool or synthetic fabrics (avoid cotton) For children: pack multiple base layers , as they get wet easily Mid-Layer (Warmth) Fleece or insulated mid-layer Wool or Merino jumper (excellent for colder days and for children) Lightweight down or synthetic jacket for very cold conditions Tip: two thin mid-layers are often more versatile than one bulky one. Outer",
      "pub_date": "2026-01-22",
      "id": "d891c86b7907",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-01-23"
    },
    {
      "source": "Ski Area Management",
      "title": "$100M Investment, Major Changes Coming to Mont-Sainte-Anne",
      "url": "https://www.saminfo.com/news/sam-headline-news/100m-investment-major-changes-coming-to-mont-sainte-anne",
      "description": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "content": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "pub_date": "2026-01-21",
      "id": "a1b0aac5f103",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "canada"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}