{
  "updated": "2025-12-04 17:32:47",
  "total_articles": 12,
  "articles": [
    {
      "source": "Unofficial Networks",
      "title": "West Virginia’s Ski Season Kicks Off On Thursday, December 4th",
      "url": "https://unofficialnetworks.com/2025/12/03/west-virginia-ski-season-starts/",
      "description": "Three West Virginia ski resorts are set to open up for the 2025/2026 winter season this week, the first of which opens Thursday.",
      "content": "Three West Virginia ski resorts are set to open up for the 2025/2026 winter season this week, the first of which opens tomorrow, Thursday, December 4th. View this post on Instagram A post shared by Timberline Mountain (@timberlinemountain) Timberline Mountain in Davis is opening first, with snowmaking teams working hard to get the area’s most popular terrain ready for the season. It’s not yet clear exactly what terrain will be open tomorrow, though more and more terrain will gradually open following the first day of the season. Between December 4th and December 11th, “Bonus Day” lift tickets will cost just $69 and rentals will cost just $29 per day. Snowshoe Mountain in Snowshoe will open up on Friday, December 5th, with the mountain operations team similarly working very hard to take advantage of cold weather for snowmaking. Opening day is expected to include terrain in the central Basin area with a terrain park setup in Progression Park and potentially a blue or two. Up until Decembe",
      "pub_date": "Wed, 03 Dec 2025 16:21:37 +0000",
      "id": "a0f40510a8ae",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Don’t Miss Out On The Best Value For Your Ski Season At Gore Mountain",
      "url": "https://unofficialnetworks.com/2025/12/03/dont-miss-out-on-the-best-value-for-your-ski-season-at-gore-mountain/",
      "description": "Heads up to all you New York skiers and snowboarders, this is your last day to snag a season pass at Gore Mountain before their final price jump so secure yours before midnight to get the best possible deal. Passholders not only get unlimited lift access at Gore, they can also ski Whiteface and Belleayre […]",
      "content": "Heads up to all you New York skiers and snowboarders, this is your last day to snag a season pass at Gore Mountain before their final price jump so secure yours before midnight to get the best possible deal. Passholders not only get unlimited lift access at Gore, they can also ski Whiteface and Belleayre anytime they want. In addition passholders get 2 free lift tickets to share, discounted on-mountain amenities, and many more perks. “The final price deadline for 2025/26 Season Passes is today, December 3rd. Don’t miss out on the best value for your ski season at Gore! After today, 2025/26 Season Passes are at their peak season price. Don’t miss out on your winter!” Gore got 10 inches of natural snow this week and the resort has been opening trails left and right (10 trails now available) . Cold temps have allowed snowmakers to help bolster coverage and it looks like they more terrain will open in days to come. If you plan on skiing Gore this winter, we highly recommend you don’t dawdl",
      "pub_date": "Wed, 03 Dec 2025 13:22:27 +0000",
      "id": "084f437aa131",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Like Willy Wonka’s Everlasting Gobstopper, Mount Bohemia’s $99 Season Pass Is Simply Unbelievable",
      "url": "https://unofficialnetworks.com/2025/12/03/mb4-the-ski-pass-that-shouldnt-be-99-but-somehow-is/",
      "description": "Michigan's Mount Bohemia $99 season ski pass is simply incredible.",
      "content": "Author: Stacy Pokrywka While almost the entire ski resort industry is moving toward big-box corporate entities and mega-passes, Mount Bohemia in Michigan’s Upper Peninsula is bucking the trend with its $99 season pass . Mount Bohemia is keeping skiing and snowboarding wild, with the most unique vibe I’ve ever experienced. Would a $99 season pass get you stoked for the season? Yeah, me too. But how stoked would you be if I told you the $99 pass also comes with reciprocal days at hills and mountains all over the U.S. and Canada, full access to a legit outdoor Nordic Spa, and gnarly tree skiing with “no beginners allowed” ? Sounds amazing, right? It is. If you haven’t heard about Mount Bohemia, let me give you the lowdown on this ridiculously fun mountain and all the season pass perks. Sitting at the northernmost tip of Michigan’s Upper Peninsula and surrounded on three sides by Lake Superior, Boho (as the locals call it) gets more than 275 inches of snow annually thanks to lake-effect st",
      "pub_date": "Wed, 03 Dec 2025 11:52:00 +0000",
      "id": "3ca54ce2c7b1",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Wishing Klaus Obermeyer A Happy 106th Birthday!",
      "url": "https://unofficialnetworks.com/2025/12/02/wishing-klaus-obermeyer-a-happy-106th-birthday/",
      "description": "Huge shoutout to Klaus Obermeyer who turned 106th today. Klaus was born in Germany in 1919 and witnessed the rise of Nazi fascism. He escaped Germany into Switzerland on skis. During the escape he was shot and fell off a cliff breaking his leg. Klaus managed to get out of the mountains alive and was […]",
      "content": "Huge shoutout to Klaus Obermeyer who turned 106th today. Klaus was born in Germany in 1919 and witnessed the rise of Nazi fascism. He escaped Germany into Switzerland on skis. During the escape he was shot and fell off a cliff breaking his leg. Klaus managed to get out of the mountains alive and was found by a sympathetic nurse who hid him in a Swiss hospital until the WW2 was over. Klaus then moved to Aspen in 1947 where he started Sport Obermeyer . During his first year as a ski instructor at Aspen, Klaus noticed all of the inadequacies of his students’ gear and headed to the drawing table. Klaus created nearly a dozen ski industry firsts, including quilted down parkas turtlenecks, dual construction ski boots, pre-shaped gloves, mirrored sunglasses, and high altitude sunscreen. Certified legend. We wish very happy 106th birthday! Categories: Skiing",
      "pub_date": "Tue, 02 Dec 2025 22:47:06 +0000",
      "id": "ccc5274418fb",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "The Best Upgrades At Utah Ski Resorts For The 2025-26 Season",
      "url": "https://unofficialnetworks.com/2025/12/02/utah-ski-resort-projects-2025/",
      "description": "From Deer Valley's expansion to Sundance's new inn, we've compiled a recap of the biggest improvements at Utah ski resorts.",
      "content": "Utah — While the home to the Greatest Snow on Earth is off to a slow start this winter, that doesn’t m ean it won’t catch its stride eventually. Utah is known for its snow, varied terrain, and recent infrastructure improvements. This ski season in Utah is marked by various transformative projects that will strengthen its appeal to guests and increase its readiness for the 2034 Olympics. With ski season officially underway in the Beehive State, it’s a good time to look at what’s new at Utah ski resorts. Here’s a rundown of the best improvements at Utah ski resorts for the 2025-26 season. Alta Bids Farewell To Their Longest Tenured Avalanche Dog Honorable Mentions Alta completed its Supreme lift realignment project, improving its reliability in the short and long term. Other upgrades include new Wyssen towers, a regrade of the High Traverse, and work has begun on expanding the Albion Base Lodge. Beaver Mountain completed its multi-year base lodge project. The new 26,000-square-foot Marge",
      "pub_date": "Tue, 02 Dec 2025 22:20:46 +0000",
      "id": "e0a7837b6d2c",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Survivalist Feels Honored To Come Face-To-Face With A Mountain Lion",
      "url": "https://unofficialnetworks.com/2025/12/02/mountain-lion-survivalist-encounter/",
      "description": "When wilderness skills instructor Callie Russell came face-to-face with a mountain lion in a tree, she explained her gratitude.",
      "content": "There are an estimated 20,000 to 40,000 mountain lions still living in the United States, primarily living in the western half of the country. Human population growth, poaching, hunting, development, pollution, and habitat loss all threaten their numbers. Spotting one in the wild is a rare occurrence, and while they might seem intimidating, many people are honored to see a mountain lion in the wild. Wilderness skills instructor Callie Russell , who participate on Season 7 of the the show Alone , is one of those people. When she came face-to-face with a mountain lion in a tree, she explained how much gratitude she had for the moment. “ There was a time, long ago, when I was afraid of the large wild predators, mostly when I slept in wild places by myself, with no tent, or anything separating me from them, over the years, I have had several close encounters with mountain lions, bears, and wolves, and now I do not have any fear for them, just deep reverence and respect. It feels like a gif",
      "pub_date": "Tue, 02 Dec 2025 20:48:29 +0000",
      "id": "80677118b574",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "These Six North American Ski Resorts Are Having Great Starts To Their Seasons",
      "url": "https://unofficialnetworks.com/2025/12/02/north-american-ski-resorts-december/",
      "description": "While many ski regions in the US & Canada struck out last month, these six ski resorts had a great November.",
      "content": "This past November will mostly be remembered for its snowless scenes in mountainous locations across North America. Popular ski resorts in Colorado, Tahoe, and Utah had little snow, resulting in many jarring images and videos. However, it wasn’t all bad for North America’s ski industry. Snow arrived in Canada and parts of the Northeast early, allowing for some memorable starts to the season. Here are six ski resorts in North America that have great starts to their seasons. Banff Sunshine Village : If you’re looking to go on a ski vacation soon and have access to lots of terrain, Banff is the place to go. Banff Sunshine Village was the first to open for the season in Canada, thanks to lots of natural stuff. Currently, the ski resort already has 78 trails and 11 lifts open. So far this ski season, Sunshine Village has received 200 centimeters (6 feet 7 inches) of snow at its summit. Sunshine Village, Canada Lake Louise Ski Resort : Another thriving Banff ski resort is Lake Louise. Curren",
      "pub_date": "Tue, 02 Dec 2025 19:59:01 +0000",
      "id": "582688c48baf",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "New Alberta Law Could Help Revive Famous Lost Ski Resort",
      "url": "https://unofficialnetworks.com/2025/12/02/fortress-mountain-revival-effort/",
      "description": "Perhaps the most famous lost ski resort in Canada could be on the comeback trail thanks to a new Alberta law.",
      "content": "Alberta — After years in limbo, Fortress Mountain is shaping up for a comeback. The question is how long it may take. Rocky Mountain Outlook reported last month that the current owners of Fortress Mountain Resort are working on a plan for the revival of the ski resort. The work is still in the early phases, and more approvals will be needed before work can begin. These new efforts are thanks to the All-Season Resorts Act. Passed in 2024, this Alberta law helps make it easier to build or revive a ski resort, such as Fortress Mountain. This is part of Alberta’s plan to increase its tourism revenue from nearly CAD$14.5 billion in 2025 to CAD$25 billion by 2035. Andrew Boitchenko, the Tourism and Sport Minister of Alberta, said the following about the proposal and the All-Season Resorts Act: “The regulatory framework for all-season resorts is still being finalized and no land has been designated at this time. Applications for designation will open once these foundational elements are in pl",
      "pub_date": "Tue, 02 Dec 2025 17:35:35 +0000",
      "id": "53f1543ccc25",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Jackson Hole Mountain Resort Kicks Off 60th Anniversary Winter Season On Thursday",
      "url": "https://unofficialnetworks.com/2025/12/02/jackson-hole-opening-day/",
      "description": "Jackson Hole Mountain Resort is set to kick off their 60th anniversary winter season this Thursday, December 4th.",
      "content": "Jackson Hole Mountain Resort is set to kick off their 60th anniversary winter season this Thursday, December 4th, after delaying their opening day late last month. Continuous snowmaking efforts, 65 inches of snowfall at the summit, and 34 inches of snowfall mid-mountain have allowed for coverage across a significant portion of the north side of the resort. Three lifts will be open for the first day of the season, including Teewinot, Après Vous, and the Sweetwater Gondola up to the Mid-Station. Beginner and intermediate terrain will be available, though early season conditions and hazards will exist. View this post on Instagram A post shared by Jackson Hole Mountain Resort (@jacksonhole) The resort is hoping to announce addition terrain and lift openings heading into the weekend of December 6th-7th, or sooner if the conditions cooperate. The 2025-2026 winter season, the resort’s 60th Anniversary, will run until April 12th, lasting a total of 129 days. Several celebratory events will run",
      "pub_date": "Tue, 02 Dec 2025 16:53:19 +0000",
      "id": "1dca48659029",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Mount Bohemia’s $99 Season Pass Adds Unlimited Skiing at Mont Edouard, QC",
      "url": "https://snowbrains.com/mount-bohemias-99-season-pass-adds-unlimited-skiing-at-mont-edouard-qc/",
      "description": "Yes, the season pass that already gets you skiing all season long at Mount Bohemia, Michigan, and free days at 29 other ski resorts across the United States now adds unlimited skiing at Mont Edouard. Literally, your $99 season pass now gets you two ski resorts for a fraction of the price of one normal East Coast ski resort. Whether […] The post Mount Bohemia’s $99 Season Pass Adds Unlimited Skiing at Mont Edouard, QC appeared first on SnowBrains .",
      "content": "Mont Edouard cleans out its glades each year, and it shows. | Photo: Mont Edouard Yes, the season pass that already gets you skiing all season long at Mount Bohemia , Michigan, and free days at 29 other ski resorts across the United States now adds unlimited skiing at Mont Edouard . Literally, your $99 season pass now gets you two ski resorts for a fraction of the price of one normal East Coast ski resort. Whether you go to Bohemia or Edouard, your pass will pay for itself in just two days. Related: Mount Bohemia, MI, Offering Lifetime Season Pass for $1,449 Good for 75 Years Located roughly 2.5 hours north of Quebec City, Mont Edouard is an undiscovered gem in the remote Saguenay Fjord region of Quebec. Located in the French village of Lanse-St-Jean (1200 inhabitants) near some of the most dramatic Fjords of Quebec, the closest American cities are Upstate New York, less than seven hours away. Built in the 1990s with two chairlifts, Mont Edouard has some of the best in-bounds backcount",
      "pub_date": "Thu, 04 Dec 2025 23:00:46 +0000",
      "id": "feb0a2f4acd1",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Grand Targhee, WY, Sets Opening Day for Friday, December 5, With 2 Lifts and Early-Season Deals",
      "url": "https://snowbrains.com/grand-targhee-wy-sets-opening-day-for-friday-december-5-with-2-lifts-and-early-season-deals/",
      "description": "Grand Targhee Resort will open for the 2025-26 winter season on Friday, December 5, with Shoshone and Huckleberry scheduled to spin for guests. The resort noted on social media that early-season conditions remain, and visitors are encouraged to respect all closures and ski and ride cautiously. “Snow is heading our way this weekend! Don’t forget to carpool and ride the […] The post Grand Targhee, WY, Sets Opening Day for Friday, December 5, With 2 Lifts and Early-Season Deals appeared first on Sn",
      "content": "Grand Targhee Resort will open for the 2025-26 season on Friday, December 5. | Photo Credit: Grand Targhee Resort Grand Targhee Resort will open for the 2025-26 winter season on Friday, December 5, with Shoshone and Huckleberry scheduled to spin for guests. The resort noted on social media that early-season conditions remain, and visitors are encouraged to respect all closures and ski and ride cautiously. “Snow is heading our way this weekend! Don’t forget to carpool and ride the shuttle!” – Grand Targhee To mark the start of the season, The Powder Cache is offering a buy-one-entrée, get-one-free deal through December 11 . Live music returns to The Trap this weekend as well, with Henry Pepin and The Moguls performing Friday and Saturday. Snow is expected to arrive over the weekend, and the resort is reminding guests to carpool or use shuttle services as conditions improve. Targhee also has more than just skiing and snowboarding. Guests can unwind with on-mountain massage services from ",
      "pub_date": "Thu, 04 Dec 2025 21:03:46 +0000",
      "id": "45b6097abb65",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Tahoe Fund Launches $10K Challenge to Improve Backcountry Access for All",
      "url": "https://snowbrains.com/tahoe-fund-launches-10k-challenge-to-improve-backcountry-access-for-all/",
      "description": "INCLINE VILLAGE, Nev. (Dec. 1, 2025) – The Tahoe region offers some of the best winter outdoor recreation in the world, but parking availability, snow removal, and limited trailheads often make the backcountry difficult to access. To help the Tahoe Backcountry Alliance tackle these issues, the Tahoe Fund is launching a new $10k matching challenge to the community. The first 100 […] The post Tahoe Fund Launches $10K Challenge to Improve Backcountry Access for All appeared first on SnowBrains .",
      "content": "The first 100 people to donate $35 or more by December 31, 2025, will unlock a $10,000 gift to Tahoe Backcountry Alliance (TBA) in celebration of their 10th anniversary. | Photo: Tahoe Fund INCLINE VILLAGE, Nev. (Dec. 1, 2025) – The Tahoe region offers some of the best winter outdoor recreation in the world, but parking availability, snow removal, and limited trailheads often make the backcountry difficult to access. To help the Tahoe Backcountry Alliance tackle these issues, the Tahoe Fund is launching a new $10k matching challenge to the community. The first 100 people to donate $35 or more by December 31, 2025, will unlock a $10,000 gift to Tahoe Backcountry Alliance (TBA) in celebration of their 10th anniversary. Donors to the challenge will also receive a TBA membership that corresponds to their gift level. Membership tiers are $35, $150, or $500, and include the following benefits: Every TBA member will receive a 3-month free trial with onX with 20% off an onX annual membership i",
      "pub_date": "Thu, 04 Dec 2025 19:37:12 +0000",
      "id": "38d286a722b6",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    }
  ]
}