{
  "updated": "2026-02-04 14:50:52",
  "total_articles": 18,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Unofficial Networks",
      "title": "POV Footage Shows Just How Wild Freeride Skiing Really Is",
      "url": "https://unofficialnetworks.com/2026/02/04/pov-freeride-footage-ben-richards/",
      "description": "It's pretty hard to understand just how intense freeride skiing runs really are without seeing it from the athlete's perspective.",
      "content": "The first ever FIS Freeride World Championships went down on Tuesday, February 3rd, at Ordino Arcalís in Andorra, bringing 65 of the world’s best freeride skiers and snowboarders from 17 nations together for an epic competition. The winning runs were seriously impressive, but it’s pretty hard to understand just how insane these runs really are without seeing it from the athlete’s perspective. Ben Richards won the men’s ski category with a wild run, but his newly released GoPro footage really gives you a new appreciation for the steepness and intensity of the face at Ordino Arcalís. Ben’s first place finish beat French skier Ugo Troubat, who wound up in second, and American skier Kai Jones, who wound up in third. Make sure you catch every winning run here . Watch Every Winning Run From The First Ever Freeride World Championships Categories: Europe Freeride World Tour Skiing",
      "pub_date": "2026-02-04",
      "id": "e990a376566c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality",
        "international"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "SnowBrains",
      "title": "Christina Lustenberger and Team Complete First-Ever Ski Descent of Mount Deltaform’s North Glacier, BC",
      "url": "https://snowbrains.com/christina-lustenberger-and-team-complete-first-ever-ski-descent-of-mount-deltaforms-north-glacier-bc/",
      "description": "View this post on Instagram A new line has been written into Canadian ski mountaineering history. On January 18, 2026, pro skier Christina Lustenberger—widely known as “Lusti”— along with partners Brette Harrington and Gee Pierrel completed the first-ever descent of the North Glacier on Mount Deltaform in British Columbia. The expedition unfolded deep in the Canadian Rockies and demanded a […] The post Christina Lustenberger and Team Complete First-Ever Ski Descent of Mount Deltaform’s North Gla",
      "content": "View this post on Instagram A new line has been written into Canadian ski mountaineering history . On January 18, 2026, pro skier Christina Lustenberger —widely known as “Lusti”— along with partners Brette Harrington and Gee Pierrel completed the first-ever descent of the North Glacier on Mount Deltaform in British Columbia. The expedition unfolded deep in the Canadian Rockies and demanded a full-spectrum commitment that blended endurance, technical climbing, and exposed skiing. According to details shared by Black Crows, Lusti’s sponsor, the team departed the Moraine Lake trailhead early on January 17, hauling gear in toboggans for 17 kilometers in temperatures as low as –18°C (0°F). High winds sent spindrift cascading off the surrounding walls as they moved toward their objective, eventually establishing camp deep in the Valley of the Ten Peaks . Conditions shifted overnight. By morning, calm air allowed the team to begin their ascent of Mount Deltaform via a series of exposed ramps ",
      "pub_date": "2026-02-04",
      "id": "e7720a60f579",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "PlanetSKI",
      "title": "Vonn Claims Olympics is Still on the Cards",
      "url": "https://planetski.eu/2026/02/04/vonn-claims-olympics-is-still-on-the-cards/",
      "description": "Lindsey Vonn tore her ACL in a high speed downhill crash at a World Cup event in Crans-Montana last week. She has not ruled out taking part in next weekend's Olympic Downhill in Italy. NEW The post Vonn Claims Olympics is Still on the Cards appeared first on PlanetSKI .",
      "content": "She says she is “very hopeful” she can compete at the Milan-Cortina Winter Olympics. Ski racers have competed with torn ACL’s before and Vonn crucially doesn’t have swelling on the knee. The former Olympic champion said her knee feels “stable, strong and is not swollen” and she feels “confident” she will make the women’s downhill event in Cortina next Sunday. “This is obviously not what I hoped for. I have been working really hard to come into these Games in a much different position,” she said. “I know what my chances were before the crash and I know that my chances aren’t the same as it stands now, but I know there is still a chance. “As long as there is a chance, I’ll try. That’s where I am.” The four-time world champion retired from the sport in 2019 but made a stunning comeback in December 2024 following a partial replacement of her right knee. Lindsey Vonn set to race again She is currently top of the World Cup downhill standings, with two race wins and three more podium finishes",
      "pub_date": "2026-02-04",
      "id": "ce7971031b64",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Snow Industry News",
      "title": "Two New 6-Seater Chairlifts Open In Dachstein-West",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/two-new-6-seater-chairlifts-open-in-dachstein-west/",
      "content": "With the grand opening of the two new 6-seater chairlifts, Aussichtsberg and Angeralm, the Dachstein West ski region has reached another significant milestone in its tourism development. The two new lifts connect the ski resorts in Gosau (Upper Austria) and Annaberg (Salzburg) and thus serve as a powerful symbol of cross-border cooperation in alpine tourism. Since their commissioning last December, they have noticeably improved traffic flow in the ski area and provided a new, modern skiing experience. “With the new Aussichtsberg and Angeralm 6-seater chairlifts, Dachstein West has achieved a true vision for the future. These lifts are a visible sign that targeted investments in quality, safety, and guest comfort are having an immediate impact. The high level of guest satisfaction confirms that we are on the right track. Around €22 million was invested in the two new lifts. This sustainably strengthens Dachstein West's position as Upper Austria's largest ski region and as a high-perform",
      "pub_date": "2026-02-03",
      "id": "a22103710f5c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "The Ski Guru",
      "title": "How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)",
      "url": "https://www.the-ski-guru.com/2026/02/03/how-to-use-avalanche-bulletins/",
      "description": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number, without fully understanding how to use the rest of the information to plan a safe mountain … Continue reading \"How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)\" The post How to Use Avalanche Bulletins to Plan Your Mou",
      "content": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number , without fully understanding how to use the rest of the information to plan a safe mountain day. This guide explains how to read and apply avalanche bulletins properly , what they can (and cannot) tell you, and where to find the official avalanche forecasts across Europe. What an Avalanche Bulletin Is — and What It Is Not An avalanche bulletin (or avalanche forecast) is a regional risk assessment , based on: snowpack observations recent avalanche activity weather patterns (snowfall, wind, temperature) terrain characteristics Swiss Avalanche Bulletin Update. Slf.ch. How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step). It is not : a guarantee of safety a green light to ski steep terrain a precise description of e",
      "pub_date": "2026-02-03",
      "id": "8e3088d0ec9b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Ski Area Management",
      "title": "The 2026 I Am a Snowmaker Contest Winner",
      "url": "https://www.saminfo.com/news/sam-headline-news/the-2026-i-am-a-snowmaker-contest-winner",
      "description": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "content": "SAM Magazine—Killington, Vt., Feb. 3, 2026— Nearly 7,500 total votes were cast for the six competing snowmaking teams during the 13-day voting period of the 2026 I AM a Snowmaker contest, with Seven Springs, Pa., receiving the most votes to take home the title. Contest sponsor HKD Snowmakers president Charles Santry honored Seven Springs at the HTI dinner in the Killington Peak Lodge during the National Ski Areas Association Eastern Winter Conference on Tuesday, Feb. 3. Each ski area in the cont",
      "pub_date": "2026-02-03",
      "id": "6a5af2600c40",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Ski Guides Sued For $14.5 Million Over Fatal Avalanche",
      "url": "https://unofficialnetworks.com/2026/02/04/oregon-ski-guides-sued/",
      "description": "The family of a skier who died from a backcountry avalanche is suing the guides and the cat-skiing company.",
      "content": "Douglas County, Oregon — Another week, another Oregon ski industry lawsuit. Central Oregon Daily reports that the family of a deceased skier has sued a mountain guide company for $14.525 million over the actions that led to his death. The lawsuit is against the Diamond Lake Improvement Company (which owns the cat-skiing operations), the three guides, and Sierra Wilderness Seminars Inc. (the company from which the guides were hired). During the 2023-24 season, Brian Thomas Roberts was on a cat-skiing trip. Around that fateful day, the weather at Mt. Bailey featured freezing rain, heavy snow, and wind. Despite the avalanche report saying the risk was high, the trip leaders continued skiing that day because the report didn’t apply to Mt. Bailey. These guides were reportedly inexperienced with Mt. Bailey, which at least one more experienced guide brought up as a concern. Brian was the fifth to ski down on the final run of the day, with each individual being sent down in one-minute interval",
      "pub_date": "2026-02-04",
      "id": "34aedb2d0f01",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "business-investment"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "SnowBrains",
      "title": "Cloudmont Ski Resort in Alabama Opens for its 54th Season",
      "url": "https://snowbrains.com/cloudmont-ski-resort-in-alabama-opens-for-its-54th-season/",
      "description": "While a cold spell and major winter storms are disrupting the normal day-to-day for millions of Americans, the folks down in Alabama are celebrating. That’s because Cloudmont Ski Resort, affectionately known as “Ski Bama,” on Lookout Mountain in Mentone, Alabama, has finally opened its doors this winter season. Though this marks Cloudmont’s 54th season, it has not always been smooth […] The post Cloudmont Ski Resort in Alabama Opens for its 54th Season appeared first on SnowBrains .",
      "content": "Bluebird Day at Alabama’s lone ski resort. Photo: Cloudmont Ski Resort Facebook While a cold spell and major winter storms are disrupting the normal day-to-day for millions of Americans, the folks down in Alabama are celebrating. That’s because Cloudmont Ski Resort, affectionately known as “Ski Bama,” on Lookout Mountain in Mentone, Alabama, has finally opened its doors this winter season. Though this marks Cloudmont’s 54th season, it has not always been smooth sailing for Alabama’s only ski resort. This year is a major comeback for the resort. It is the first time in the last five years that Cloudmont has opened for a full season . The resort owes this to the tremendous winter storm that plunged more than half the country into freezing temperatures, allowing it to make snow. Cloudmont relies on man-made snow as it only averages two to six inches of snowfall per year. Photo: Cloudmont Ski Resort Facebook Located at an elevation of 1,800 feet, Cloudmont is almost entirely reliant on sno",
      "pub_date": "2026-02-04",
      "id": "f10798ea5ff0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations",
        "business-investment"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "PlanetSKI",
      "title": "Freeride Crowns Its First World Champions",
      "url": "https://planetski.eu/2026/02/04/fwt-crowns-its-champions-4/",
      "description": "The first ever FIS Freeride World Championships has taken place in Andorra. It marks a landmark moment for the sport of freeriding. NEW The post Freeride Crowns Its First World Champions appeared first on PlanetSKI .",
      "content": "The Allianz FIS Freeride World Championships Andorra 2026 by Mammut took place following exceptional snowfall that delivered 150 cm of fresh snow, creating outstanding competition conditions in Andorra. Competition day at Ordino Arcalís delivered a defining moment for the sport, as the first-ever FIS Freeride World Championships unfolded in front of an engaged audience. After a covered start which challenged visibility, the competition went under way with good conditions. On world-class terrain the Andorran resort provided a spectacular setting for a landmark event that brought together the world’s best freeriders on one stage. Freeride World Championships 2026. Image c/o FWCH26 & DDAHER Unfortunately the women ski event as stopped due to a lack of visibility following a decision by the Contest Director, prioritising athlete safety. At the time of interruption, 11 of the 16 competitors had completed their runs, meeting the two-thirds threshold required under FIS Freeride Competition Ru",
      "pub_date": "2026-02-04",
      "id": "900c7065c86c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "safety-incidents",
        "weather-snow"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Snow Industry News",
      "title": "Alta Badia Gets Ready For Skiing In Spring In The Heart Of The Dolomites",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/alta-badia-gets-ready-for-skiing-in-spring-in-the-heart-of-the-dolomites/",
      "content": "In March and April, the days grow longer and weather conditions become particularly favourable for skiing. It is the ideal time to enjoy the mountains and the slopes of Alta Badia, in the heart of the Dolomites, a UNESCO World Heritage site, where excellent snow quality and meticulously groomed slopes ensure a high-level experience even at the end of the season. In recent years, Alta Badia has strengthened its position as a leading destination for alpine skiing, thanks to an offer that combines efficient infrastructure, high-quality services and an internationally recognised food and wine scene. As tradition dictates, the ski season in Alta Badia draws to a close with a series of unmissable events. SOMMELIER ON THE SLOPES The Sommelier on the slopes event aims to promote and further showcase the finest wines of South Tyrol. The final dates of the season are scheduled for 3, 10 and 31 March. The initiative combines unforgettable skiing on the slopes of Alta Badia with the tasting of som",
      "pub_date": "2026-02-02",
      "id": "dc66b70e21a5",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "international",
        "business-investment"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "The Ski Guru",
      "title": "Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us",
      "url": "https://www.the-ski-guru.com/2026/02/02/avalanche-activity-france-switzerland-february-2026/",
      "description": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable, despite periods of fair weather and already-tracked slopes. Rather … Continue reading \"Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us\" The post Avalanche Acti",
      "content": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable , despite periods of fair weather and already-tracked slopes. Rather than isolated incidents, the reports collected since late January describe reactive slabs, remote triggers, and persistent weak layers affecting a wide range of aspects and elevations. Much of the recent instability is consistent with wind-loaded slabs and foehn-driven snow transport , which can rapidly overload weak layers and create large, reactive avalanche conditions. Further reading: Why Wind is one of the Most Dangerous Avalanches Triggers. Foehn Winds and Rising Avalanches in the Alps. This update summarises the most significant recent events and explains what they tell us about current conditions. Widesp",
      "pub_date": "2026-02-02",
      "id": "cacf361124bc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Professional Skier Puts Exoskeleton To The Test In Ski Mountaineering Race",
      "url": "https://unofficialnetworks.com/2026/02/04/ski-mountaineering-race-with-exoskeleton/",
      "description": "Alex Hackel raced world record holding ski mountaineer Noah Dines with an exoskeleton to see if it would be enough to give him the win.",
      "content": "Noah Dines is pretty much as close to superhuman as one can get in ski mountaineering. He holds the world record for the most human-powered vertical feet skied in a year, totaling 3,590,097 feet. For 348 days, Noah skied an average of more than 10,000 feet a day. Alex Hackel is a top-notch skier in his own right, earning both a bronze and silver medal at the X Games in Real Ski. He is not a ski mountaineer, but he decided to race Noah Dines in a skimo race anyways. He gave himself a little boost for the contest, though, wearing the Hypershell X Series exoskeleton to see if it could give him enough of a boost to beat a world record holder. Despite throwing several challenges in Noah’s way, Alex having a mechanical boost, and Alex fully skipping a lap to make it a closer race, Noah was able to secure the win. That said, it is very interesting to see how the exoskeleton gave Alex an overall boost on the uphill, even if it wasn’t enough to beat the world record holder. The Future Of Boot F",
      "pub_date": "2026-02-04",
      "id": "a715aac7b987",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-02-04"
    },
    {
      "source": "SnowBrains",
      "title": "Mali Noyes Becomes First Woman to Ski Comstock Couloir, Completing One of The Fifty Classic Ski Descents as it was Originally Intended",
      "url": "https://snowbrains.com/mali-noyes-becomes-first-woman-to-ski-comstock-couloir-completing-one-of-the-fifty-classic-ski-descents-as-it-was-originally-intended/",
      "description": "Pro skier Mali Noyes has completed the Comstock Couloir in British Columbia’s Selkirk Mountains, becoming the first woman to descend the line and only the third skier overall to complete one of the most demanding objectives from The Fifty Classic Ski Descents of North America. What sets the descent apart is not only its rarity, but its fidelity to the […] The post Mali Noyes Becomes First Woman to Ski Comstock Couloir, Completing One of The Fifty Classic Ski Descents as it was Originally Intende",
      "content": "Mali Noyes approaches the Comstock Couloir in British Columbia’s Selkirk Mountains, where she became the first woman to ski the line and only the third person to complete the route as originally described in The Fifty Classic Ski Descents of North America. | Photo: Spencer Harkins Pro skier Mali Noyes has completed the Comstock Couloir in British Columbia’s Selkirk Mountains, becoming the first woman to descend the line and only the third skier overall to complete one of the most demanding objectives from The Fifty Classic Ski Descents of North America . What sets the descent apart is not only its rarity, but its fidelity to the original vision of the route. The Comstock Couloir was first skied by Greg Hill and partners and published in The Fifty Classic Ski Descents of North America as a full-value ski mountaineering objective. Rather than a single couloir lap, the route calls for a long and committing traverse of Dawson Ridge, a summit of Mount Dawson ( the second-highest peak in the",
      "pub_date": "2026-02-04",
      "id": "412281253ee6",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [],
      "approved_date": "2026-02-04"
    },
    {
      "source": "PlanetSKI",
      "title": "World Cup Alpine Ski Racing at Crans-Montana",
      "url": "https://planetski.eu/2026/02/03/world-cup-alpine-ski-racing-at-crans-montana/",
      "description": "PlanetSKI was slopeside at the Swiss resort last weekend for the final World Cup races before the Winter Olympics get underway this week. The post World Cup Alpine Ski Racing at Crans-Montana appeared first on PlanetSKI .",
      "content": "Friday saw some snowfall, but sadly it led to the cancellation of the Women’s Downhill race. It followed several crashes including one to the current leader and favourite for Olympic gold – Lindsey Vonn . It remains to be seen if she can take part in the Olympic Downhill next weekend. Vonn’s Olympic return in doubt after crash The skies cleared overnight with glorious bluebird conditions on the Saturday and Sunday. World Cup racing at Crans-Montana. Image © PlanetSKI Crans-Montana went ahead with the World Cup races after much thought following the fire in a bar in the resort on New Year’s Eve. Over the race weekend it was confirmed that another person had died from their injuries, taking the toll to 41. Death toll from Crans-Montana fire rises to 41 Tributes were paid to those affected and changes were made to the schedule. Crans-Montana remembers The finish area was stripped of its usual vibrant color and advertising. Instead, white and black signs of mourning that read “Our thoughts",
      "pub_date": "2026-02-03",
      "id": "68a3cee612b7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality",
        "safety-incidents",
        "weather-snow"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Snow Industry News",
      "title": "A Taste Of Geneva: The Woodward x Hotel Jerome x Chateau Angelus Comes To Aspen This February",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/a-taste-of-geneva-the-woodward-x-hotel-jerome-x-chateau-angelus-comes-to-aspen-this-february/",
      "content": "Hotel Jerome, Auberge Collection , welcomes the culinary sensibility of one of Europe's most celebrated kitchens to the heart of the Rockies with A Taste of Geneva, an exclusive two-night culinary experience created in collaboration with The Woodward, Auberge Collection , and Château Angelus . Taking place on February 11 and 12, 2026, in the Prospect dining room, the limited-seating dinners unite MICHELIN-starred cuisine and storied Saint-Émilion wines through a shared commitment to craftsmanship, culture, and personal hospitality. Event Details Dates: February 11 and 12, 2026 Reception: 6:30 p.m. Seated Dinner: 7:00 p.m. Location: Prospect at Hotel Jerome Pricing: $595 per person, inclusive Reservations: Available via Resy Seating: One seating per night, 60 guests per evening For two immersive evenings, acclaimed Chef Olivier Jean and Pastry Chef Titouan Claudet travel from the Three-MICHELEN key property, The Woodward in Geneva to Aspen's most legendary hotel, offering guests, in par",
      "pub_date": "2026-02-02",
      "id": "9441dbfaa801",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "The Ski Guru",
      "title": "Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain",
      "url": "https://www.the-ski-guru.com/2026/01/31/winter-mountain-safety-guide/",
      "description": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing.They are also complex, constantly changing environments, where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety, helping skiers, snowshoers and … Continue reading \"Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain\" The post Winter Mountain Safety G",
      "content": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing. They are also complex, constantly changing environments , where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety , helping skiers, snowshoers and Nordic users better understand terrain, conditions and context . It is written for awareness — not blame — and is designed to be read alongside official safety advice and avalanche bulletins. 1. Winter mountain risk goes beyond marked pistes A common misconception is that avalanche danger only concerns off-piste or backcountry skiers. In reality: Avalanches can cross groomed ski pistes Snowshoe routes may pass beneath steep, uncontrolled slopes Cross-country ski tracks can lie within avalanche run-out zones Valley floors, access roads and ice-climbing approaches may all be exposed Several recent accidents in th",
      "pub_date": "2026-01-31",
      "id": "51f89304d637",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "winter-sports"
      ],
      "approved_date": "2026-02-04"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-04"
    }
  ]
}