{
  "updated": "2026-02-02 11:29:57",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "PlanetSKI",
      "title": "Death Toll from Crans-Montana Fire Rises to 41",
      "url": "https://planetski.eu/2026/02/02/death-toll-from-crans-montana-fire-rises-to-41/",
      "description": "A teenager who was injured in the Swiss ski resort on New Year's Eve has died in hospital. It takes the death toll to 41. The post Death Toll from Crans-Montana Fire Rises to 41 appeared first on PlanetSKI .",
      "content": "“An 18-year-old Swiss national died at a hospital in Zurich on January 31 st ,” said the Valais canton’s public prosecutor, Beatrice Pilloud, No further information would be released at this stage, she added. Most of the victims of the fire were young – eight were under the age of 16 – and many are still being treated in hospital for severe burns. 44 patients are being treated abroad. They include: 18 in France 12 in Italy, 8 in Germany 6 in Belgium. The Valais health ministry said that 37 patients were still in Swiss hospitals. Initial findings from an investigation suggest the fire began as sparklers attached to champagne bottles ignited soundproof foam that lined the ceiling of the bar’s basement. Authorities have acknowledged that the bar had not undergone safety checks for five years. The owners of the bar, Jacques and Jessica Moretti, have been accused by authorities of manslaughter by negligence, bodily harm by negligence and arson by negligence. Criminal proceedings have also b",
      "pub_date": "2026-02-02",
      "id": "4a8c7002bfc4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "Snow Industry News",
      "title": "Alta Badia Gets Ready For Skiing In Spring In The Heart Of The Dolomites",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/alta-badia-gets-ready-for-skiing-in-spring-in-the-heart-of-the-dolomites/",
      "content": "In March and April, the days grow longer and weather conditions become particularly favourable for skiing. It is the ideal time to enjoy the mountains and the slopes of Alta Badia, in the heart of the Dolomites, a UNESCO World Heritage site, where excellent snow quality and meticulously groomed slopes ensure a high-level experience even at the end of the season. In recent years, Alta Badia has strengthened its position as a leading destination for alpine skiing, thanks to an offer that combines efficient infrastructure, high-quality services and an internationally recognised food and wine scene. As tradition dictates, the ski season in Alta Badia draws to a close with a series of unmissable events. SOMMELIER ON THE SLOPES The Sommelier on the slopes event aims to promote and further showcase the finest wines of South Tyrol. The final dates of the season are scheduled for 3, 10 and 31 March. The initiative combines unforgettable skiing on the slopes of Alta Badia with the tasting of som",
      "pub_date": "2026-02-02",
      "id": "dc66b70e21a5",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "international",
        "business-investment"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "SnowBrains",
      "title": "Mt. Hood Skibowl, OR, to Suspend Ski and Ride Operations Due to Warm Temperatures and Lack of Snow",
      "url": "https://snowbrains.com/mt-hood-skibowl-or-to-suspend-ski-and-ride-operations-due-to-warm-temperatures-and-lack-of-snow/",
      "description": "Mt. Hood Skibowl, Oregon, is dealing with the reality that Mother Nature has not been cooperating with Western ski resorts this season, and will suspend its ski and ride operations after Sunday night. The temperatures at Mt. Hood Skibowl on Saturday, January 31, were 33 degrees at the base area and 42 at the top. The snow depth at the top […] The post Mt. Hood Skibowl, OR, to Suspend Ski and Ride Operations Due to Warm Temperatures and Lack of Snow appeared first on SnowBrains .",
      "content": "Mt. Hood Skibowl will suspend its ski and ride operations after Sunday night. | Image: Mt. Hood Skibowl Mt. Hood Skibowl , Oregon, is dealing with the reality that Mother Nature has not been cooperating with Western ski resorts this season, and will suspend its ski and ride operations after Sunday night. The temperatures at Mt. Hood Skibowl on Saturday, January 31, were 33 degrees at the base area and 42 at the top. The snow depth at the top of the mountain was 14 inches. “We’ll continue to monitor conditions closely and adjust operations as needed,” Mt. Hood Skibowl said on its website. Related: Too Much Snow? Ski Resorts in Pennsylvania Are Closing for Safety Concerns Weather forecast for Mt. Hood Skibowl. | Mt. Hood Skibowl The ski resort’s tubing operations will remain open and operate normally, according to its website. On Sunday, Mt. Hood Skibowl will be open from 3:00 to 10:00 pm. Mt Hood Skibowl is less than an hour from Portland and has 37 night-lit runs and 71 day runs. It ha",
      "pub_date": "2026-02-01",
      "id": "b920699911fc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents",
        "weather-snow"
      ],
      "approved_date": "2026-02-01"
    },
    {
      "source": "Unofficial Networks",
      "title": "Aggressive Skier Berates Snowboarder After Collision At Vermont Ski Resort",
      "url": "https://unofficialnetworks.com/2026/02/01/aggressive-skier-berates-snowboarder-after-collision-at-vermont-ski-resort/",
      "description": "Skier loses his cool after causing collision at Killington Ski Resort.",
      "content": "Extremely poor behaviour caught on camera at Killington Ski Resort in Vermont where an adult male skier slammed into a snowboarder from behind and then went on a furious tirade victim blaming the innocent snowboarder for causing the collision. “This happened to us at Killington on Tuesday. My friend is the snowboarder. This happened on our first run of the day. Man needed to chill but it was an insane pow day so we didn’t let that kill our vibe. In the moment our friend wasn’t sure what even happened and if there was a possibility he was at fault, in retrospect obviously he did not need to say sorry. We just didn’t want that tantrum to go on.” Killington Freak Out by u/No-Literature-9402 in icecoast This is an extremely clear cut case of the skier violating rules 1 & 2 of The Skier Responsibility Code : Always stay in control. You must be able to stop or avoid people or objects. People ahead or downhill of you have the right-of-way. You must avoid them Kudos to the snowboarder for keep",
      "pub_date": "2026-02-01",
      "id": "4a7cb690bf6e",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "The Ski Guru",
      "title": "Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain",
      "url": "https://www.the-ski-guru.com/2026/01/31/winter-mountain-safety-guide/",
      "description": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing.They are also complex, constantly changing environments, where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety, helping skiers, snowshoers and … Continue reading \"Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain\" The post Winter Mountain Safety G",
      "content": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing. They are also complex, constantly changing environments , where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety , helping skiers, snowshoers and Nordic users better understand terrain, conditions and context . It is written for awareness — not blame — and is designed to be read alongside official safety advice and avalanche bulletins. 1. Winter mountain risk goes beyond marked pistes A common misconception is that avalanche danger only concerns off-piste or backcountry skiers. In reality: Avalanches can cross groomed ski pistes Snowshoe routes may pass beneath steep, uncontrolled slopes Cross-country ski tracks can lie within avalanche run-out zones Valley floors, access roads and ice-climbing approaches may all be exposed Several recent accidents in th",
      "pub_date": "2026-01-31",
      "id": "51f89304d637",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "winter-sports"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "PlanetSKI’s February Snow Report",
      "url": "https://planetski.eu/2026/02/02/planetskis-february-snow-report/",
      "description": "We're in Canada where it has warmed up. In the Alps winter seems to be getting back on course. NEW The post PlanetSKI’s February Snow Report appeared first on PlanetSKI .",
      "content": "Sunday 1st February We start in Canada where the heavy snowfall and cold temperatures of earlier in the season are a distant memory. PlaneSKI’s James Cove has been skiing the resorts around Banff this weekend. On Sunday it was the local ski hill to Banff – Mt Norquay : View this post on Instagram A post shared by PlanetSKI (@planetski.eu) On Saturday he was skiing in Sunshine Village where there had been a few centimeters of snow that freshened things up nicely. Sunshine Village, Canada. Image © PlanetSKI There was even a spot of fresh powder if you know where to look. Sunshine Village, Canada. Image © PlanetSKI At the very top of the resort at 2,398m the temperature remained cold in the wind. Sunshine Village, Canada. Image © PlanetSKI Sunshine Village, Canada. Image © PlanetSKI Over in the Alps it has been generally cloudy with some modest snowfalls, but things are picking up and this week should see heavy snow in the southern Alps. It is due to start late on Monday. Let’s not forget",
      "pub_date": "2026-02-02",
      "id": "b094f158d2c6",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "canada",
        "international"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "Snow Industry News",
      "title": "A Taste Of Geneva: The Woodward x Hotel Jerome x Chateau Angelus Comes To Aspen This February",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/a-taste-of-geneva-the-woodward-x-hotel-jerome-x-chateau-angelus-comes-to-aspen-this-february/",
      "content": "Hotel Jerome, Auberge Collection , welcomes the culinary sensibility of one of Europe's most celebrated kitchens to the heart of the Rockies with A Taste of Geneva, an exclusive two-night culinary experience created in collaboration with The Woodward, Auberge Collection , and Château Angelus . Taking place on February 11 and 12, 2026, in the Prospect dining room, the limited-seating dinners unite MICHELIN-starred cuisine and storied Saint-Émilion wines through a shared commitment to craftsmanship, culture, and personal hospitality. Event Details Dates: February 11 and 12, 2026 Reception: 6:30 p.m. Seated Dinner: 7:00 p.m. Location: Prospect at Hotel Jerome Pricing: $595 per person, inclusive Reservations: Available via Resy Seating: One seating per night, 60 guests per evening For two immersive evenings, acclaimed Chef Olivier Jean and Pastry Chef Titouan Claudet travel from the Three-MICHELEN key property, The Woodward in Geneva to Aspen's most legendary hotel, offering guests, in par",
      "pub_date": "2026-02-02",
      "id": "9441dbfaa801",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "SnowBrains",
      "title": "22-Year-Old Australian Snowboarder Dies After Chairlift Accident at Tsugaike Mountain, Japan",
      "url": "https://snowbrains.com/22-year-old-australian-snowboarder-dies-after-chairlift-accident-at-tsugaike-mountain-japan/",
      "description": "A 22-year-old Australian snowboarder has died following a chairlift accident on Friday, January 30 at Tsugaike Mountain in Japan. Related: 5-Year-Old Boy Dies After Arm Gets Trapped in Magic Carpet Ski Lift at Hokkaido Ski Resort, Japan The incident occurred around 9:15 a.m. on Friday morning when the woman disembarked the Tsuga No. 2 Pair Lift near the summit of […] The post 22-Year-Old Australian Snowboarder Dies After Chairlift Accident at Tsugaike Mountain, Japan appeared first on SnowBrains",
      "content": "Double-chair at Tsugaike Mountain. | Image: Tsugaike Mountain Facebook A 22-year-old Australian snowboarder has died following a chairlift accident on Friday, January 30 at Tsugaike Mountain in Japan. Related: 5-Year-Old Boy Dies After Arm Gets Trapped in Magic Carpet Ski Lift at Hokkaido Ski Resort, Japan The incident occurred around 9:15 a.m. on Friday morning when the woman disembarked the Tsuga No. 2 Pair Lift near the summit of the resort in Otari Village in the Nagano Prefecture. According to a statement by the resort’s CEO Tsuneo Kubo, a strap got caught as she reached the top station. She was dragged around the top station by the lift and was left hanging in midair at which point lift attendants hit the emergency stop. Resort staff alerted emergency services but according to the local police, the woman—identified as Brooke Day—was in cardiac arrest. She was transported to hospital but later died. Trail map of Tsugaike Mountain. | Image: Tsugaike Mountain In a formal statement r",
      "pub_date": "2026-02-01",
      "id": "56b6d9651d6d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "international",
        "business-investment"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "Unofficial Networks",
      "title": "Retired 12-Year-Old Avalanche Dog Still Gets To Run The Slopes of This Montana Ski Resort",
      "url": "https://unofficialnetworks.com/2026/02/01/retired-12-year-old-avalanche-dog-still-gets-to-run-the-slopes-of-this-montana-ski-resort/",
      "description": "Sochi Fruitbear living out a dreamy retired avalanche rescue dog life, taking chairlift laps and otter sliding down her favorite runs.",
      "content": "Delightful video from the slopes of Teton Pass Ski Resort in Montana where a 12-year-old English Labrador named Sochi Fruitbear is enjoying her retirement after a career as an avalanche rescue dog: “She is living out a dreamy retired avalanche rescue dog life, taking chairlift laps and otter sliding down her favorite runs. She is 12 years old and still healthy and able. She’s as friendly as they get. Say “hi” if you see her and no, she doesn’t need the other half of your cheeseburger” View this post on Instagram A post shared by Teton Pass Ski Area (@skitetonmt) Sochi may not be an active avalanche dog any longer but she is an incredible ambassador for the mountain and the essence of loving your place of work. If you see her on the hill say hello but don’t go giving her any cheeseburgers. View this post on Instagram Categories: Uncategorized",
      "pub_date": "2026-02-01",
      "id": "9e933c2de8a3",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "The Ski Guru",
      "title": "Swiss “Ultra-Light” Trains Proposed for the Aosta–Pré-Saint-Didier Railway",
      "url": "https://www.the-ski-guru.com/2026/01/31/swiss-ultra-light-trains-aosta-pre-saint-didier/",
      "description": "The post Swiss “Ultra-Light” Trains Proposed for the Aosta–Pré-Saint-Didier Railway appeared first on The-Ski-Guru .",
      "content": "The long-closed Aosta–Pré-Saint-Didier railway may be back in the spotlight after a private “Swiss” proposal suggested reactivating the line with ultra-light panoramic trains and a concession-style operating model. The 31 km line (serving communities between Aosta and Pré-Saint-Didier , close to Courmayeur ) has been suspended since late 2015 and remains owned by Rete Ferroviaria Italiana (RFI) , with the Region signalling interest in acquiring the infrastructure to regain local control. What is the “Swiss solution” being talked about? According to rail-industry reporting, the initiative was presented by architect Fernando De Simone on behalf of the Swiss company Intamin Transportation . The idea is to relaunch services using lighter, slower, panoramic trains , designed to reduce stress on an infrastructure that would struggle with heavier rolling stock. Ultra-light panoramic trains : around 120 seats , with a reported mass of roughly 35 tonnes . Speed capped : the proposal references ",
      "pub_date": "2026-01-31",
      "id": "b55dd491035f",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "transportation",
      "secondary_categories": [
        "safety-incidents"
      ],
      "approved_date": "2026-02-01"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "Spring Events in Les Menuires",
      "url": "https://planetski.eu/2026/02/02/spring-events-in-les-menuires/",
      "description": "The high altitude French resort in Les3Vallees has released details of its two end-of-season events. At one end of the spectrum its the La Masse sporting event and at the other it's Yoga. NEW The post Spring Events in Les Menuires appeared first on PlanetSKI .",
      "content": "Completely La Masse – 4th edition – Saturday 21st March Competitors of all disciplines will take to the slopes from La Pointe de la Masse at 2,804m for a descent of more than 5 km, encountering all sorts of obstacles and surprise entertainment along the way. Choose from two courses: The ‘Barjo’ run: for the daring, a solo descent (entries – born in 2011 or earlie The ‘Mollo’ run: a more gentle descent in teams of three (entries – born in 2017 or earlier) The village of La Croisette sees competitors and spectators at the foot of the slopes in Les Menuires with crazy costumes, pop up food stalls and a prize giving ceremony to award €6,000 prize money. There are holidays to Les Menuires to be won, winter sports equipment plus awards for the best costume and lots of give aways. See here for further details: https://lesmenuires.com/en/madness-masse Les Menuires, France. Image c/o Les Menuires tourist office. YOGISKI – Ski, Yoga and Nature – 10-16 th April Yogiski returns for its 10th year i",
      "pub_date": "2026-02-02",
      "id": "3cebde54af5f",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-02-02"
    },
    {
      "source": "SnowBrains",
      "title": "Ryan Cochran-Siegle Claims Downhill Podium in Crans-Montana, Switzerland",
      "url": "https://snowbrains.com/ryan-cochran-siegle-claims-downhill-podium-in-crans-montana-switzerland/",
      "description": "The final men’s World Cup downhill before the Olympic Games delivered exactly what makes this sport so special: sunshine, speed, and excitement to the very end. On Sunday, February 1, Team USA’s Ryan Cochran-Siegle claimed his second podium of the season with a third place in Crans-Montana, Switzerland. Related: Ryan Cochran-Siegle Soars to First U.S. Podium in Beaver Creek, CO, […] The post Ryan Cochran-Siegle Claims Downhill Podium in Crans-Montana, Switzerland appeared first on SnowBrains .",
      "content": "The Crans-Montana downhill podium: Franjo von Allmen 1st, Dominik Paris 2nd, Ryan Cochran-Siegle 3rd. | Image: FIS Alpine The final men’s World Cup downhill before the Olympic Games delivered exactly what makes this sport so special: sunshine, speed, and excitement to the very end. On Sunday, February 1, Team USA’s Ryan Cochran-Siegle claimed his second podium of the season with a third place in Crans-Montana, Switzerland. Related: Ryan Cochran-Siegle Soars to First U.S. Podium in Beaver Creek, CO, in 11 Years At the top of the standings, Franjo von Allmen from Switzerland proved in a league of his own. The Swiss skier defended his Crans-Montana downhill title in emphatic fashion, stopping the clock at 1:55.00 on the dot, to claim a commanding home victory, 0.65 seconds ahead of Italy’s Dominik Paris, while Cochran-Siegle rounded out the podium in third, 0.05 seconds behind Paris. After Friday’s challenging downhill day for the women, the sun broke through in Crans-Montana for the men.",
      "pub_date": "2026-02-01",
      "id": "212126451a89",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-02-02"
    },
    {
      "source": "Unofficial Networks",
      "title": "One Hospitalized, Dozens Rescued After Chairlift Malfunction in New Hampshire",
      "url": "https://unofficialnetworks.com/2026/02/01/one-hospitalized-dozens-rescued-after-chairlift-malfunction-in-new-hampshire/",
      "description": "Dozens of people were rescued, including one person who had to be hospitalized, after a chairlift at Dartmouth Skiway",
      "content": "Dozens of people were rescued, including one person who had to be hospitalized, after a chairlift at Dartmouth Skiway in New Hampshire malfunctioned in frigid conditions. Local firefighters responded to the scene and worked with Dartmouth Ski Patrol to execute a technical rope rescue. In total 59 guests were evacuated in the 90 minute operation. Emergency crews evaluated all of the skiers for cold-weather injuries and everyone was brought everyone to the main lodge to warm up. One person was ultimately taken to a local hospital for treatment. The cause of the chairlift malfunction has not been specified. Lyme Fire Statement: Lyme Fire and EMS responded along with Hanover and Thetford Fire and Lyme and Orford PD to the Dartmouth Skiway to assist the Dartmouth Ski Patrol with a lift malfunction requiring extrication. The Dartmouth Ski Patrol identified the number of individuals requiring extrication from the chair lift and along with technical rescue team members from Lyme, Hanover and T",
      "pub_date": "2026-02-01",
      "id": "9a7db769cb2a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "hospitality"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "Snow Industry News",
      "title": "ASSQ Encourages Skiers To Adopt The Right Habits In Ski Slope Safety Month",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/assq-encourages-skiers-to-adopt-the-right-habits-in-ski-slope-safety-month/",
      "content": "Thanks to an exceptional start to the season, marked by abundant snowfall, remarkable skiing conditions, and high visitor numbers at ski resorts, more Quebecers than ever are enjoying winter. In this context, the Quebec Ski Areas Association (ASSQ) wishes to remind everyone that a successful winter also depends on responsible and safe behavior in the mountains. In collaboration with the Ministry of Education, the ASSQ is launching the 3rd edition of the \" Good skier, good player \" awareness campaign , which aims to encourage skiers and snowboarders, regardless of their level of experience, to adopt the right reflexes on the slopes and to use ski lifts safely, so that everyone can have a positive experience at the resort. To effectively reach all audiences, the ASSQ is deploying a dynamic campaign across multiple platforms, combining digital content, social media presence, and interactive initiatives. The ASSQ also invites the public to visit the Safety page of the maneige.ski website t",
      "pub_date": "2026-01-30",
      "id": "cab1b9153586",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "safety-incidents",
        "weather-snow",
        "resort-operations"
      ],
      "approved_date": "2026-01-30"
    },
    {
      "source": "The Ski Guru",
      "title": "French Alps Avalanche Danger: 48-Hour Roundup & Current Risk by Massif",
      "url": "https://www.the-ski-guru.com/2026/01/30/french-alps-avalanche-danger-update/",
      "description": "Avalanche activity has remained elevated across several French Alpine massifs over the past 48 hours, with confirmed incidents, multiple rescue checks, and continued warnings from Météo-France. Below is a clear roundup of what has happened, followed by current avalanche danger by massif and direct links to the official bulletins skiers should consult before heading into the mountains. 48-Hour Avalanche … Continue reading \"French Alps Avalanche Danger: 48-Hour Roundup & Current Risk by Massif\" Th",
      "content": "Avalanche activity has remained elevated across several French Alpine massifs over the past 48 hours, with confirmed incidents, multiple rescue checks, and continued warnings from Météo-France. Below is a clear roundup of what has happened, followed by current avalanche danger by massif and direct links to the official bulletins skiers should consult before heading into the mountains. 48-Hour Avalanche Roundup (28–29 January) Les Deux Alpes (Isère – Oisans) On Thursday 29 January , an off-piste avalanche occurred in the La Fée sector at Les Deux Alpes. A 59-year-old skier was recovered and taken to hospital in critical condition . Regional reporting indicates the skier suffered a cardiac arrest, was resuscitated on scene, and transferred to hospital in Grenoble. The incident occurred mid-morning, around 2,500 m , in a well-known off-piste area frequently accessed from the ski domain. Les Deux Alpes, near to St Christoph-en-Oisans. Photo: Toa Heftiba/Unsplash. French Alps Avalanche Dang",
      "pub_date": "2026-01-30",
      "id": "91cc7e98a26a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}