{
  "updated": "2025-12-04 17:55:49",
  "total_articles": 17,
  "articles": [
    {
      "source": "Unofficial Networks",
      "title": "West Virginia’s Ski Season Kicks Off On Thursday, December 4th",
      "url": "https://unofficialnetworks.com/2025/12/03/west-virginia-ski-season-starts/",
      "description": "Three West Virginia ski resorts are set to open up for the 2025/2026 winter season this week, the first of which opens Thursday.",
      "content": "Three West Virginia ski resorts are set to open up for the 2025/2026 winter season this week, the first of which opens tomorrow, Thursday, December 4th. View this post on Instagram A post shared by Timberline Mountain (@timberlinemountain) Timberline Mountain in Davis is opening first, with snowmaking teams working hard to get the area’s most popular terrain ready for the season. It’s not yet clear exactly what terrain will be open tomorrow, though more and more terrain will gradually open following the first day of the season. Between December 4th and December 11th, “Bonus Day” lift tickets will cost just $69 and rentals will cost just $29 per day. Snowshoe Mountain in Snowshoe will open up on Friday, December 5th, with the mountain operations team similarly working very hard to take advantage of cold weather for snowmaking. Opening day is expected to include terrain in the central Basin area with a terrain park setup in Progression Park and potentially a blue or two. Up until Decembe",
      "pub_date": "Wed, 03 Dec 2025 16:21:37 +0000",
      "id": "a0f40510a8ae",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Don’t Miss Out On The Best Value For Your Ski Season At Gore Mountain",
      "url": "https://unofficialnetworks.com/2025/12/03/dont-miss-out-on-the-best-value-for-your-ski-season-at-gore-mountain/",
      "description": "Heads up to all you New York skiers and snowboarders, this is your last day to snag a season pass at Gore Mountain before their final price jump so secure yours before midnight to get the best possible deal. Passholders not only get unlimited lift access at Gore, they can also ski Whiteface and Belleayre […]",
      "content": "Heads up to all you New York skiers and snowboarders, this is your last day to snag a season pass at Gore Mountain before their final price jump so secure yours before midnight to get the best possible deal. Passholders not only get unlimited lift access at Gore, they can also ski Whiteface and Belleayre anytime they want. In addition passholders get 2 free lift tickets to share, discounted on-mountain amenities, and many more perks. “The final price deadline for 2025/26 Season Passes is today, December 3rd. Don’t miss out on the best value for your ski season at Gore! After today, 2025/26 Season Passes are at their peak season price. Don’t miss out on your winter!” Gore got 10 inches of natural snow this week and the resort has been opening trails left and right (10 trails now available) . Cold temps have allowed snowmakers to help bolster coverage and it looks like they more terrain will open in days to come. If you plan on skiing Gore this winter, we highly recommend you don’t dawdl",
      "pub_date": "Wed, 03 Dec 2025 13:22:27 +0000",
      "id": "084f437aa131",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Like Willy Wonka’s Everlasting Gobstopper, Mount Bohemia’s $99 Season Pass Is Simply Unbelievable",
      "url": "https://unofficialnetworks.com/2025/12/03/mb4-the-ski-pass-that-shouldnt-be-99-but-somehow-is/",
      "description": "Michigan's Mount Bohemia $99 season ski pass is simply incredible.",
      "content": "Author: Stacy Pokrywka While almost the entire ski resort industry is moving toward big-box corporate entities and mega-passes, Mount Bohemia in Michigan’s Upper Peninsula is bucking the trend with its $99 season pass . Mount Bohemia is keeping skiing and snowboarding wild, with the most unique vibe I’ve ever experienced. Would a $99 season pass get you stoked for the season? Yeah, me too. But how stoked would you be if I told you the $99 pass also comes with reciprocal days at hills and mountains all over the U.S. and Canada, full access to a legit outdoor Nordic Spa, and gnarly tree skiing with “no beginners allowed” ? Sounds amazing, right? It is. If you haven’t heard about Mount Bohemia, let me give you the lowdown on this ridiculously fun mountain and all the season pass perks. Sitting at the northernmost tip of Michigan’s Upper Peninsula and surrounded on three sides by Lake Superior, Boho (as the locals call it) gets more than 275 inches of snow annually thanks to lake-effect st",
      "pub_date": "Wed, 03 Dec 2025 11:52:00 +0000",
      "id": "3ca54ce2c7b1",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Wishing Klaus Obermeyer A Happy 106th Birthday!",
      "url": "https://unofficialnetworks.com/2025/12/02/wishing-klaus-obermeyer-a-happy-106th-birthday/",
      "description": "Huge shoutout to Klaus Obermeyer who turned 106th today. Klaus was born in Germany in 1919 and witnessed the rise of Nazi fascism. He escaped Germany into Switzerland on skis. During the escape he was shot and fell off a cliff breaking his leg. Klaus managed to get out of the mountains alive and was […]",
      "content": "Huge shoutout to Klaus Obermeyer who turned 106th today. Klaus was born in Germany in 1919 and witnessed the rise of Nazi fascism. He escaped Germany into Switzerland on skis. During the escape he was shot and fell off a cliff breaking his leg. Klaus managed to get out of the mountains alive and was found by a sympathetic nurse who hid him in a Swiss hospital until the WW2 was over. Klaus then moved to Aspen in 1947 where he started Sport Obermeyer . During his first year as a ski instructor at Aspen, Klaus noticed all of the inadequacies of his students’ gear and headed to the drawing table. Klaus created nearly a dozen ski industry firsts, including quilted down parkas turtlenecks, dual construction ski boots, pre-shaped gloves, mirrored sunglasses, and high altitude sunscreen. Certified legend. We wish very happy 106th birthday! Categories: Skiing",
      "pub_date": "Tue, 02 Dec 2025 22:47:06 +0000",
      "id": "ccc5274418fb",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "The Best Upgrades At Utah Ski Resorts For The 2025-26 Season",
      "url": "https://unofficialnetworks.com/2025/12/02/utah-ski-resort-projects-2025/",
      "description": "From Deer Valley's expansion to Sundance's new inn, we've compiled a recap of the biggest improvements at Utah ski resorts.",
      "content": "Utah — While the home to the Greatest Snow on Earth is off to a slow start this winter, that doesn’t m ean it won’t catch its stride eventually. Utah is known for its snow, varied terrain, and recent infrastructure improvements. This ski season in Utah is marked by various transformative projects that will strengthen its appeal to guests and increase its readiness for the 2034 Olympics. With ski season officially underway in the Beehive State, it’s a good time to look at what’s new at Utah ski resorts. Here’s a rundown of the best improvements at Utah ski resorts for the 2025-26 season. Alta Bids Farewell To Their Longest Tenured Avalanche Dog Honorable Mentions Alta completed its Supreme lift realignment project, improving its reliability in the short and long term. Other upgrades include new Wyssen towers, a regrade of the High Traverse, and work has begun on expanding the Albion Base Lodge. Beaver Mountain completed its multi-year base lodge project. The new 26,000-square-foot Marge",
      "pub_date": "Tue, 02 Dec 2025 22:20:46 +0000",
      "id": "e0a7837b6d2c",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Survivalist Feels Honored To Come Face-To-Face With A Mountain Lion",
      "url": "https://unofficialnetworks.com/2025/12/02/mountain-lion-survivalist-encounter/",
      "description": "When wilderness skills instructor Callie Russell came face-to-face with a mountain lion in a tree, she explained her gratitude.",
      "content": "There are an estimated 20,000 to 40,000 mountain lions still living in the United States, primarily living in the western half of the country. Human population growth, poaching, hunting, development, pollution, and habitat loss all threaten their numbers. Spotting one in the wild is a rare occurrence, and while they might seem intimidating, many people are honored to see a mountain lion in the wild. Wilderness skills instructor Callie Russell , who participate on Season 7 of the the show Alone , is one of those people. When she came face-to-face with a mountain lion in a tree, she explained how much gratitude she had for the moment. “ There was a time, long ago, when I was afraid of the large wild predators, mostly when I slept in wild places by myself, with no tent, or anything separating me from them, over the years, I have had several close encounters with mountain lions, bears, and wolves, and now I do not have any fear for them, just deep reverence and respect. It feels like a gif",
      "pub_date": "Tue, 02 Dec 2025 20:48:29 +0000",
      "id": "80677118b574",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "These Six North American Ski Resorts Are Having Great Starts To Their Seasons",
      "url": "https://unofficialnetworks.com/2025/12/02/north-american-ski-resorts-december/",
      "description": "While many ski regions in the US & Canada struck out last month, these six ski resorts had a great November.",
      "content": "This past November will mostly be remembered for its snowless scenes in mountainous locations across North America. Popular ski resorts in Colorado, Tahoe, and Utah had little snow, resulting in many jarring images and videos. However, it wasn’t all bad for North America’s ski industry. Snow arrived in Canada and parts of the Northeast early, allowing for some memorable starts to the season. Here are six ski resorts in North America that have great starts to their seasons. Banff Sunshine Village : If you’re looking to go on a ski vacation soon and have access to lots of terrain, Banff is the place to go. Banff Sunshine Village was the first to open for the season in Canada, thanks to lots of natural stuff. Currently, the ski resort already has 78 trails and 11 lifts open. So far this ski season, Sunshine Village has received 200 centimeters (6 feet 7 inches) of snow at its summit. Sunshine Village, Canada Lake Louise Ski Resort : Another thriving Banff ski resort is Lake Louise. Curren",
      "pub_date": "Tue, 02 Dec 2025 19:59:01 +0000",
      "id": "582688c48baf",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "New Alberta Law Could Help Revive Famous Lost Ski Resort",
      "url": "https://unofficialnetworks.com/2025/12/02/fortress-mountain-revival-effort/",
      "description": "Perhaps the most famous lost ski resort in Canada could be on the comeback trail thanks to a new Alberta law.",
      "content": "Alberta — After years in limbo, Fortress Mountain is shaping up for a comeback. The question is how long it may take. Rocky Mountain Outlook reported last month that the current owners of Fortress Mountain Resort are working on a plan for the revival of the ski resort. The work is still in the early phases, and more approvals will be needed before work can begin. These new efforts are thanks to the All-Season Resorts Act. Passed in 2024, this Alberta law helps make it easier to build or revive a ski resort, such as Fortress Mountain. This is part of Alberta’s plan to increase its tourism revenue from nearly CAD$14.5 billion in 2025 to CAD$25 billion by 2035. Andrew Boitchenko, the Tourism and Sport Minister of Alberta, said the following about the proposal and the All-Season Resorts Act: “The regulatory framework for all-season resorts is still being finalized and no land has been designated at this time. Applications for designation will open once these foundational elements are in pl",
      "pub_date": "Tue, 02 Dec 2025 17:35:35 +0000",
      "id": "53f1543ccc25",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "Unofficial Networks",
      "title": "Jackson Hole Mountain Resort Kicks Off 60th Anniversary Winter Season On Thursday",
      "url": "https://unofficialnetworks.com/2025/12/02/jackson-hole-opening-day/",
      "description": "Jackson Hole Mountain Resort is set to kick off their 60th anniversary winter season this Thursday, December 4th.",
      "content": "Jackson Hole Mountain Resort is set to kick off their 60th anniversary winter season this Thursday, December 4th, after delaying their opening day late last month. Continuous snowmaking efforts, 65 inches of snowfall at the summit, and 34 inches of snowfall mid-mountain have allowed for coverage across a significant portion of the north side of the resort. Three lifts will be open for the first day of the season, including Teewinot, Après Vous, and the Sweetwater Gondola up to the Mid-Station. Beginner and intermediate terrain will be available, though early season conditions and hazards will exist. View this post on Instagram A post shared by Jackson Hole Mountain Resort (@jacksonhole) The resort is hoping to announce addition terrain and lift openings heading into the weekend of December 6th-7th, or sooner if the conditions cooperate. The 2025-2026 winter season, the resort’s 60th Anniversary, will run until April 12th, lasting a total of 129 days. Several celebratory events will run",
      "pub_date": "Tue, 02 Dec 2025 16:53:19 +0000",
      "id": "1dca48659029",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Mount Bohemia’s $99 Season Pass Adds Unlimited Skiing at Mont Edouard, QC",
      "url": "https://snowbrains.com/mount-bohemias-99-season-pass-adds-unlimited-skiing-at-mont-edouard-qc/",
      "description": "Yes, the season pass that already gets you skiing all season long at Mount Bohemia, Michigan, and free days at 29 other ski resorts across the United States now adds unlimited skiing at Mont Edouard. Literally, your $99 season pass now gets you two ski resorts for a fraction of the price of one normal East Coast ski resort. Whether […] The post Mount Bohemia’s $99 Season Pass Adds Unlimited Skiing at Mont Edouard, QC appeared first on SnowBrains .",
      "content": "Mont Edouard cleans out its glades each year, and it shows. | Photo: Mont Edouard Yes, the season pass that already gets you skiing all season long at Mount Bohemia , Michigan, and free days at 29 other ski resorts across the United States now adds unlimited skiing at Mont Edouard . Literally, your $99 season pass now gets you two ski resorts for a fraction of the price of one normal East Coast ski resort. Whether you go to Bohemia or Edouard, your pass will pay for itself in just two days. Related: Mount Bohemia, MI, Offering Lifetime Season Pass for $1,449 Good for 75 Years Located roughly 2.5 hours north of Quebec City, Mont Edouard is an undiscovered gem in the remote Saguenay Fjord region of Quebec. Located in the French village of Lanse-St-Jean (1200 inhabitants) near some of the most dramatic Fjords of Quebec, the closest American cities are Upstate New York, less than seven hours away. Built in the 1990s with two chairlifts, Mont Edouard has some of the best in-bounds backcount",
      "pub_date": "Thu, 04 Dec 2025 23:00:46 +0000",
      "id": "feb0a2f4acd1",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Grand Targhee, WY, Sets Opening Day for Friday, December 5, With 2 Lifts and Early-Season Deals",
      "url": "https://snowbrains.com/grand-targhee-wy-sets-opening-day-for-friday-december-5-with-2-lifts-and-early-season-deals/",
      "description": "Grand Targhee Resort will open for the 2025-26 winter season on Friday, December 5, with Shoshone and Huckleberry scheduled to spin for guests. The resort noted on social media that early-season conditions remain, and visitors are encouraged to respect all closures and ski and ride cautiously. “Snow is heading our way this weekend! Don’t forget to carpool and ride the […] The post Grand Targhee, WY, Sets Opening Day for Friday, December 5, With 2 Lifts and Early-Season Deals appeared first on Sn",
      "content": "Grand Targhee Resort will open for the 2025-26 season on Friday, December 5. | Photo Credit: Grand Targhee Resort Grand Targhee Resort will open for the 2025-26 winter season on Friday, December 5, with Shoshone and Huckleberry scheduled to spin for guests. The resort noted on social media that early-season conditions remain, and visitors are encouraged to respect all closures and ski and ride cautiously. “Snow is heading our way this weekend! Don’t forget to carpool and ride the shuttle!” – Grand Targhee To mark the start of the season, The Powder Cache is offering a buy-one-entrée, get-one-free deal through December 11 . Live music returns to The Trap this weekend as well, with Henry Pepin and The Moguls performing Friday and Saturday. Snow is expected to arrive over the weekend, and the resort is reminding guests to carpool or use shuttle services as conditions improve. Targhee also has more than just skiing and snowboarding. Guests can unwind with on-mountain massage services from ",
      "pub_date": "Thu, 04 Dec 2025 21:03:46 +0000",
      "id": "45b6097abb65",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Tahoe Fund Launches $10K Challenge to Improve Backcountry Access for All",
      "url": "https://snowbrains.com/tahoe-fund-launches-10k-challenge-to-improve-backcountry-access-for-all/",
      "description": "INCLINE VILLAGE, Nev. (Dec. 1, 2025) – The Tahoe region offers some of the best winter outdoor recreation in the world, but parking availability, snow removal, and limited trailheads often make the backcountry difficult to access. To help the Tahoe Backcountry Alliance tackle these issues, the Tahoe Fund is launching a new $10k matching challenge to the community. The first 100 […] The post Tahoe Fund Launches $10K Challenge to Improve Backcountry Access for All appeared first on SnowBrains .",
      "content": "The first 100 people to donate $35 or more by December 31, 2025, will unlock a $10,000 gift to Tahoe Backcountry Alliance (TBA) in celebration of their 10th anniversary. | Photo: Tahoe Fund INCLINE VILLAGE, Nev. (Dec. 1, 2025) – The Tahoe region offers some of the best winter outdoor recreation in the world, but parking availability, snow removal, and limited trailheads often make the backcountry difficult to access. To help the Tahoe Backcountry Alliance tackle these issues, the Tahoe Fund is launching a new $10k matching challenge to the community. The first 100 people to donate $35 or more by December 31, 2025, will unlock a $10,000 gift to Tahoe Backcountry Alliance (TBA) in celebration of their 10th anniversary. Donors to the challenge will also receive a TBA membership that corresponds to their gift level. Membership tiers are $35, $150, or $500, and include the following benefits: Every TBA member will receive a 3-month free trial with onX with 20% off an onX annual membership i",
      "pub_date": "Thu, 04 Dec 2025 19:37:12 +0000",
      "id": "38d286a722b6",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Top 9 Snowfall Totals of the Season So Far on the East Coast",
      "url": "https://snowbrains.com/top-9-snowfall-totals-of-the-season-so-far-on-the-east-coast/",
      "description": "It is no secret that when it comes to skiing, the East Coast has traditionally played the role of overlooked little sibling when compared to the towering mountain ranges from the Rockies westward. At the beginning of this season, however, as mountains in the Rockies and Cascades push back opening days while waiting for snow, parts of the Northeast have […] The post Top 9 Snowfall Totals of the Season So Far on the East Coast appeared first on SnowBrains .",
      "content": "Seasonal snowfall totals in the United States. Image: National Oceanic and Atmospheric Administration It is no secret that when it comes to skiing, the East Coast has traditionally played the role of overlooked little sibling when compared to the towering mountain ranges from the Rockies westward. At the beginning of this season, however, as mountains in the Rockies and Cascades push back opening days while waiting for snow, parts of the Northeast have enjoyed a historic start, with some snowfall totals pushing resorts into mid-season form in early December. The factors that may have led to this unprecedented start are as diverse as the regions represented on this list, and vary depending on who you talk to. Some give credit to the weak La Niña pattern established to start this winter—pushing the jet stream further north than usual and encouraging colder, wetter storms. Many lean into the logic of the lake effect : storms picking up moisture as they cross the relatively warm Great Lake",
      "pub_date": "Thu, 04 Dec 2025 19:19:21 +0000",
      "id": "77d5e48b1356",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 8,
        "quality": 7,
        "overall": 8,
        "reason": "This article provides timely and relevant information about snowfall totals on the East Coast, which is important for ski resort operations and the ski industry. The reporting is informative, though it could be more in-depth in some areas. Overall, this article would be a valuable addition to a ski business news feed."
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "UDOT Backs Bus Expansion and Winter Tolls, Rejects Gondola Plan for Big Cottonwood Canyon, UT",
      "url": "https://snowbrains.com/udot-backs-bus-expansion-and-winter-tolls-rejects-gondola-plan-for-big-cottonwood-canyon-ut-2/",
      "description": "The Cottonwood Canyons in Utah are infamous for their infuriating red snake accessing the mountains. The Utah Department of Transportation has long been constructing proposals to mend this error with no prevail. The 2022 gondola proposal up Little Cottonwood Canyon invigorated the public and UDOT received the most responses on any proposal ever, totalling 50,000; 35,000 against the proposal and […] The post UDOT Backs Bus Expansion and Winter Tolls, Rejects Gondola Plan for Big Cottonwood Canyon",
      "content": "Big Cottonwood has been plagued by heavy ski traffic during the past several winters and the Utah Department of Transportation is strategizing for a solution. | Photo courtesy KUTV The Cottonwood Canyons in Utah are infamous for their infuriating red snake accessing the mountains. The Utah Department of Transportation has long been constructing proposals to mend this error with no prevail. The 2022 gondola proposal up Little Cottonwood Canyon invigorated the public and UDOT received the most responses on any proposal ever, totalling 50,000; 35,000 against the proposal and 15,000 for it. Along with public reaction, three companies have sued to stop construction of the gondola which has stalled the enactment of the other resolutions such as busses and tolls. Big Cottonwood Canyon suffers from this same traffic problem, and for both practical as well as public relation reasoning, they are proposing significantly increased bus service as the Big Cottonwood Canyon solution . Related: Will T",
      "pub_date": "Thu, 04 Dec 2025 19:19:03 +0000",
      "id": "82792bdc60bf",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 9,
        "quality": 7,
        "overall": 8,
        "reason": "This article provides timely and relevant information about a major transportation proposal affecting ski resort access in a key Utah ski destination. The reporting provides good context and details on the UDOT plan and the public reaction, though the writing could be tightened in places. Overall, this is a valuable news item for a ski industry audience."
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Palisades Tahoe, CA, Unveils Apex Club, a New $12,000 Membership Offering Priority Access and Private Lounges",
      "url": "https://snowbrains.com/palisades-tahoe-ca-unveils-apex-club-a-new-12000-membership-offering-priority-access-and-private-lounges/",
      "description": "Palisades Tahoe is elevating its premium guest offerings this winter with the launch of the Apex Club, a limited-availability membership designed to streamline every part of a ski day at the resort. The program debuts for the 2025-26 season with just 200 memberships, marking one of the most exclusive access tiers ever introduced at the California resort. Related: Top 10 […] The post Palisades Tahoe, CA, Unveils Apex Club, a New $12,000 Membership Offering Priority Access and Private Lounges appe",
      "content": "A digital rendering shows the new Apex Club at Palisades Tahoe. | Photo: Palisades Tahoe Palisades Tahoe is elevating its premium guest offerings this winter with the launch of the Apex Club, a limited-availability membership designed to streamline every part of a ski day at the resort. The program debuts for the 2025-26 season with just 200 memberships, marking one of the most exclusive access tiers ever introduced at the California resort. Related: Top 10 Memorable On-Mountain Dining Experiences in the West In a release shared by the resort, details show that the club centers around two private lounges with one at the base in Olympic Valley and another mid-mountain at Gold Coast, along with priority lift lanes, concierge support, and reserved parking close to the lifts . Memberships start at $12,000 for those who enroll before December 11 and remain valid from December 12, 2025, through April 12, 2026. The Apex Lounge acts as the program’s main hub, offering members a private space f",
      "pub_date": "Thu, 04 Dec 2025 18:33:38 +0000",
      "id": "2afccc4c4995",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides relevant information about a new premium membership offering at a major ski resort, Palisades Tahoe. The news is timely and the reporting is relatively balanced, though it may lack some depth in analysis. Overall, this is a newsworthy item that would be a good fit for a ski industry news feed."
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "SnowBrains Forecast: 3-4 Feet of Dense Snow For the PNW This Weekend",
      "url": "https://snowbrains.com/snowbrains-forecast-3-4-feet-of-dense-snow-for-the-pnw-this-weekend/",
      "description": "A robust and active pattern kicks off with a series of storms delivering heavy precipitation and fluctuating snow levels to the Pacific Northwest. A warm front Thursday transitions into a colder system by Friday night, offering a window of quality snowfall on Saturday before a potent atmospheric river threatens to scour the mountains with heavy rain and high-elevation snow early next […] The post SnowBrains Forecast: 3-4 Feet of Dense Snow For the PNW This Weekend appeared first on SnowBrains .",
      "content": "Credit: WeatherBell A robust and active pattern kicks off with a series of storms delivering heavy precipitation and fluctuating snow levels to the Pacific Northwest. A warm front Thursday transitions into a colder system by Friday night, offering a window of quality snowfall on Saturday before a potent atmospheric river threatens to scour the mountains with heavy rain and high-elevation snow early next week. A warm front is currently pushing into the region, bringing an initial round of precipitation that will transition into a stronger, colder system by Friday night. Thursday sees high snow levels, hovering around 6,000–8,000 feet in Oregon and 3,500–5,000 feet in Washington, meaning precipitation will likely start as rain or heavy, wet snow at most base areas. Winds will be a significant factor, particularly at higher elevations like Timberline and Bachelor, where gusts could scream upwards of 70–80 mph, likely impacting lift operations. By Friday night, a cold front sweeps through,",
      "pub_date": "Thu, 04 Dec 2025 17:38:26 +0000",
      "id": "39d5ee1be1dc",
      "score": 8,
      "score_details": {
        "relevance": 9,
        "news_value": 8,
        "quality": 8,
        "overall": 8,
        "reason": "This article provides timely and relevant information for ski resort operations, with detailed weather forecasting and potential impacts on snowfall and base area conditions. The reporting is informative and data-driven, rather than clickbait or fluff."
      },
      "approved_date": "2025-12-04"
    },
    {
      "source": "SnowBrains",
      "title": "Snowbasin, UT, to Open For Season Friday, December 5, with Top-to-Bottom Skiing",
      "url": "https://snowbrains.com/snowbasin-ut-to-open-for-season-friday-december-5-with-top-to-bottom-skiing/",
      "description": "Snowbasin will open for its 85th season on Friday, December 5. America’s Number 1 ranked ski resort for the second consecutive year by USA Today will debut with top-to-bottom skiing and 2,500’ of vertical terrain. Three lifts will be available including Needles Gondola, Middle Bowl Express and Littlecat Express, with additional lifts planned to open soon. Available trails will be […] The post Snowbasin, UT, to Open For Season Friday, December 5, with Top-to-Bottom Skiing appeared first on SnowBr",
      "content": "Snowbasin opens for its 85th skiing on Friday, December 5, with top-to-bottom skiing. | Photo: Snowbasin Snowbasin will open for its 85th season on Friday, December 5. America’s Number 1 ranked ski resort for the second consecutive year by USA Today will debut with top-to-bottom skiing and 2,500’ of vertical terrain. Three lifts will be available including Needles Gondola, Middle Bowl Express and Littlecat Express, with additional lifts planned to open soon. Available trails will be indicated on Snowbasin’s Mountain Report by Friday, but will include Sweet Revenge, Bullwinkle, the newly expanded Bear Hollow, School Hill, Snowshoe and more. A small terrain park will be available at the base of the resort on Littlecat trail. Opening Day festivities include DJ Richie T on Friday and great prizes. Snowbasin is giving away 850 free cookies to celebrate its 85th birthday, and the first 100 people in line will get jersey tank tops featuring the number 85. Monster Energy will be on the plaza h",
      "pub_date": "Thu, 04 Dec 2025 17:32:55 +0000",
      "id": "3ee2577d8305",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides timely and relevant information about the upcoming opening of Snowbasin Resort, a major ski destination in Utah. The details about the opening date, available terrain, and planned activities are valuable for ski industry stakeholders. However, the article lacks deeper analysis or industry context, which slightly reduces its overall news value and quality."
      },
      "approved_date": "2025-12-04"
    }
  ]
}