{
  "pending": [
    {
      "source": "Outside Business Journal",
      "title": "Defender Service Awards Winner Profile: Youth Sports Alliance",
      "url": "https://www.outsideonline.com/video/defender-service-awards-winner-profile-youth-sports-alliance/",
      "description": "Emily Fisher, executive director of Youth Sports Alliance (YSA), discusses winning the Outdoor Accessibility and Education category of the 2023 Defender Service Awards Presented by CHASE The post Defender Service Awards Winner Profile: Youth Sports Alliance appeared first on Outside Online .",
      "content": "Emily Fisher, executive director of Youth Sports Alliance (YSA), discusses the impact of winning the Outdoor Accessibility and Education category of the 2023 Defender Service Awards Presented by CHASE . Designed to support hardworking nonprofits across the United States and Canada, the award (which included a brand-new customized Defender 130) recognized YSA’s work helping kids of all backgrounds to experience the wonder and empowerment of outdoor sports, from mountain biking and sailing to skiing and snowboarding. Defender embraces the impossible. A modern-day hero that anticipates the future. Available in 90, 110, and 130 body styles, with up to eight seats, each has a charisma of its own. Learn more at landroverusa.com . The post Defender Service Awards Winner Profile: Youth Sports Alliance appeared first on Outside Online .",
      "pub_date": "Mon, 30 Sep 2024 20:47:33 +0000",
      "id": "e613ff8b5223",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "Outside Business Journal",
      "title": "Your Daily Good Deed",
      "url": "https://www.outsideonline.com/business-journal/advocacy/your-daily-good-deed/",
      "description": "A tax-deductible donation of any size can have a huge impact on these nonprofits, all working to get everyone outside and protect our planet. Pick an org and donate today in just a few clicks. The post Your Daily Good Deed appeared first on Outside Online .",
      "content": "Love and kindness are never wasted. They always make a difference. They bless the one who receives them, and they bless you, the giver. — Barbara De Angelis Hiking & Camping Big City Mountaineers takes inner city kids on transformative outdoor adventures. A $25 donation will provide essential medical and safety supplies for one youth trip. Donate Now The Venture Out Project leads wilderness trips for the queer ad transgender community and conducts inclusion training for educators. A $25 donation will buy food for one person for a 4-day backpacking trip. Donate Now Running 2 61 Fearless empowers and trains women around the globe to create safe, supportive running communities. A $25 donation will fund a training kit for one community coach. Donate Now Wings of America connects Native American youth to the spiritual and cultural legacy of running through competitive and non-competitive programming. A $25 donation will provide a day of meals for one Wings Facilitator as they travel around ",
      "pub_date": "Tue, 09 May 2023 22:51:15 +0000",
      "id": "4e02fd4db008",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "Outside Business Journal",
      "title": "24 Black-Owned Outdoor Businesses Making the Industry a Better Place",
      "url": "https://www.outsideonline.com/business-journal/brands/black-owned-outdoor-businesses/",
      "description": "These companies are bringing more representation to the industry—and making great gear in the process The post 24 Black-Owned Outdoor Businesses Making the Industry a Better Place appeared first on Outside Online .",
      "content": "In honor of Black History Month, we’re spotlighting 24 Black-owned businesses across the outdoor industry. Get to know these companies doing good work and making awesome gear of all kinds. (Courtesy Tough Cutie) Tough Cutie Owner: Brittany Coleman Year founded: 2019, started selling in 2022 What We Do Tough Cutie is a USA-made company producing active lifestyle socks designed for women, by women. It is the first and only women-owned sock brand with a majority women-owned value chain, effectively positioning itself as one of the highest-impact brands in terms of economic equality in the outdoors industry. Our first sock, Eve, launched in 2022 after a rigorous and thoughtful design process that centered on feedback from women. The result is an innovative, dynamic, and durable sock that literally and figuratively supports women in their walk through life. What Makes Us Special in the Outdoor Industry “Tough Cutie is a woman-owned, Black-owned business that has invited women into the proce",
      "pub_date": "Wed, 15 Feb 2023 15:00:00 +0000",
      "id": "6a1db94ec79c",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "Outside Business Journal",
      "title": "Nikwax Introduces the World’s Highest-Performing Waterproof Down",
      "url": "https://www.outsideonline.com/business-journal/brands/nikwax-introduces-the-worlds-highest-performing-waterproof-down/",
      "description": "NHD+ and NHD Recycled prove that industry-leading waterproof down doesn’t need PFCs The post Nikwax Introduces the World’s Highest-Performing Waterproof Down appeared first on Outside Online .",
      "content": "Nikwax , the international leader in PFC-free high-performance technical cleaners and waterproofing products for outdoor apparel, footwear, and gear, has introduced the world’s highest-performing waterproof downs. Nikwax Hydrophobic Down+ (NHD+) and Nikwax Hydrophobic Down Recycled (NHD Recycled) offer brand partners the highest-performing waterproof down insulation while also being completely free of all PFCs. Nikwax Hydrophobic Down+ The world’s highest-performing waterproof down fill: Completely PFC-free formula Exceeds 10,000 minutes on the IDFB 18a Shake Test Responsible Down Certified (RDS) Available in 650–900 fill powers Keeps users dry more than 600 percent longer than competing waterproof down products Designed for lasting performance with Nikwax aftercare products Nikwax Hydrophobic Down Recycled The world’s highest-performing waterproof recycled down fill: Completely PFC-free formula Exceeds 1,000 minutes on the IDFB 18a shake test Composed completely of recycled down fill ",
      "pub_date": "Fri, 16 Dec 2022 14:20:22 +0000",
      "id": "8648d7663713",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "Outside Business Journal",
      "title": "Stio to Open Three New Storefronts",
      "url": "https://www.outsideonline.com/business-journal/brands/stio-to-open-three-new-storefronts/",
      "description": "Stio will open retail stores in Boston, Lake Tahoe, and Bozeman in 2023 The post Stio to Open Three New Storefronts appeared first on Outside Online .",
      "content": "The Outerwear and lifestyle clothing company Stio continues to bring its direct-to-consumer model into the brick-and-mortar reality with the scheduled opening of three new stores in 2023. The Jackson, Wyoming-based company announced it was launching three new storefronts in California, Montana, and Massachusetts, its first in those states. These new stores will bring Stio’s total retail locations to ten. “We started in Jackson Hole with a goal to be an authentic mountain lifestyle brand,” founder and CEO Stephen Sullivan told Outside. “Our apparel has resonated so far beyond the Tetons, and now we’re excited to offer the brick-and-mortar experience to those across the U.S.that have shopped online with us for so many years.” The Boston, Massachusetts, store is scheduled to open Jan. 6 in the Seaport neighborhood where it will join Helly Hansen, Everlane, Lululemon, Filson, and Outdoor Voices storefronts. The South Lake Tahoe, California store is expected to open in spring 2023 at Heaven",
      "pub_date": "Thu, 15 Dec 2022 18:13:02 +0000",
      "id": "fc9f42e498fb",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Protect the U.S. Winter Outdoor Industry from Harmful Tariffs",
      "url": "https://www.snowsports.org/protect-the-u-s-winter-outdoor-industry-from-harmful-tariffs/",
      "description": "As the winter season begins, burdensome tariffs are currently applied to key products essential to winter sports participation. These unnecessary tariffs act as a direct tax on our consumers, discouraging them from purchasing new gear and participating in winter outdoor sports. This, in turn, threatens the health of the outdoor recreation economy, which generates $1.2 […] The post Protect the U.S. Winter Outdoor Industry from Harmful Tariffs appeared first on Snowsports Industries America .",
      "content": "As the winter season begins, burdensome tariffs are currently applied to key products essential to winter sports participation. These unnecessary tariffs act as a direct tax on our consumers, discouraging them from purchasing new gear and participating in winter outdoor sports. This, in turn, threatens the health of the outdoor recreation economy, which generates $1.2 trillion for the US economy, and the economic stability of our small and medium-sized businesses and local retailers. Please send a note to your Congressperson below, urging them to help eliminate the tariffs on winter outdoor gear. Take Action Now! It’s Easy, Here’s How: Send a letter to your congressperson. We’ve made it very easy with a few clicks. Personal letters are the most powerful, so please edit the copy however you wish by clicking on the yellow “edit message” button or include a personal story about the impacts of the tariffs on your business, employees, etc., at the “share your story” prompt. Make a phone cal",
      "pub_date": "Mon, 17 Nov 2025 20:13:01 +0000",
      "id": "a0ba8c1d600e",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "Thu, 21 Aug 2025 07:01:00 +0000",
      "id": "49d7a2d2d62b",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "We’re Excited to Announce a New Strategic Partnership Between SIA and the European Outdoor Group (EOG), Uniting Two Industry Leaders to Better Support Our Members and Strengthen the Global Ecosystem.",
      "url": "https://www.snowsports.org/were-excited-to-announce-a-new-strategic-partnership-between-sia-and-the-european-outdoor-group-eog-uniting-two-industry-leaders-to-better-support-our-members-and-strengthen-the-global-eco/",
      "description": "Current SIA Premium voting members (to be assessed on a case-by-case basis) can now purchase anInternational Add-On EOG Membership for $500/year. This membership grants you fullaccess to EOG’s premium benefits, including exclusive data, webinars, and eventinvitations. Benefits include: To learn more, reach out to Bill Stone, SIA Membership Director at bstone@snowsports.org or call +1 435-659-3729. The post We’re Excited to Announce a New Strategic Partnership Between SIA and the European Outdoor",
      "content": "Current SIA Premium voting members (to be assessed on a case-by-case basis) can now purchase an International Add-On EOG Membership for $500/year. This membership grants you full access to EOG’s premium benefits, including exclusive data, webinars, and event invitations. Benefits include: Complimentary access to EOG’s CSR Newsletter and Executive Updates. EOG’s State of Trade topline insights: The State of Trade report delivers annual sell-in data for the European outdoor market. The report measures wholesale value and units by season across Apparel, Footwear and Equipment. European Outdoor Market Intelligence Service (@ EOG Member pricing): This new data service from the EOG and Sporting Insights provides retail sell-out analysis for the outdoor market. The dashboard is now live in the UK and France and will launch in Germany, Austria and Switzerland in Fall 2025. A Winter Sports dashboard is set to launch in 2026. Carbon Reduction Project (@ EOG Member pricing): The aim of this proje",
      "pub_date": "Tue, 22 Jul 2025 22:46:36 +0000",
      "id": "2aa67a59c266",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Take Action Against The Tariffs",
      "url": "https://www.snowsports.org/advocatetariffs/",
      "description": "Protect the Winter Outdoor Industry: Urge Congress to Act on Tariffs The winter outdoor industry relies on a global supply chain for materials used in domestic production while also depending on specialized international manufacturing to produce the high-performance equipment U.S. consumers demand. However, the current tariffs on imported materials and finished goods are placing an […] The post Take Action Against The Tariffs appeared first on Snowsports Industries America .",
      "content": "Protect the Winter Outdoor Industry: Urge Congress to Act on Tariffs The winter outdoor industry relies on a global supply chain for materials used in domestic production while also depending on specialized international manufacturing to produce the high-performance equipment U.S. consumers demand. However, the current tariffs on imported materials and finished goods are placing an unsustainable burden on our businesses, functioning as an invisible tax on American companies and consumers with real-world consequences – driving a decline in spending and forcing small businesses to cut jobs, scale back operations, or close entirely. With inventory currently in production overseas and our primary sales season fast approaching, the continued application of these tariffs risks devastating impacts on both our industry and the broader U.S. tourism economy. Leaders in Washington have signaled that now is the time for industry voices to speak up. By sharing your story, you can help influence eff",
      "pub_date": "Mon, 16 Jun 2025 21:15:06 +0000",
      "id": "cb8f44d8441f",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Global Association of Boot Fitters Scholarships Applications are open until July 1, 2025",
      "url": "https://www.snowsports.org/global-association-of-boot-fitters-scholarships-applications-are-open-until-july-1-2025/",
      "description": "FOR IMMEDIATE RELEASEMay 22, 2025 – The Global Association of Professional Boot Fitters is pleased to announce a professional scholarship opportunity, totaling $5,000 in funding, is available again this year. Applications are open for ski and snowboard shop employees and custom bootfitters to pursue additional professional training through one of the many Industry Education Providers […] The post Global Association of Boot Fitters Scholarships Applications are open until July 1, 2025 appeared fi",
      "content": "FOR IMMEDIATE RELEASE May 22, 2025 – The Global Association of Professional Boot Fitters is pleased to announce a professional scholarship opportunity, totaling $5,000 in funding, is available again this year. Applications are open for ski and snowboard shop employees and custom bootfitters to pursue additional professional training through one of the many Industry Education Providers Boot Fitting Training Courses. The ideal applicants should have some practical working experience with ski and/or snowboard boot fitting, a future commitment to the ski/snowboard industry, and motivation to increase their knowledge and skill set. Applications are currently open and must be submitted by July 1st, 2025, to be considered. Each scholarship recipient will be awarded up to $1,000 toward the course curriculum fees and travel expenses for a training session provided by one of the ski industry education providers. The link to the digital application can be found here . About The Global Association",
      "pub_date": "Thu, 22 May 2025 23:24:32 +0000",
      "id": "d913e30f2588",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Snowball Effect and Mount Southington Launch ON BOARD: Youth-Powered Movement for Sport & Sustainability",
      "url": "https://www.snowsports.org/snowball-effect-and-mount-southington-launch-on-board-youth-powered-movement-for-sport-sustainability/",
      "description": "Play. Learn. Sustain. A next-generation way to mobilize communities, spark climate action, and connect local kids to the outdoors through sport. Southington, CT – April 29, 2025 – Snowball Effect and Mount Southington have teamed up to launch ON BOARD, a breakthrough initiative that connects sport, sustainability, and education to create real impact for local […] The post Snowball Effect and Mount Southington Launch ON BOARD: Youth-Powered Movement for Sport & Sustainability appeared first on Sn",
      "content": "Play. Learn. Sustain. A next-generation way to mobilize communities, spark climate action, and connect local kids to the outdoors through sport. Southington, CT – April 29, 2025 – Snowball Effect and Mount Southington have teamed up to launch ON BOARD , a breakthrough initiative that connects sport, sustainability, and education to create real impact for local families. With a focus on environmental stewardship and youth engagement, ON BOARD is reinventing how ski areas and resorts connect with their communities, starting right here in Connecticut. “ ON BOARD is about inspiring the next generation to take action for the planet,” said Jeff Boliba, Founder of Snowball Effect. “We’re using the joy of movement and the power of play to help kids build climate awareness, connect with their communities, and gain confidence. Whether in the school gym, at local events, or on the slopes, young learners are discovering that sorting waste, composting food scraps, and caring for nature are fun, pow",
      "pub_date": "Fri, 02 May 2025 21:20:17 +0000",
      "id": "12d33e84fdea",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Upper Midwest’s premier outdoor & snowsports trade associations merge",
      "url": "https://www.snowsports.org/upper-midwests-premier-outdoor-snowsports-trade-associations-merge/",
      "description": "Madison, WI, January 1, 2025–Effective January 1, Midwest Winter Sports Reps Association (MWSRA) and Outdoor Reps Association (ORA) will merge to form Midwest Professional Reps Organization, or M-Pro. The new group will be an all-season resource for sales reps and retailers in outdoor, winter sports, and the various categories that touch them. Founded in the […] The post Upper Midwest’s premier outdoor & snowsports trade associations merge appeared first on Snowsports Industries America .",
      "content": "Madison, WI, January 1, 2025– Effective January 1, Midwest Winter Sports Reps Association (MWSRA) and Outdoor Reps Association (ORA) will merge to form Midwest Professional Reps Organization, or M-Pro. The new group will be an all-season resource for sales reps and retailers in outdoor, winter sports, and the various categories that touch them. Founded in the 70s (MWSRA) and 80s (ORA), the two predecessor organizations have for decades provided trade shows and informational resources to facilitate rep/retailer relationships. With substantial member overlap, the two boards of directors proposed a merger and the combined membership voted overwhelmingly to approve. The new organization is currently planning 4 shows per year, 2 summer and 2 winter, with one per season in Saint Paul, MN and Madison, WI. These show attract retailers from as far west as Nebraska and the Dakotas, south to Missouri, east to Illinois, and north to the Michigan upper peninsula. The association website is configur",
      "pub_date": "Thu, 02 Jan 2025 20:33:38 +0000",
      "id": "82f8502a6dfd",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "Thu, 12 Dec 2024 00:18:25 +0000",
      "id": "c0daeacca788",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Blizzard-Tecnica Announces 2025 W2W Hilaree Nelson Education Scholarship",
      "url": "https://www.snowsports.org/blizzard-tecnica-announces-2025-w2w-hilaree-nelson-education-scholarship/",
      "description": "The program aims to empower women through their passion for mountain sports. West Lebanon, NH (November 19, 2024) – Blizzard-Tecnica is proud to announce the fifth annual scholarship for women looking to advance their education in snowsports – the W2W Hilaree Nelson Education Scholarship. Whether applicants are interested in avalanche safety, ski instruction, guiding, or […] The post Blizzard-Tecnica Announces 2025 W2W Hilaree Nelson Education Scholarship appeared first on Snowsports Industries ",
      "content": "The program aims to empower women through their passion for mountain sports. West Lebanon, NH (November 19, 2024) – Blizzard-Tecnica is proud to announce the fifth annual scholarship for women looking to advance their education in snowsports – the W2W Hilaree Nelson Education Scholarship. Whether applicants are interested in avalanche safety, ski instruction, guiding, or other related coursework, the program welcomes applications from introductory courses up to top-level certifications, as to encourage all women skiers to pursue their individual goals. The grants awarded will include coursework fees along with a pair of Blizzard skis and Tecnica boots. Blizzard Tecnica’s Women2Women (W2W) program is widely considered one of the most committed women’s programs in skiing, closely and continually evaluating women’s products, needs, and lifestyles as they pertain to skiing. The program has proudly awarded 87 women with over $100,000 in scholarships and equipment in the first four years. Se",
      "pub_date": "Tue, 19 Nov 2024 19:29:39 +0000",
      "id": "e679761fe44d",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Smugglers’ Notch and Snowball Effect Elevate Snow Sports, Community, and Culture in Vermont.",
      "url": "https://www.snowsports.org/smugglers-notch-and-snowball-effect-elevate-snow-sports-community-and-culture-in-vermont/",
      "description": "FOR IMMEDIATE RELEASEJeffersonville, VT – Nov. 12, 2024 – Smugglers’ Notch Resort (Smuggs) is proud to announce acollaboration with Snowball Effect to advance Snow Sports programs and further its unique culture andcommunity. As a leader in the industry and an independently owned, locally focused resort, Smuggscontinues to set standards for family-friendly programs, instructor opportunities, and […] The post Smugglers’ Notch and Snowball Effect Elevate Snow Sports, Community, and Culture in Vermo",
      "content": "FOR IMMEDIATE RELEASE Jeffersonville, VT – Nov. 12, 2024 – Smugglers’ Notch Resort (Smuggs) is proud to announce a collaboration with Snowball Effect to advance Snow Sports programs and further its unique culture and community. As a leader in the industry and an independently owned, locally focused resort, Smuggs continues to set standards for family-friendly programs, instructor opportunities, and inclusive community engagement. With a shared commitment to community impact and Snow Sports growth, Smuggs, and Snowball Effect bring renewed focus to empowering guests of all ages. Smuggs is more than a resort; it’s a community. As one of the few independently owned ski resorts, Smuggs prides itself on maintaining a locally focused, guest-centered experience. Known for its unmatched tree skiing, open boundaries policy, and commitment to sustainability, Smuggs provides a distinctive, authentic Vermont mountain experience. Guests and employees become “Smugglers,” part of a vibrant culture wh",
      "pub_date": "Tue, 12 Nov 2024 19:57:02 +0000",
      "id": "916c75252b14",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "The Ski Diva - Industry News",
      "title": "Gear Review: Cardo PackTalk Outdoor Communicator",
      "url": "https://www.theskidiva.com/gear-review-cardo-packtalk-outdoor-communicator/",
      "description": "Picture this: you’re skiing down the mountain and you want to listen to music. So you say, “Hey, Cardo, music on,” and your tunes start playing. They’re not loud enough, so you say “Hey, Cardo, volume up,” and presto! There’s your favorite song, at just the right level. All of a sudden you spot your... The post Gear Review: Cardo PackTalk Outdoor Communicator appeared first on The Ski Diva .",
      "content": "Picture this: you’re skiing down the mountain and you want to listen to music. So you say, “Hey, Cardo, music on,” and your tunes start playing. They’re not loud enough, so you say “Hey, Cardo, volume up,” and presto! There’s your favorite song, at just the right level. All of a sudden you spot your... The post Gear Review: Cardo PackTalk Outdoor Communicator appeared first on The Ski Diva .",
      "pub_date": "Tue, 11 Nov 2025 02:39:53 +0000",
      "id": "ca703f0e60db",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "The Ski Diva - Industry News",
      "title": "Taos Ski Week: A Complete Guide to Skiing’s Best Lesson Deal",
      "url": "https://www.theskidiva.com/taos-ski-week-complete-guide/",
      "description": "Taos Ski Valley is the only ski area in the northern hemisphere to offer a week-long lesson program: Taos Ski Week. Featuring six mornings of lessons for a very reasonable price, a Taos Ski Week is a great way to take your skiing to the next level, get to know the mountain, and meet other... The post Taos Ski Week: A Complete Guide to Skiing’s Best Lesson Deal appeared first on The Ski Diva .",
      "content": "Taos Ski Valley is the only ski area in the northern hemisphere to offer a week-long lesson program: Taos Ski Week. Featuring six mornings of lessons for a very reasonable price, a Taos Ski Week is a great way to take your skiing to the next level, get to know the mountain, and meet other... The post Taos Ski Week: A Complete Guide to Skiing’s Best Lesson Deal appeared first on The Ski Diva .",
      "pub_date": "Tue, 11 Nov 2025 02:25:42 +0000",
      "id": "a8810a32fdca",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "The Ski Diva - Industry News",
      "title": "Focus on an Independent: Middlebury Snowbowl",
      "url": "https://www.theskidiva.com/focus-on-an-independent-middlebury-snowbowl/",
      "description": "Who here has an EPIC Pass? How about an IKON? Come on, don’t be shy, raise your hand! Okay, you know I can’t see you, right? Put your hand down. Nonetheless, I’m sure that many of you would’ve raised your hands, if we were meeting face to face. After all, Vail sold around 2.4 million... The post Focus on an Independent: Middlebury Snowbowl appeared first on The Ski Diva .",
      "content": "Who here has an EPIC Pass? How about an IKON? Come on, don’t be shy, raise your hand! Okay, you know I can’t see you, right? Put your hand down. Nonetheless, I’m sure that many of you would’ve raised your hands, if we were meeting face to face. After all, Vail sold around 2.4 million... The post Focus on an Independent: Middlebury Snowbowl appeared first on The Ski Diva .",
      "pub_date": "Sun, 25 Feb 2024 16:34:44 +0000",
      "id": "7d2d53acd33b",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "The Ski Diva - Industry News",
      "title": "The Best Women’s Backpacks for Resort Skiing",
      "url": "https://www.theskidiva.com/the-best-womens-backpacks-for-resort-skiing/",
      "description": "There are a lot of backpacks that can work well for in-bounds skiing at a resort, and narrowing down the options can feel a little overwhelming. Will it be comfortable and safe on the lift? Can it carry skis? Does it fit a hydration bladder? What size makes sense? The members of The Ski Diva... The post The Best Women’s Backpacks for Resort Skiing appeared first on The Ski Diva .",
      "content": "There are a lot of backpacks that can work well for in-bounds skiing at a resort, and narrowing down the options can feel a little overwhelming. Will it be comfortable and safe on the lift? Can it carry skis? Does it fit a hydration bladder? What size makes sense? The members of The Ski Diva... The post The Best Women’s Backpacks for Resort Skiing appeared first on The Ski Diva .",
      "pub_date": "Wed, 16 Aug 2023 15:56:48 +0000",
      "id": "baabd85d372f",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "The Ski Diva - Industry News",
      "title": "Vail Introduces “My Epic Ski Day,” Reimagining the Guest Experience at its Many Resorts",
      "url": "https://www.theskidiva.com/vail-introduces-my-epic-ski-day-reimagining-the-guest-experience-at-its-many-resorts/",
      "description": "Vail Resorts, which recently announced its My Epic Gear program, today introduced another program to enhance the guest experience: My Epic Ski Day. My Epic Ski Day lets guests enjoy a day on the slopes without leaving the warmth and comfort of their own living rooms. Instead of battling traffic, hauling gear, and risking life... The post Vail Introduces “My Epic Ski Day,” Reimagining the Guest Experience at its Many Resorts appeared first on The Ski Diva .",
      "content": "Vail Resorts, which recently announced its My Epic Gear program, today introduced another program to enhance the guest experience: My Epic Ski Day. My Epic Ski Day lets guests enjoy a day on the slopes without leaving the warmth and comfort of their own living rooms. Instead of battling traffic, hauling gear, and risking life... The post Vail Introduces “My Epic Ski Day,” Reimagining the Guest Experience at its Many Resorts appeared first on The Ski Diva .",
      "pub_date": "Sat, 01 Apr 2023 09:43:25 +0000",
      "id": "3c1dc156418d",
      "score": 5,
      "score_details": {
        "reason": "Basic keyword scoring (no LLM)"
      }
    },
    {
      "source": "The Ski Diva",
      "title": "A chat with Hooey Wilks, ski artist.",
      "url": "https://www.theskidiva.com/a-chat-with-hooey-wilks-ski-artist/",
      "description": "Have you ever been to Hooey Mountain? No, it’s not a mountain owned by Vail or Alterra. Heck, it’s not a real mountain, at all. Instead, it’s the internet home of Hooey Wilks, an avid skier and talented artist from a very real place called Connecticut. Hooey’s passion for skiing is what inspired her to... The post A chat with Hooey Wilks, ski artist. appeared first on The Ski Diva .",
      "content": "Have you ever been to Hooey Mountain? No, it’s not a mountain owned by Vail or Alterra. Heck, it’s not a real mountain, at all. Instead, it’s the internet home of Hooey Wilks, an avid skier and talented artist from a very real place called Connecticut. Hooey’s passion for skiing is what inspired her to... The post A chat with Hooey Wilks, ski artist. appeared first on The Ski Diva .",
      "pub_date": "Tue, 17 Jan 2023 10:30:34 +0000",
      "id": "891ad9f4f389",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "The Largest Cross-Country Ski Resort In North America Is In California",
      "url": "https://unofficialnetworks.com/2025/12/04/largest-cross-country-ski-resort-in-north-america/",
      "description": "At 6,000 acres, Royal Gorge Cross-Country Resort in California deserves to be in the \"largest ski resort in North America\" conversation.",
      "content": "When we think of the largest ski resorts in the United States, we usually point toward Park City with its 7,300 acres or Palisades Tahoe with its 6,000 acres. Those are the largest in the U.S., but there’s a category of resort that’s often left out in the largest ski resort discussion: cross-country resorts. North America’s largest XC resort isn’t as large as Park City, and it’s nowhere near the mass of Whistler Blackcomb, but at 6,000 acres, Royal Gorge XC Resort deserves to be in the conversation. Royal Gorge features 6 distinct trail systems with 8 different warming huts, all spread over 6,000 acres. It seamlessly integrates with the Village at Sugar Bowl , another major California ski resort. Visitors can engage in some classic striding to XC skating and snowshoeing, all with some stunning views of the Sierra. Season passes to Royal Gorge cost just $489 for an adult, much less than the scary prices you might see at an alpine resort. Of course XC resorts don’t need to run and mainta",
      "pub_date": "Thu, 04 Dec 2025 20:23:26 +0000",
      "id": "827df675935c",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Oregon Lawmaker To Introduce Bill To Help Protect State’s Ski Industry",
      "url": "https://unofficialnetworks.com/2025/12/04/oregon-bill-skier-liability/",
      "description": "A Oregon state lawmaker plans to introduce a bill next year that would help protect the ski and outdoor recreation industry.",
      "content": "Salem, Oregon — The ski industry in Oregon is at a crossroads. The ski and recreation industries in the state are continuing to deal with the fallout of a 2014 Oregon Supreme Court decision. This ruling against Mt. Bachelor limited the liability waiver protections that are supposed to be protect operators. This has led to rising insurance prices in the region, with only one provider remaining that covers the ski industry. So far, the impacts have included the permanent closure of mountain biking at Mt. Hood Ski Bowl and an increase in prices at Timberline Lodge . If damaging verdicts continue to happen, ski areas are at risk of closure. In response, one lawmaker plans to introduce new protections for the ski and outdoor recreation industry. OPB reports that Senator Mark Meek (D-Gladstone) intends to introduce legislation requiring users to sign liability waivers before participating in activities, such as shredding at a ski resort. This is similar to laws in Washington and other nearby",
      "pub_date": "Thu, 04 Dec 2025 18:17:10 +0000",
      "id": "5ffcbbbf1f7e",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Pennsylvania Ski Resort Addresses Rumors Regarding Potential Sale",
      "url": "https://unofficialnetworks.com/2025/12/03/pennsylvania-ski-resort-no-sale/",
      "description": "After rumors of a sale in 2024, a Pennsylvania has updated its guests on its ownership status for the 2025-26 season.",
      "content": "Union Dale, Pennsylvania — Despite rumors over the past year or so of a sale, Elk Mountain is staying under its current ownership. Yesterday, Elk Mountain clarified its ownership status before the start of its 2025-26 season. There have been rumors on Facebook regarding the sale of the ski resort. Reportedly, Elk’s General Manager said on a Facebook post last year that the ski resort was for sale. However, Elk Mountain explained on Facebook that it had not been sold. They admitted that it was previously on the market during an unspecified time period, but it now appears to be off the market. Elk was owned by Joe Moore, who’s ran the mountain since the 1960s, but he passed away last year . Presumably, it’s still being run by his family. While this post may bring uncertainty regarding its future, it’s clear that the current management group isn’t throwing in the towel. Snowmaking operations are well underway, meaning an opening is coming soon. West Virginia’s Ski Season Kicks Off On Thur",
      "pub_date": "Wed, 03 Dec 2025 18:43:53 +0000",
      "id": "1d2227abc0da",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Bizarre Slopeside Encounter Leads to Two Disorderly-Conduct Summons at Colorado Ski Resort",
      "url": "https://unofficialnetworks.com/2025/12/03/slopeside-encounter-court-summons-colorado/",
      "description": "A bizarre encounter on the slopes of Keystone Resort ended with two parties receiving summons to court for disorderly conduct.",
      "content": "A bizarre encounter on the slopes of Keystone Resort in Summit County, Colorado, ended with two parties receiving summons to court for disorderly conduct. According to the Summit County Sheriff’s Office , a skier believed that a snowboarder downhill from her was taking turns that were too wide, claiming he nearly caused several collisions including one with her. The woman stopped near a sign on the trail and flagged the snowboarder down, letting him know that she believed he was acting dangerously. The snowboarder stated that he had always been downhill of her and thus always had the right of way. He then rode off. The woman and her husband apparently continued to follow the man, skiing near him down the mountain. While accounts of the situation differ, the snowboarder and the husband wound up on the ground in a short scuffle. Neither party was injured and, after an investigation, both were issued a summons to court. The exact details of the incident aren’t extremely clear, so assignin",
      "pub_date": "Wed, 03 Dec 2025 18:42:11 +0000",
      "id": "26d51313176b",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "The Wildest Moments Of The 2025 Downhill Mountain Biking World Cup",
      "url": "https://unofficialnetworks.com/2025/12/03/downhill-mountain-biking-2025-highlights/",
      "description": "The 2025 Downhill Mountain Biking World Cup season was a seriously wild one.",
      "content": "Downhill mountain biking is a truly jaw-dropping sport. It is easily among the fastest cycling competition, sending racers at breakneck pace down mountains, over massive jumps, and through seriously sketchy rock gardens. This year’s World Cup season was an exciting one, and the Sleeper Collective has done a great job at putting together a proper highlight reel. The 2025 women’s downhill season saw Austrian Valentina Höll take first place, with Canadian Gracey Hemstreet in second and British rider Tahnee Seagrave in third. The men’s season was dominated by Canadian Jackson Goldstone, a 21-year-old beast. In second place was French rider Loic Bruni, and American Luca Shaw took third. The 2026 Downhill World Cup season starts between May 1st-3rd at the Race of South Korea . Professional Snowboarder Takes On Wild Obstacle Course In One Take Categories: Biking",
      "pub_date": "Wed, 03 Dec 2025 18:24:30 +0000",
      "id": "cddbbac6f0be",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Professional Snowboarder Takes On Wild Obstacle Course In One Take",
      "url": "https://unofficialnetworks.com/2025/12/03/obstacle-course-snowboarder/",
      "description": "Sebastien Toutant built a wild and unique obstacle course to to take on with his snowboard at Sun Peaks Resort in Birtish Columbia.",
      "content": "Olympic gold medalist and 7 times XGames medal winner Sebastien Toutant likes to do snowboarding a little different. While most professionals are sending massive tricks off huge jumps or throwing it massive in the backcountry, Toutant builds incredibly unique obstacle courses to challenge his skills on the board. This video, filmed at Sun Peaks Resort in British Columbia, is Sebastien’s second major obstacle course built at a ski resort. The first one was filmed at Ski La Réserve in Quebec and, like this second one, was completed in one take. He’s also known for his wild dry land courses that no doubt make him better on the snow. How You Should Start Your First Day Back On Skis Categories: Canada Snowboarding",
      "pub_date": "Wed, 03 Dec 2025 17:01:29 +0000",
      "id": "80fc285e53aa",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Risky Rope Operation Rescues Oregon Hiker From Dangerous Knife-Edge Ridge",
      "url": "https://unofficialnetworks.com/2025/12/02/rope-rescue-operation-oregon-knife-edge/",
      "description": "A stranded hiker required a risky rope rescue from a knife-edge ridge on the top of Oregon's Saddle Mountain this weekend.",
      "content": "On Saturday, November 29th, at approximately 2pm, Cannon Beach Fire personnel in Oregon were dispatched to a report of a stranded hiker at the top of Saddle Mountain State Park . Gearhart Volunteer Fire Department , Hamlet Volunteer Fire Department , and Clatsop County Sheriff’s Office Search and Rescue also responded. Personnel arrived at the parking lot and began working up the trail at around 2:45pm, reaching the hiker at around 3:40pm 1.5 miles up from the trailhead. They found a male stranded about 40 feet up on a three-foot wide knife-edge ridge located on the south slope of Saddle Mountain. It quickly became clear that this would be a high-angle rescue, and a request for the U.S. Coast Guard Air Station Astoria and additional fire personnel was placed. The USCG arrived with a rescue helicopter at 5:15pm, beginning their rescue attempt. Unfortunately the reduced visibility and a quickly lowering crowd rescue forced the crew to abort further rescue attempts, leading to an alternat",
      "pub_date": "Tue, 02 Dec 2025 19:54:26 +0000",
      "id": "8c329b30537d",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Speedrider Valentin Delluc Grinds Chairlift Cable",
      "url": "https://unofficialnetworks.com/2025/12/02/speedrider-chairlift-cable-grind/",
      "description": "Professional speedrider Valentin Delluc grinds an old chairlift cable in Morzine, France.",
      "content": "If you’ve ever looked at a chairlift cable and thought, “I bet I could grind that” , know that you aren’t the first. Plenty of people have thought it, and a few have tried. Professional speedrider Valentin Delluc has done it a few times now, including this most recent one on a old chairlift in Morzine, France . View this post on Instagram A post shared by Valentin Delluc (@valentindelluc) Speedriding is a wild combination of paragliding and skiing, using a small paragliding wing often to take off and land on snow. It’s allowed for some pretty incredible stunts, including sights of skiers flying over enormous cliffs and through stunning European villages. In this case, of course, it was used to accomplish a dream held by many. Mission Ridge Ski Resort Opening Thursday, First In Washington State Categories: France Paragliding Skiing",
      "pub_date": "Tue, 02 Dec 2025 16:36:05 +0000",
      "id": "8dc7551520bc",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "5 Most Convenient Ski Resorts For Denver Residents",
      "url": "https://unofficialnetworks.com/2025/12/02/ski-resorts-day-trip-denver/",
      "description": "If you're looking to get out of Denver for a day of skiing, one of these 5 ski resorts would be a great, convenient option.",
      "content": "Every skier and snowboarder who lives along the Foothills of Colorado knows the struggle of getting to the ski resort in the morning. Traffic can be a nightmare on any given day, and days of heavy snow can make travel near impossible. Fortunately there are a few ski resort options that require less time spent on the major interstate and make for a slightly-easier day trip from the Denver area. These are the 5 best ski resorts for a day trip from Denver. Eldora Mountain Ski Resort View this post on Instagram A post shared by Eldora (@eldoramtnresort) With no traffic, a drive from Denver (Union Station) to Eldora Mountain Ski Resort can take between 1 hour 5 minutes and 1 hour 10 minutes. Depending on the route taken, and the origin point of the drive, no time is required along I-70, though I-25, which is often a nightmare on its own, can be a part of the route. Eldora has 10 chairlifts and 62 trails when 100% open. Winter Park Resort View this post on Instagram A post shared by Winter P",
      "pub_date": "Tue, 02 Dec 2025 16:07:12 +0000",
      "id": "d96b3464923d",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "The 7 Most Beautiful Mountain Towns in Colorado You Should Visit",
      "url": "https://unofficialnetworks.com/2025/12/02/7-most-beautiful-mountain-towns-in-colorado-you-should-visit/",
      "description": "Colorado’s Most Beautiful Rocky Mountain Towns Colorado boasts some of the most breathtaking scenery in the United States, thanks to the dramatic peaks of the Rocky Mountains—a visual spectacle unmatched elsewhere. Beyond the natural wonders, the state is dotted with historic mountain towns, born from the heyday of railways and mining booms. These charming relics […]",
      "content": "Colorado’s Most Beautiful Rocky Mountain Towns Colorado boasts some of the most breathtaking scenery in the United States, thanks to the dramatic peaks of the Rocky Mountains—a visual spectacle unmatched elsewhere. Beyond the natural wonders, the state is dotted with historic mountain towns, born from the heyday of railways and mining booms. These charming relics boast timeless architecture and irresistible character, making them perfect for anyone seeking the pinnacle of alpine beauty. If you’re plotting a trip to America’s loveliest mountain escapes, here’s our handpicked list of Colorado’s finest. 7. Pagosa Springs: Geothermal Alpine Glow Image: Heidi Besen/Shutterstock.com | Pagosa Springs is a town in southwest Colorado known for its hot springs. Colorado’s deepest hot springs feed steaming rivers and resort pools in Pagosa Springs, where the San Juan Mountains rise in geothermal splendor. Hike the Continental Divide Trail for views of the Weminuche Wilderness, or ski Wolf Creek’s",
      "pub_date": "Tue, 02 Dec 2025 16:07:10 +0000",
      "id": "289a20f58635",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "SnowBrains",
      "title": "The 10 Snowiest Resorts in Europe",
      "url": "https://snowbrains.com/the-10-snowiest-resorts-in-europe/",
      "description": "For powder seekers, few things matter more than consistency—the kind of deep winter snowpack that transforms a good ski trip into an unforgettable one. Across the Alps, snowfall varies dramatically by altitude, exposure, and local weather patterns. But year after year, a handful of resorts rise to the top with reliable, season-stretching storms. Using average annual snowfall totals collected by […] The post The 10 Snowiest Resorts in Europe appeared first on SnowBrains .",
      "content": "Tignes-Val d’Isere in France. | Image: @flo_vdi @valdisere @tignesofficiel For powder seekers, few things matter more than consistency—the kind of deep winter snowpack that transforms a good ski trip into an unforgettable one. Across the Alps, snowfall varies dramatically by altitude, exposure, and local weather patterns. But year after year, a handful of resorts rise to the top with reliable, season-stretching storms. Using average annual snowfall totals collected by Hoppa, here are Europe’s 10 snowiest ski resorts: Zermat, Switzerland. | Image: Kris Yates Gss Instagram 10. Zermatt, Switzerland — 414 cm One of the Alps’ most iconic destinations, Zermatt sits beneath the Matterhorn and delivers dependable snow enhanced by high-altitude terrain and glacier skiing. Its mix of classic pistes, long vertical, and dramatic scenery makes it a favorite for strong intermediates and experts. 9. Davos-Klosters, Switzerland — 423 cm Spread across several mountains, Davos-Klosters benefits from a r",
      "pub_date": "Thu, 04 Dec 2025 19:54:53 +0000",
      "id": "ab6b49a86d21",
      "score": 5,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "SnowBrains",
      "title": "The 3 Companies that Dominate Skiing Retail",
      "url": "https://snowbrains.com/the-3-companies-that-dominate-skiing-retail/",
      "description": "When browsing for new ski gear, you’ll encounter countless brands with seemingly endless options. To find the best equipment, it’s important to know what each company offers and how the brands differ. Like most industries, the ski world has seen many once-independent companies absorbed into a handful of large corporations. This isn’t inherently negative, but it is helpful to know […] The post The 3 Companies that Dominate Skiing Retail appeared first on SnowBrains .",
      "content": "The countless skis offered at a ski shop. | Photo: Skihausonline When browsing for new ski gear, you’ll encounter countless brands with seemingly endless options. To find the best equipment, it’s important to know what each company offers and how the brands differ. Like most industries, the ski world has seen many once-independent companies absorbed into a handful of large corporations. This isn’t inherently negative, but it is helpful to know who actually owns what, so you understand your real choices and not just the labels on the surface. Today, three companies sit above the rest and dominate ski-retail. Elevate Outdoor Collective (Kohlberg & Company) Elevate illustrates its skiing focus. | Photo: Elevate Outdoor Collective Elevate Outdoor Collective is the recent rebranding of what used to be K2-MDV. The “original” company in this now-massive conglomerate was K2 , founded in 1962 with the then-innovative idea of building fiberglass skis. As K2 grew into a dominant ski-retail force,",
      "pub_date": "Thu, 04 Dec 2025 16:37:29 +0000",
      "id": "eff318b841e0",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    },
    {
      "source": "SnowBrains",
      "title": "SnowBrains Forecast: 20-30 Inches for Colorado This Weekend",
      "url": "https://snowbrains.com/snowbrains-forecast-20-30-inches-for-colorado-this-weekend/",
      "description": "A powerful northwest flow pattern is set to slam into Colorado, delivering a multi-day powder event focused on the northern and central mountains. The action kicks off with a tease Thursday night, but the main engine roars to life Friday night through Sunday, bringing heavy snowfall, intense winds, and excellent snow quality to resorts like Steamboat, Winter Park, and the […] The post SnowBrains Forecast: 20-30 Inches for Colorado This Weekend appeared first on SnowBrains .",
      "content": "Credit: WeatherBell A powerful northwest flow pattern is set to slam into Colorado, delivering a multi-day powder event focused on the northern and central mountains. The action kicks off with a tease Thursday night, but the main engine roars to life Friday night through Sunday, bringing heavy snowfall, intense winds, and excellent snow quality to resorts like Steamboat, Winter Park, and the I-70 corridor. While the southern mountains will see lighter accumulations, the northern tier is looking at feet of fresh snow by Monday morning before a warming trend stabilizes conditions early next week. The storm door is swinging wide open mainly for the northern and central mountains as a persistent northwest flow pattern establishes itself. Light snow begins to develop Thursday night, primarily favoring the Park and Gore ranges, acting as an appetizer for the main course. By Friday, orographic lift intensifies, bringing steady light-to-moderate accumulation to resorts like Steamboat and Winte",
      "pub_date": "Thu, 04 Dec 2025 15:27:33 +0000",
      "id": "f233cf8219fd",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    },
    {
      "source": "SnowBrains",
      "title": "SnowBrains Forecast: 20+ Inches for Utah This Weekend",
      "url": "https://snowbrains.com/snowbrains-forecast-20-inches-for-utah-this-weekend/",
      "description": "A strong multi-day winter storm will bring widespread early season snowfall to the northern Utah mountains from Thursday night through the weekend, with the Cottonwoods and other northern Utah resorts seeing the deepest new snow followed by a lighter wave Sunday night into Monday and a turn toward warmer, drier weather next week. All snow at the ski areas falls […] The post SnowBrains Forecast: 20+ Inches for Utah This Weekend appeared first on SnowBrains .",
      "content": "Credit: WeatherBell A strong multi-day winter storm will bring widespread early season snowfall to the northern Utah mountains from Thursday night through the weekend, with the Cottonwoods and other northern Utah resorts seeing the deepest new snow followed by a lighter wave Sunday night into Monday and a turn toward warmer, drier weather next week. All snow at the ski areas falls with temperatures mostly in the teens and 20s Fahrenheit, starting as light powder then trending a bit denser during the peak of the storm before cooling again late in the event, while snow levels climb high enough that lower valleys see more rain. Gusty west to northwest ridge top winds will create wind affected surfaces and drifting in exposed terrain, but they also help load leeward aspects for deeper pockets of soft snow at Brighton and Solitude, with closed resorts building a solid base ahead of their coming openings. Thursday night through Saturday features a significant winter storm across the northern",
      "pub_date": "Thu, 04 Dec 2025 15:09:58 +0000",
      "id": "ed7006d54735",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    },
    {
      "source": "SnowBrains",
      "title": "Mount Bohemia Is Home to One of the Best Slopeside Après-Ski Parties in North America and Michigan’s Only Nordic Spa",
      "url": "https://snowbrains.com/mount-bohemia-is-home-to-one-of-the-best-slopeside-apres-ski-parties-in-north-america-and-michigans-only-nordic-spa/",
      "description": "Mount Bohemia in Michigan’s Upper Peninsula boasts the longest runs, the highest vertical, and the deepest powder in the Midwest. This hidden secret is a true treasure for backcountry skiers and snowboarders. However, the mountain resort also holds other secrets and treasures that skiers and snowboarders can enjoy after a long day on the slopes. Mount Bohemia is home to […] The post Mount Bohemia Is Home to One of the Best Slopeside Après-Ski Parties in North America and Michigan’s Only Nordic S",
      "content": "Mardi Gras on the mountain. | Photo: Mount Bohemia Mount Bohemia in Michigan’s Upper Peninsula boasts the longest runs, the highest vertical, and the deepest powder in the Midwest. This hidden secret is a true treasure for backcountry skiers and snowboarders. However, the mountain resort also holds other secrets and treasures that skiers and snowboarders can enjoy after a long day on the slopes. Mount Bohemia is home to one of the best slopeside après-ski parties in North America and Michigan’s only Nordic spa, which features bars, pools, a hot-spring mineral pool, steam rooms, a relaxation room, a cool rain mist room, and a live DJ on Saturdays. Related: Mount Bohemia, MI, Launches $99 Pass Sale With Massive Partner Benefits Until December 6 This Midwest ski resort is no longer flying under the radar for some skiers and snowboarders around the country, and is a legit powerhouse not only on the slopes, but off of them as well. The ski industry has always been geared towards skiing, but",
      "pub_date": "Thu, 04 Dec 2025 11:00:50 +0000",
      "id": "09e99ac46576",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    },
    {
      "source": "SnowBrains",
      "title": "China’s Sunac-BonSki to Operate Australia’s Indoor Snow Center Under New Partnership",
      "url": "https://snowbrains.com/chinas-sunac-bonski-to-operate-australias-indoor-snow-center-under-new-partnership/",
      "description": "Australia’s planned indoor snow center, Winter Sports World (WSW), has taken a major step forward after signed a Memorandum of Understanding (MOU) with Sunac-Bonski, the world’s largest operator of indoor snow center’s, to run the AUD 700-million (USD 460-million) facility planned for Penrith in Western Sydney. The agreement, signed on Thursday, December 4, in Guangzhou, China, positions the long-delayed project […] The post China’s Sunac-BonSki to Operate Australia’s Indoor Snow Center Under Ne",
      "content": "Artist render of the exterior. | Image: supplied by WSW Australia’s planned indoor snow center, Winter Sports World (WSW), has taken a major step forward after signed a Memorandum of Understanding (MOU) with Sunac-Bonski, the world’s largest operator of indoor snow center’s, to run the AUD 700-million (USD 460-million) facility planned for Penrith in Western Sydney. The agreement, signed on Thursday, December 4, in Guangzhou, China, positions the long-delayed project to become Australia’s only year-round alpine training destination and the Southern Hemisphere’s only Olympic-standard indoor slope. Related: Australian Indoor Ski Center Near Sydney Receives Government Approval Under the deal, Sunac-BonSki will provide design consulting, pre-opening support and operational management, applying its significant experience to Australia’s only indoor ski center. Sunac-BonSki runs 11 large-scale indoor snow resorts across major Chinese cities, including Shenzhen BonSki/Huafa Snow, reportedly th",
      "pub_date": "Thu, 04 Dec 2025 05:30:55 +0000",
      "id": "062abb82a693",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    },
    {
      "source": "SnowBrains",
      "title": "New Zealand’s Largest Ski Resort Operator Signs Partnership Agreement with China’s Sunac-BonSki",
      "url": "https://snowbrains.com/new-zealands-largest-ski-resort-operator-signs-partnership-agreement-with-chinas-sunac-bonski/",
      "description": "NZSki, which operates The Remarkables, Coronet Peak and Mt. Hutt in New Zealand, has signed a strategic partnership with China’s Sunac-BonSki, marking one of the most significant international agreements in New Zealand’s ski industry. Sunac-BonSki runs 11 large-scale indoor snow resorts across major Chinese cities, including Shenzhen BonSki/Huafa Snow, reportedly the largest indoor ski resort in the world. In addition […] The post New Zealand’s Largest Ski Resort Operator Signs Partnership Agree",
      "content": "Queenstown, New Zealand, and the Remarkable Mountain Range. | Image: The Remarkables Facebook NZSki, which operates The Remarkables, Coronet Peak and Mt. Hutt in New Zealand, has signed a strategic partnership with China’s Sunac-BonSki, marking one of the most significant international agreements in New Zealand’s ski industry. Sunac-BonSki runs 11 large-scale indoor snow resorts across major Chinese cities, including Shenzhen BonSki/Huafa Snow, reportedly the largest indoor ski resort in the world. In addition to Huafa, Sunac-BonSki operates Guangzhou Sunac Snow Park, Wuxi BonSki, and Chongqing BonSki, previously named “Snow World.” Related: China’s Indoor Ski Center Boom Levels Up as the Largest Indoor Ski Center Huafa Snow Opens on September 29 The deal opens direct access to China’s rapidly expanding snow sports market and strengthens NZSki’s position as a global leader in alpine experiences. China is now one of the fastest-growing ski markets globally. During the 2024–25 season, th",
      "pub_date": "Thu, 04 Dec 2025 03:40:18 +0000",
      "id": "63c4e1cd0e40",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    },
    {
      "source": "SnowBrains",
      "title": "Western U.S. Experiences Slowest Start to Winter in Decades—But Just How Bad Is It?",
      "url": "https://snowbrains.com/western-u-s-experiences-slowest-start-to-winter-in-decades-but-just-how-bad-is-it/",
      "description": "There is no question that this winter is off to a strange start. Arizona Snowbowl has received 57 inches of snow so far this season, ski resorts across the midwest stacked up over a foot of snow after Thanksgiving, and Jay Peak, Vermont broke a 25-year-old record, logging 100 inches of snowfall by Thanksgiving. Yet, across the western part of […] The post Western U.S. Experiences Slowest Start to Winter in Decades—But Just How Bad Is It? appeared first on SnowBrains .",
      "content": "Spring snowpacks seem like a long, long way off in the Western U.S., with one of the slowest starts to the season in decades. | Photo: Zach Armstrong There is no question that this winter is off to a strange start. Arizona Snowbowl has received 57 inches of snow so far this season, ski resorts across the midwest stacked up over a foot of snow after Thanksgiving, and Jay Peak, Vermont broke a 25-year-old record, logging 100 inches of snowfall by Thanksgiving . Yet, across the western part of the country, the vast majority of ski areas remain closed, with snow and even cold temperatures for snowmaking remaining elusive. Related: [PHOTOS] Vermonts Jay Peak Smashes 25-Year-Old Record Hitting 103 Inches of Snowfall Already this Season Mountain snowpacks provide essential storage of water during the winter, then feed streams and rivers throughout the summer, providing a critical source of water for many ecosystems. Humans also rely on snow-fed water sources, so the Federal Government and aro",
      "pub_date": "Wed, 03 Dec 2025 22:13:33 +0000",
      "id": "4ecb9f0b6fed",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    },
    {
      "source": "SnowBrains",
      "title": "In China’s Far Altay Mountains, Hemu Village Rises as a Freeride Destination Amidst a Booming Ski Industry",
      "url": "https://snowbrains.com/in-chinas-far-altay-mountains-hemu-village-rises-as-freeride-destination-amidst-a-booming-ski-industry/",
      "description": "China’s ski industry is thriving. Driven by national policy, heavy investment, and a surge of new participants following the 2022 Beijing Winter Olympics, the country is experiencing sustained, rapid growth across nearly every metric tied to winter sports. Related: Himalaya 500: A Project to Ski 500 Lines in the Planet’s Highest Mountain Range Industry reports from the 2024-25 season show skier […] The post In China’s Far Altay Mountains, Hemu Village Rises as a Freeride Destination Amidst a Boo",
      "content": "Professional Austrian freerider Tao Kreibich took a ski trip to Hemu Village in China’s Altay Mountains in November 2025 and had the experience of a lifetime. | Photo: Tao Kreibich China’s ski industry is thriving. Driven by national policy, heavy investment, and a surge of new participants following the 2022 Beijing Winter Olympics, the country is experiencing sustained, rapid growth across nearly every metric tied to winter sports. Related: Himalaya 500: A Project to Ski 500 Lines in the Planet’s Highest Mountain Range Industry reports from the 2024-25 season show skier visits reaching roughly 26 million, up about 13 percent year over year, continuing the double-digit rebound that followed China’s pandemic reopening. The country now operates roughly 740-750 ski resorts —more than any nation in the world. That total includes 66 indoor centers, with visits to indoor slopes surpassing 5.5 million last winter, or more than one-fifth of all skier visits nationwide, according to a China Sk",
      "pub_date": "Wed, 03 Dec 2025 20:12:53 +0000",
      "id": "e08c2fa06a03",
      "score": 5,
      "score_details": {
        "reason": "Scoring failed"
      }
    }
  ],
  "rejected": [
    {
      "source": "The Ski Diva",
      "title": "Getting the most out of ski school.",
      "url": "https://www.theskidiva.com/getting-the-most-out-of-ski-school-2/",
      "description": "I recently spent a week in Taos. It was great for two reasons: First, it was our annual Ski Diva gathering, a/k/a Diva West, and that’s always a blast. And second, it coincided with the resort’s Women’s Ski Week, a 6-day mornings-only clinic just for us girls. A friend of mine (who doesn’t ski) was... The post Getting the most out of ski school. appeared first on The Ski Diva .",
      "content": "I recently spent a week in Taos. It was great for two reasons: First, it was our annual Ski Diva gathering, a/k/a Diva West, and that’s always a blast. And second, it coincided with the resort’s Women’s Ski Week, a 6-day mornings-only clinic just for us girls. A friend of mine (who doesn’t ski) was... The post Getting the most out of ski school. appeared first on The Ski Diva .",
      "pub_date": "Tue, 14 Mar 2023 15:02:32 +0000",
      "id": "44c2d0302097",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "The Ski Diva",
      "title": "Seven things you can use when it’s super cold.",
      "url": "https://www.theskidiva.com/seven-things-you-can-use-when-its-super-cold/",
      "description": "(Map from NECN) It’s -10F at my house right now. Tonight it’s supposed to get down to -23, with wind chills that are straight out scary. As you’ve probably heard, the Northeast is in the grip of an Arctic blast. Here in Vermont, many schools are closed, and a number of ski areas are either closed... The post Seven things you can use when it’s super cold. appeared first on The Ski Diva .",
      "content": "(Map from NECN) It’s -10F at my house right now. Tonight it’s supposed to get down to -23, with wind chills that are straight out scary. As you’ve probably heard, the Northeast is in the grip of an Arctic blast. Here in Vermont, many schools are closed, and a number of ski areas are either closed... The post Seven things you can use when it’s super cold. appeared first on The Ski Diva .",
      "pub_date": "Fri, 03 Feb 2023 20:54:54 +0000",
      "id": "5dcc470c211e",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "The Ski Diva",
      "title": "How to make 2023 the best ski year ever.",
      "url": "https://www.theskidiva.com/how-to-make-2023-the-best-ski-year-ever/",
      "description": "Happy New Year, everyone! Here’s to another successful journey around the sun. 2023 stretches out before us fresh and unspoiled, like untracked powder on your favorite run. I’m not one for New Year’s resolutions; to me, they seem pretty arbitrary. If you want to change, you should do it whenever you’re ready. Nonetheless, I’m sure... The post How to make 2023 the best ski year ever. appeared first on The Ski Diva .",
      "content": "Happy New Year, everyone! Here’s to another successful journey around the sun. 2023 stretches out before us fresh and unspoiled, like untracked powder on your favorite run. I’m not one for New Year’s resolutions; to me, they seem pretty arbitrary. If you want to change, you should do it whenever you’re ready. Nonetheless, I’m sure... The post How to make 2023 the best ski year ever. appeared first on The Ski Diva .",
      "pub_date": "Mon, 02 Jan 2023 10:31:46 +0000",
      "id": "8f9283d3dd9c",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "The Ski Diva",
      "title": "How to survive skiing during the holidays.",
      "url": "https://www.theskidiva.com/how-to-survive-skiing-during-the-holidays-2/",
      "description": "For a lot of people, Christmas week isn’t complete without skiing. You’re off from work, the fam is together, and besides, you have all those vacation days you have to use up. Nonetheless, this isn’t the easiest time to be out on the mountain. There are loads of like-minded individuals who are going to be... The post How to survive skiing during the holidays. appeared first on The Ski Diva .",
      "content": "For a lot of people, Christmas week isn’t complete without skiing. You’re off from work, the fam is together, and besides, you have all those vacation days you have to use up. Nonetheless, this isn’t the easiest time to be out on the mountain. There are loads of like-minded individuals who are going to be... The post How to survive skiing during the holidays. appeared first on The Ski Diva .",
      "pub_date": "Tue, 13 Dec 2022 10:48:17 +0000",
      "id": "5927bb826e68",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "The Ski Diva",
      "title": "Today is Giving Tuesday. Here’s how you can help, ski style.",
      "url": "https://www.theskidiva.com/today-is-giving-tuesday-heres-how-you-can-help-ski-style/",
      "description": "(Photo from Coombs Outdoors) Thanksgiving has come and gone, and our annual consumer binge-fest is fully underway. It’s kind of hard to avoid. The commercials have been running since Halloween, the stores and online shopping sites are offering deals you simply can’t pass up, and money goes faster than Santa sliding down a chimney. And while giving... The post Today is Giving Tuesday. Here’s how you can help, ski style. appeared first on The Ski Diva .",
      "content": "(Photo from Coombs Outdoors) Thanksgiving has come and gone, and our annual consumer binge-fest is fully underway. It’s kind of hard to avoid. The commercials have been running since Halloween, the stores and online shopping sites are offering deals you simply can’t pass up, and money goes faster than Santa sliding down a chimney. And while giving... The post Today is Giving Tuesday. Here’s how you can help, ski style. appeared first on The Ski Diva .",
      "pub_date": "Tue, 29 Nov 2022 11:46:07 +0000",
      "id": "f6bad5e509fe",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "The Ski Diva",
      "title": "Ski Diva’s Holiday Gift Guide, 2022",
      "url": "https://www.theskidiva.com/ski-divas-holiday-gift-guide-2022/",
      "description": "Listen! Did you hear that? Yes — it’s the sound of sleigh bells in the distance. And each day they’re getting closer…and closer….and closer. Which means it’s time for the annual Ski Diva’s Holiday Gift Guide, filled with lots of great things you might want Santa to bring down the chimney for you or someone you love. So... The post Ski Diva’s Holiday Gift Guide, 2022 appeared first on The Ski Diva .",
      "content": "Listen! Did you hear that? Yes — it’s the sound of sleigh bells in the distance. And each day they’re getting closer…and closer….and closer. Which means it’s time for the annual Ski Diva’s Holiday Gift Guide, filled with lots of great things you might want Santa to bring down the chimney for you or someone you love. So... The post Ski Diva’s Holiday Gift Guide, 2022 appeared first on The Ski Diva .",
      "pub_date": "Tue, 15 Nov 2022 11:47:43 +0000",
      "id": "309c03de280f",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "The Ski Diva",
      "title": "How to buy used gear.",
      "url": "https://www.theskidiva.com/how-to-buy-used-gear/",
      "description": "I’ve often wondered how people can afford to ski. Between lift passes, apparel, skis, boots, travel, and food, it’s pretty easy to drop a ton of money. And as expensive as it is for one person, it can get really pricey when an entire family’s involved. Luckily, there are lots of ways to save money. And one... The post How to buy used gear. appeared first on The Ski Diva .",
      "content": "I’ve often wondered how people can afford to ski. Between lift passes, apparel, skis, boots, travel, and food, it’s pretty easy to drop a ton of money. And as expensive as it is for one person, it can get really pricey when an entire family’s involved. Luckily, there are lots of ways to save money. And one... The post How to buy used gear. appeared first on The Ski Diva .",
      "pub_date": "Tue, 08 Nov 2022 11:57:17 +0000",
      "id": "bc682bf1e11f",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Wyoming’s Second-Oldest Ski Resort Reveals Rebrand, Fresh Track Thursdays",
      "url": "https://unofficialnetworks.com/2025/12/04/white-pine-wyoming-rebrand/",
      "description": "A modestly sized Wyoming ski resort has revealed its first major changes since it was bought by a billionaire in 2024.",
      "content": "Sublette County, Wyoming — After a billionaire came through and purchased a ski resort in 2024, there were no immediate changes. However, the White Pine Resort just announced its first notable changes since new ownership arrived. Yesterday, White Pine Resort revealed its rebrand. This includes a new logo, website, and trail map. The logo is simple and evokes a mountainous environment. The new website is working through the kinks, but it’s modern and easy to use. The new trail map shows the trail and provides a better perspective on its surroundings than the prior map. This rebrand will also include new gear and clothes at the ski resort’s retail shop. View this post on Instagram The other major change is to its operating schedule. The ski resort will now operate Thursday-Sunday, and on select Mondays (i.e., Holiday periods). This will allow for “Fresh Tracks Thursdays,” with the possibility of guests getting a couple of days’ worth of powder. Ski Gear Review 2025: The Must-Have Upgrade",
      "pub_date": "Thu, 04 Dec 2025 22:07:07 +0000",
      "id": "fa2ca1f3db54",
      "score": 2,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Terrifying Rockfall Serves As Reminder That Helmets Aren’t Just Accessories In The Mountains",
      "url": "https://unofficialnetworks.com/2025/12/04/helmets-rockfall-mountaineering/",
      "description": "In both mountaineering and climbing, a helmet won't protect you much from a fall, but they'll certainly keep you safe from falling rocks.",
      "content": "In some sports, the requirement of a helmet can feel a bit more like an accessory than an actually needed piece of equipment. In both mountaineering and climbing, a helmet won’t protect you much from a fall, but they’ll certainly keep you safe from falling rocks. This video, shared by Dallas Poulson , demonstrates that concept. The clip was captured on Gran Paradiso’s standard route in the Italian Alps. Fortunately nobody was hurt, but it’s still a good reminder as to why helmets are so important. View this post on Instagram A post shared by Dallas Poulson (@dallaspoulson) If either of the big chunks had hit a person, a helmet probably wouldn’t have done much life saving. But all of the smaller chunks created by the large fall could do plenty of damage, including deadly damage, to someone who wasn’t wearing a helmet. Viral TikTok Video Prompts ZARA To Change Ski Suit Description From Waterproof to Water Resistant Categories: Italy Climbing",
      "pub_date": "Thu, 04 Dec 2025 21:17:05 +0000",
      "id": "ba5689e109e8",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Western Canada’s 18 Top Ski Resorts",
      "url": "https://unofficialnetworks.com/2025/12/04/western-canada-ski-resorts/",
      "description": "PeakRankings set out to rank the ski resorts of Western Canada, ranking from #18 to #1.",
      "content": "Canada has a lot of ski resorts both in the East and the West, but when it comes to fly-to destinations, most people are heading into or west of the Rocky Mountains. Even once you’ve decided to head to Western Canada, though, the number of ski resort options can be overwhelming. PeakRanking s set out to rank the ski resorts of Western Canada, ranking from #18 to #1. PeakRankings 18 Best Ski Resorts in Western Canada: 18. Nikkisa 17. Mount Norway 16. Kimberly 15. Apex 14. Castle Mountain 13. Fernie 12. Red Mountain 11. Silverstar 10. Whitewater 9. Panorama 8. Sun Peaks 7. Kicking Horse 6. Marmet Basin 5. Big White 4. Revelstoke 3. Lake Louise 2. Banff Sunshine Village 1. Whistler Blackcomb The Largest Cross-Country Ski Resort In North America Is In California Categories: Canada Skiing Snowboarding",
      "pub_date": "Thu, 04 Dec 2025 20:38:14 +0000",
      "id": "bb958b5b9c4d",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Snowbasin Resort Announces Opening Date With Hilarious Video",
      "url": "https://unofficialnetworks.com/2025/12/04/snowbasin-opening-day-announcement/",
      "description": "Snowbasin Resort in Utah is officially opening for the 2025/2026 season (their 85th opening day) this Friday, December 5th.",
      "content": "Snowbasin Resort in Utah is officially opening for the 2025/2026 season (their 85th opening day) this Friday, December 5th, with top-to-bottom skiing and 2,500’ of vertical terrain. To announce their opening day they shared the following video, a hilarious clip that undoubtedly took some planning and work to accomplish. View this post on Instagram A post shared by Snowbasin Resort (@snowbasinresort) Opening weekend at Snowbasin will include three lifts, Needles Gondola, Middle Bowl Express, and Littlecat Express, with plans to open additional lifts in the near future. Every trail set to open for the first day of the season will be indicated on Snowbasin’s Mountain Report by Friday, but will include Sweet Revenge, Bullwinkle, the newly expanded Bear Hollow, School Hill, Snowshoe, and more. To celebrate their 85th birthday, Snowbasin will be handing out 850 free cookies and the first 100 people in line will receive jersey tank tops with the number 85. Monster Energy will also be on mount",
      "pub_date": "Thu, 04 Dec 2025 18:56:58 +0000",
      "id": "ebe39cd9ebec",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Who’s At Fault In This On Mountain Collision?",
      "url": "https://unofficialnetworks.com/2025/12/04/whos-at-fault-in-this-on-mountain-collision/",
      "description": "Who's to blame for this skier/snowboarder collision that occurred on the slopes of Keystone?",
      "content": "Ski/snowboard collisions are often pretty cut and dry. The downhill skier has the right of way, thus when an accident occurs it’s generally the uphill skier who gets the blame. But occasionally accidents occur that aren’t so simply analyzed. This appears to be one of those accidents. The skier and snowboarder both come around a corner, see each other, and slam on the breaks, but they notice too late. Both parties should not have been entering a blind spot that quickly, so it seems like both deserve some blame. It’s always important that you stay in control and always be aware of what’s below you on the slopes. In this case, the accident occurred in what looks like the start of a lift line, a place where you absolutely should not be going at high speeds. If you’re going a speed around a blind corner with enough speed that you won’t be able to stop if something appears in front of you, then you’re going too fast, plain and simple. NSAA Skier’s Responsibility Code: Always stay in control.",
      "pub_date": "Thu, 04 Dec 2025 16:22:53 +0000",
      "id": "5f790baaf66d",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Alta Announces Opening Date For 2025-26 Season",
      "url": "https://unofficialnetworks.com/2025/12/04/alta-opening-date-2025-26/",
      "description": "After delaying its opening due to warm weather and a lack of snow, Alta will start its ski season early next week.",
      "content": "Alta, Utah — Last night, Alta announced some exciting news, as Utah’s snowiest ski area revealed its opening day for the 2025-26 season. Starting on Sunday, the Sunnyside and Collins lifts are scheduled to operate, and more lifts and terrain could open up depending on how much snow they get this weekend. For more information, check out Alta’s press release below. 88 YEARS OF ALTA STARTS SUNDAY Located in the incomparable alpine setting of the Wasatch Mountains at an elevation of 8,530 feet, Alta Ski Area offers legendary powder snow and an atmosphere steeped in tradition. Alta Ski Area has served as a powder haven for skiers across the globe for nearly nine decades— 88 years and counting. Help us commemorate a major milestone this winter by joining the Alta family in leaving some Powder 8s in fresh snow alongside your friends. Make your mark on the mountain with us for Alta’s special 88th Anniversary by tagging @altaskiarea and using #Alta88th. After patiently waiting for winter’s arri",
      "pub_date": "Thu, 04 Dec 2025 11:00:00 +0000",
      "id": "f8419414b68a",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Palisades Tahoe Introduces Limited Membership Club For “The Best Experience On This Mountain”",
      "url": "https://unofficialnetworks.com/2025/12/03/palisades-tahoe-introduces-limited-membership-club-for-the-best-experience-on-this-mountain/",
      "description": "Palisades Tahoe just announced an exclusive new offering for winter 2025/2026 with the introduction of The Apex Club which is a “limited quantity membership designed to make every moment on the mountain seamless—from arrival to après.” Palisades is limiting memberships to 200 for the 2025–26 season for the program will “blend private lounge spaces, concierge support, priority lift […]",
      "content": "Palisades Tahoe just announced an exclusive new offering for winter 2025/2026 with the introduction of The Apex Club which is a “limited quantity membership designed to make every moment on the mountain seamless—from arrival to après.” Palisades is limiting memberships to 200 for the 2025–26 season for the program will “blend private lounge spaces, concierge support, priority lift access, and streamlined parking within an intentionally limited, refined experience.” How much for this exclusive VIP style club…. “Memberships begin at $12,000 for purchases made by December 11, 2025.” THey also have day passes available, prices fluctuate . Find the full details below The Apex Club: Apex Club Membership — Full-Season Access Apex Club Membership is a full-season experience. Membership includes: Apex Lounge The Apex Lounge is the heart of the Apex Club experience—a refined, private space designed to make the start, middle, and end of each ski day effortless. Members enjoy complimentary contine",
      "pub_date": "Wed, 03 Dec 2025 22:12:40 +0000",
      "id": "5012cc5df7cd",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "Ski Area Improvements Planned At Washington’s Largest State Park",
      "url": "https://unofficialnetworks.com/2025/12/03/improvements-washingtons-largest-state-park/",
      "description": "If the master plan is implemented, Washington's largest state park would see improvements that benefit skiers, hikers, and bikers.",
      "content": "Washington — A state park that’s home to a popular ski area could see some changes in the years ahead. This year, Mt. Spokane State Park has been working on a revised master plan . This includes the entire state park, which is home to Mt. Spokane Ski & Snowboard Park , as well as various offseason activities around the over 12,000 acre park. According to the Spokesman-Review , Washington State Parks intends to improve the four-season experience across the land, including at the ski area. For context, here’s a map of the state park, which includes the ski area. In the first phase, plans include replacing the Bear Creek Lodge, removing the existing Maintenance shop, replacing the Vista chairlift, adding new trails (multi-use and biking), and improving signage. The master plan’s biggest project is the Bear Creek Lodge, which serves as the park’s entry point. The plan to remove and replace appears to be cheaper than renovating it. In its place would be a new visitor’s center. The second ph",
      "pub_date": "Wed, 03 Dec 2025 21:44:49 +0000",
      "id": "fe6f9047130d",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    },
    {
      "source": "Unofficial Networks",
      "title": "French Ski Resort Won’t Operate This Winter Due To Financial Deficit",
      "url": "https://unofficialnetworks.com/2025/12/03/chalmazel-ski-resort-wont-operate/",
      "description": "The last operating ski resort in the French region of Loire won't operate this winter due to a large deficit.",
      "content": "Massif Central, France — Is a popular French ski resort closing for good? It’s what locals are fearing following the announcement that it won’t be operating this winter. The Connexion reported in October that the Chalmazel ski resort wouldn’t be operating this winter. This is due to the need to renovate aging equipment and a deficit of up to €450,000. After this announcement, locals launched a valiant campaign to get it reopened, including a petition to keep the mountain open. That appears to be all for naught, as last month, the Loire department confirmed it wouldn’t operate this winter. “This is a painful but responsible decision. The department can no longer ignore the combined impact of finances and the climate. Preserving safety, protecting public finances, and preparing for the future are our primary duties,” said Georges Ziegler, President of Loire, in October. The video is in French, but captions are available in English. Chalmazel is by no means a large ski resort, especially ",
      "pub_date": "Wed, 03 Dec 2025 18:48:52 +0000",
      "id": "093145b5f4dd",
      "score": 4,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      }
    }
  ]
}