{
  "updated": "2025-12-14 11:12:07",
  "total_articles": 50,
  "articles": [
    {
      "source": "Washington Post",
      "title": "Fed lowers interest rates again amid debate over inflation, jobs",
      "url": "https://www.washingtonpost.com/business/2025/12/10/federal-reserve-rate-cut-stagflation/",
      "description": "The Federal Reserve cut interest rates by a quarter of a percentage point, seeking to steady a softening labor market.",
      "content": "The Federal Reserve cut interest rates by a quarter of a percentage point, seeking to steady a softening labor market.",
      "pub_date": "Wed, 10 Dec 2025 21:50:16 +0000",
      "id": "e085653aa583",
      "score": 7,
      "score_details": {
        "relevance": 6,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article about the Federal Reserve's interest rate cut is moderately relevant to the ski industry, as it could impact consumer spending and business operations. While not directly about the ski industry, it provides important economic context that ski businesses should be aware of."
      },
      "approved_date": "2025-12-11",
      "category": "resort-operations",
      "secondary_categories": []
    },
    {
      "source": "New York Times - Travel",
      "title": "U.S. Plans to Scrutinize Foreign Tourists’ Social Media History",
      "url": "https://www.nytimes.com/2025/12/09/travel/social-media-tourists-visa-border-patrol.html",
      "description": "Even visitors from countries like Britain and France, whose citizens don’t need visas, would have to share five years’ worth of social media.",
      "content": "Even visitors from countries like Britain and France, whose citizens don’t need visas, would have to share five years’ worth of social media.",
      "pub_date": "Wed, 10 Dec 2025 00:29:07 +0000",
      "id": "f088fabcdc62",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 8,
        "quality": 8,
        "overall": 8,
        "reason": "This article directly impacts the ski industry by discussing changes to foreign tourist travel policies, which could significantly affect visitation and revenues for ski destinations. The New York Times is a reputable source providing substantive, timely reporting on this important issue."
      },
      "approved_date": "2025-12-10",
      "category": "ski-history",
      "secondary_categories": []
    },
    {
      "source": "New York Times - Travel",
      "title": "National Park Service Will Close All Grand Canyon Hotels for Water Line Repairs",
      "url": "https://www.nytimes.com/2025/12/03/travel/grand-canyon-hotels-closed-south-rim.html",
      "description": "The National Park Service said seven hotels would temporarily close starting on Saturday after “significant breaks” in a crucial 12.5-mile water line.",
      "content": "The National Park Service said seven hotels would temporarily close starting on Saturday after “significant breaks” in a crucial 12.5-mile water line.",
      "pub_date": "Wed, 03 Dec 2025 20:40:23 +0000",
      "id": "2a4d869dadc0",
      "score": 7,
      "score_details": {
        "relevance": 7,
        "news_value": 8,
        "quality": 7,
        "overall": 7,
        "reason": "This story about water line repairs forcing the temporary closure of hotels in the Grand Canyon National Park is moderately relevant to the ski industry, as it highlights the operational challenges and infrastructure needs that can impact resort destinations, especially in remote areas. The story has high news value and comes from a reputable source, the New York Times, so it would be a good fit for a ski business news feed."
      },
      "approved_date": "2025-12-08",
      "category": "hospitality"
    },
    {
      "source": "Unofficial Networks",
      "title": "Canada’s Scariest Ski Run Is Guarded By Military-Like Security",
      "url": "https://unofficialnetworks.com/2025/12/03/canadas-scariest-ski-run/",
      "description": "Canada is home to a lot of proper expert in-bound ski runs, but few are quite as intimidating as Sunshine Village’s Delirium Dive.",
      "content": "Canada is home to a lot of intense ski resorts with some proper expert in-bound terrain, but few are quite as intimidating as Sunshine Village’s Delirium Dive. It’s an in-bound run and it’s mitigate by ski patrol, but the trail is still guarded with some serious security. To get onto the run, skiers must first pass through a gate that ensures they’re wearing an avalanche beacon. Additionally, the resort requires that all who attempt it have full avalanche gear and are with a partner. That’s not unheard of at ski resorts in North America, but it’s certainly rare. German ski instructor Marius Quast took on the wild run while visiting the continent. Skiers who pass through the intimidating gate (with avalanche gear and a partner) are able to access a fair number of options to check out, including some wild chutes with 2,500 feet of steep vertical and open bowls. Bizarre Slopeside Encounter Leads to Two Disorderly-Conduct Summons at Colorado Ski Resort Categories: Canada Skiing Snowboardin",
      "pub_date": "Wed, 03 Dec 2025 19:27:25 +0000",
      "id": "1ca26062be7f",
      "score": 7,
      "score_details": {
        "relevance": 7,
        "news_value": 7,
        "quality": 6,
        "overall": 7,
        "reason": "This article provides interesting information about the security measures in place at Sunshine Village's Delirium Dive ski run in Canada, which is relevant for ski resort business operations and may be of interest to the ski industry. However, the article focuses more on the experience of the run rather than the business implications, and the reporting quality is moderate."
      },
      "approved_date": "2025-12-04",
      "category": "canada"
    },
    {
      "source": "Unofficial Networks",
      "title": "West Virginia’s Ski Season Kicks Off On Thursday, December 4th",
      "url": "https://unofficialnetworks.com/2025/12/03/west-virginia-ski-season-starts/",
      "description": "Three West Virginia ski resorts are set to open up for the 2025/2026 winter season this week, the first of which opens Thursday.",
      "content": "Three West Virginia ski resorts are set to open up for the 2025/2026 winter season this week, the first of which opens tomorrow, Thursday, December 4th. View this post on Instagram A post shared by Timberline Mountain (@timberlinemountain) Timberline Mountain in Davis is opening first, with snowmaking teams working hard to get the area’s most popular terrain ready for the season. It’s not yet clear exactly what terrain will be open tomorrow, though more and more terrain will gradually open following the first day of the season. Between December 4th and December 11th, “Bonus Day” lift tickets will cost just $69 and rentals will cost just $29 per day. Snowshoe Mountain in Snowshoe will open up on Friday, December 5th, with the mountain operations team similarly working very hard to take advantage of cold weather for snowmaking. Opening day is expected to include terrain in the central Basin area with a terrain park setup in Progression Park and potentially a blue or two. Up until Decembe",
      "pub_date": "Wed, 03 Dec 2025 16:21:37 +0000",
      "id": "a0f40510a8ae",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "New York Times - Travel",
      "title": "How to Ski: A Beginner’s Guide",
      "url": "https://www.nytimes.com/2025/12/03/travel/tips-for-first-time-skiers.html",
      "description": "What to know about gear, ski passes, classes and more.",
      "content": "What to know about gear, ski passes, classes and more.",
      "pub_date": "Wed, 03 Dec 2025 10:00:31 +0000",
      "id": "27345adc621b",
      "score": 6,
      "score_details": {
        "relevance": 6,
        "news_value": 7,
        "quality": 7,
        "overall": 6,
        "reason": "The article provides a general beginner's guide to skiing, which has moderate relevance to the ski industry business. While it contains useful information for new skiers, it lacks substantive business news or analysis that would be most valuable for a ski industry news feed."
      },
      "approved_date": "2025-12-08",
      "category": "resort-operations"
    },
    {
      "source": "Washington Post",
      "title": "How tariffs hit the brakes on America’s booming e-bike industry",
      "url": "https://www.washingtonpost.com/business/2025/12/06/ebike-rad-power-tariffs/",
      "description": "Rad Power Bikes saw its pandemic-era growth spurt blunted by import duties, overproduction and slowing demand. Now a spate of battery fires adds to its challenges.",
      "content": "Rad Power Bikes saw its pandemic-era growth spurt blunted by import duties, overproduction and slowing demand. Now a spate of battery fires adds to its challenges.",
      "pub_date": "Tue, 09 Dec 2025 10:00:00 +0000",
      "id": "be723bb70ef6",
      "score": 7,
      "score_details": {
        "relevance": 6,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article covers broader e-bike industry trends that may have some indirect impact on the ski industry, such as changes in outdoor recreation equipment and transportation options for skiers. However, the article is not directly focused on the ski industry itself."
      },
      "approved_date": "2025-12-09",
      "category": "resort-operations",
      "secondary_categories": []
    },
    {
      "source": "Unofficial Networks",
      "title": "Wishing Klaus Obermeyer A Happy 106th Birthday!",
      "url": "https://unofficialnetworks.com/2025/12/02/wishing-klaus-obermeyer-a-happy-106th-birthday/",
      "description": "Huge shoutout to Klaus Obermeyer who turned 106th today. Klaus was born in Germany in 1919 and witnessed the rise of Nazi fascism. He escaped Germany into Switzerland on skis. During the escape he was shot and fell off a cliff breaking his leg. Klaus managed to get out of the mountains alive and was […]",
      "content": "Huge shoutout to Klaus Obermeyer who turned 106th today. Klaus was born in Germany in 1919 and witnessed the rise of Nazi fascism. He escaped Germany into Switzerland on skis. During the escape he was shot and fell off a cliff breaking his leg. Klaus managed to get out of the mountains alive and was found by a sympathetic nurse who hid him in a Swiss hospital until the WW2 was over. Klaus then moved to Aspen in 1947 where he started Sport Obermeyer . During his first year as a ski instructor at Aspen, Klaus noticed all of the inadequacies of his students’ gear and headed to the drawing table. Klaus created nearly a dozen ski industry firsts, including quilted down parkas turtlenecks, dual construction ski boots, pre-shaped gloves, mirrored sunglasses, and high altitude sunscreen. Certified legend. We wish very happy 106th birthday! Categories: Skiing",
      "pub_date": "Tue, 02 Dec 2025 22:47:06 +0000",
      "id": "ccc5274418fb",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "ski-history"
    },
    {
      "source": "Unofficial Networks",
      "title": "The Best Upgrades At Utah Ski Resorts For The 2025-26 Season",
      "url": "https://unofficialnetworks.com/2025/12/02/utah-ski-resort-projects-2025/",
      "description": "From Deer Valley's expansion to Sundance's new inn, we've compiled a recap of the biggest improvements at Utah ski resorts.",
      "content": "Utah — While the home to the Greatest Snow on Earth is off to a slow start this winter, that doesn’t m ean it won’t catch its stride eventually. Utah is known for its snow, varied terrain, and recent infrastructure improvements. This ski season in Utah is marked by various transformative projects that will strengthen its appeal to guests and increase its readiness for the 2034 Olympics. With ski season officially underway in the Beehive State, it’s a good time to look at what’s new at Utah ski resorts. Here’s a rundown of the best improvements at Utah ski resorts for the 2025-26 season. Alta Bids Farewell To Their Longest Tenured Avalanche Dog Honorable Mentions Alta completed its Supreme lift realignment project, improving its reliability in the short and long term. Other upgrades include new Wyssen towers, a regrade of the High Traverse, and work has begun on expanding the Albion Base Lodge. Beaver Mountain completed its multi-year base lodge project. The new 26,000-square-foot Marge",
      "pub_date": "Tue, 02 Dec 2025 22:20:46 +0000",
      "id": "e0a7837b6d2c",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "Unofficial Networks",
      "title": "These Six North American Ski Resorts Are Having Great Starts To Their Seasons",
      "url": "https://unofficialnetworks.com/2025/12/02/north-american-ski-resorts-december/",
      "description": "While many ski regions in the US & Canada struck out last month, these six ski resorts had a great November.",
      "content": "This past November will mostly be remembered for its snowless scenes in mountainous locations across North America. Popular ski resorts in Colorado, Tahoe, and Utah had little snow, resulting in many jarring images and videos. However, it wasn’t all bad for North America’s ski industry. Snow arrived in Canada and parts of the Northeast early, allowing for some memorable starts to the season. Here are six ski resorts in North America that have great starts to their seasons. Banff Sunshine Village : If you’re looking to go on a ski vacation soon and have access to lots of terrain, Banff is the place to go. Banff Sunshine Village was the first to open for the season in Canada, thanks to lots of natural stuff. Currently, the ski resort already has 78 trails and 11 lifts open. So far this ski season, Sunshine Village has received 200 centimeters (6 feet 7 inches) of snow at its summit. Sunshine Village, Canada Lake Louise Ski Resort : Another thriving Banff ski resort is Lake Louise. Curren",
      "pub_date": "Tue, 02 Dec 2025 19:59:01 +0000",
      "id": "582688c48baf",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "canada"
    },
    {
      "source": "Unofficial Networks",
      "title": "Guide To Skiing One Of The Steepest Runs In North America",
      "url": "https://unofficialnetworks.com/2025/12/02/big-couloir-steep-skiing-guide/",
      "description": "Big Couloir starts at the top of Lone Peak, Big Sky's highest point. It drops over 1,400 vertical feet and reaches 50° at its steepest point.",
      "content": "There are some seriously steep ski runs around North America, with the title of “steepest” being thrown around here and there. You have to consider whether natural runs or only tree-cut runs count when considering the steepest, and whether or not runs with mandatory airs count. No matter the case, Big Couloir at Big Sky is easily one of the steepest. Big Couloir starts at the top of Lone Peak, Big Sky’s highest point. It drops over 1,400 vertical feet and reaches 50° at its steepest point. Skier Chris Walch got some pointers from Brenna Kelleher to prepare for this intimidating run. Big Couloir is one of Big Sky’s Triple Black Diamonds , a rating that only exists at a handful of resorts around the United States. It’s a rating created to increase guest education and awareness of the risks of skiing high alpine, high-consequence terrain, and is comparable to “Expert Terrain” ratings at other resorts. It’s also one of Big Sky’s Managed Access routes, meaning any guests skiing it must sign",
      "pub_date": "Tue, 02 Dec 2025 19:07:17 +0000",
      "id": "8f0bd8bb8219",
      "score": 7,
      "score_details": {
        "relevance": 7,
        "news_value": 6,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides information about one of the steepest ski runs in North America, which is relevant to ski enthusiasts and could be of interest to the ski industry. While it is not directly related to business operations, it touches on the challenge and experience of skiing at high-level terrain, which could be of interest to a ski business news feed."
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "Unofficial Networks",
      "title": "New Alberta Law Could Help Revive Famous Lost Ski Resort",
      "url": "https://unofficialnetworks.com/2025/12/02/fortress-mountain-revival-effort/",
      "description": "Perhaps the most famous lost ski resort in Canada could be on the comeback trail thanks to a new Alberta law.",
      "content": "Alberta — After years in limbo, Fortress Mountain is shaping up for a comeback. The question is how long it may take. Rocky Mountain Outlook reported last month that the current owners of Fortress Mountain Resort are working on a plan for the revival of the ski resort. The work is still in the early phases, and more approvals will be needed before work can begin. These new efforts are thanks to the All-Season Resorts Act. Passed in 2024, this Alberta law helps make it easier to build or revive a ski resort, such as Fortress Mountain. This is part of Alberta’s plan to increase its tourism revenue from nearly CAD$14.5 billion in 2025 to CAD$25 billion by 2035. Andrew Boitchenko, the Tourism and Sport Minister of Alberta, said the following about the proposal and the All-Season Resorts Act: “The regulatory framework for all-season resorts is still being finalized and no land has been designated at this time. Applications for designation will open once these foundational elements are in pl",
      "pub_date": "Tue, 02 Dec 2025 17:35:35 +0000",
      "id": "53f1543ccc25",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "canada"
    },
    {
      "source": "Unofficial Networks",
      "title": "Jackson Hole Mountain Resort Kicks Off 60th Anniversary Winter Season On Thursday",
      "url": "https://unofficialnetworks.com/2025/12/02/jackson-hole-opening-day/",
      "description": "Jackson Hole Mountain Resort is set to kick off their 60th anniversary winter season this Thursday, December 4th.",
      "content": "Jackson Hole Mountain Resort is set to kick off their 60th anniversary winter season this Thursday, December 4th, after delaying their opening day late last month. Continuous snowmaking efforts, 65 inches of snowfall at the summit, and 34 inches of snowfall mid-mountain have allowed for coverage across a significant portion of the north side of the resort. Three lifts will be open for the first day of the season, including Teewinot, Après Vous, and the Sweetwater Gondola up to the Mid-Station. Beginner and intermediate terrain will be available, though early season conditions and hazards will exist. View this post on Instagram A post shared by Jackson Hole Mountain Resort (@jacksonhole) The resort is hoping to announce addition terrain and lift openings heading into the weekend of December 6th-7th, or sooner if the conditions cooperate. The 2025-2026 winter season, the resort’s 60th Anniversary, will run until April 12th, lasting a total of 129 days. Several celebratory events will run",
      "pub_date": "Tue, 02 Dec 2025 16:53:19 +0000",
      "id": "1dca48659029",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "New York Times - Travel",
      "title": "The Coziest New Ski Lodges in the Alps",
      "url": "https://www.nytimes.com/2025/12/11/t-magazine/ski-lodge-alps-cozy-travel.html",
      "description": "Five of the most notable newcomers to Europe’s winter resort scene are small hotels with distinctive personalities — and enough amenities to keep indoor types happy too.",
      "content": "Five of the most notable newcomers to Europe’s winter resort scene are small hotels with distinctive personalities — and enough amenities to keep indoor types happy too.",
      "pub_date": "Thu, 11 Dec 2025 22:48:01 +0000",
      "id": "8549bfab80eb",
      "score": 7,
      "score_details": {
        "relevance": 7,
        "news_value": 6,
        "quality": 7,
        "overall": 7,
        "reason": "This article covers notable new ski lodge developments in the Alps, which is relevant ski industry news. While it doesn't dive deep into the business specifics, it provides a high-level overview of new hospitality offerings in key ski markets. The New York Times is a reputable source. Overall, this warrants inclusion in a ski business news feed, though it's not the most critical or in-depth coverage."
      },
      "approved_date": "2025-12-12",
      "category": "hospitality",
      "secondary_categories": [
        "international"
      ]
    },
    {
      "source": "SnowBrains",
      "title": "Grand Targhee, WY, Sets Opening Day for Friday, December 5, With 2 Lifts and Early-Season Deals",
      "url": "https://snowbrains.com/grand-targhee-wy-sets-opening-day-for-friday-december-5-with-2-lifts-and-early-season-deals/",
      "description": "Grand Targhee Resort will open for the 2025-26 winter season on Friday, December 5, with Shoshone and Huckleberry scheduled to spin for guests. The resort noted on social media that early-season conditions remain, and visitors are encouraged to respect all closures and ski and ride cautiously. “Snow is heading our way this weekend! Don’t forget to carpool and ride the […] The post Grand Targhee, WY, Sets Opening Day for Friday, December 5, With 2 Lifts and Early-Season Deals appeared first on Sn",
      "content": "Grand Targhee Resort will open for the 2025-26 season on Friday, December 5. | Photo Credit: Grand Targhee Resort Grand Targhee Resort will open for the 2025-26 winter season on Friday, December 5, with Shoshone and Huckleberry scheduled to spin for guests. The resort noted on social media that early-season conditions remain, and visitors are encouraged to respect all closures and ski and ride cautiously. “Snow is heading our way this weekend! Don’t forget to carpool and ride the shuttle!” – Grand Targhee To mark the start of the season, The Powder Cache is offering a buy-one-entrée, get-one-free deal through December 11 . Live music returns to The Trap this weekend as well, with Henry Pepin and The Moguls performing Friday and Saturday. Snow is expected to arrive over the weekend, and the resort is reminding guests to carpool or use shuttle services as conditions improve. Targhee also has more than just skiing and snowboarding. Guests can unwind with on-mountain massage services from ",
      "pub_date": "Thu, 04 Dec 2025 21:03:46 +0000",
      "id": "45b6097abb65",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "SnowBrains",
      "title": "Tahoe Fund Launches $10K Challenge to Improve Backcountry Access for All",
      "url": "https://snowbrains.com/tahoe-fund-launches-10k-challenge-to-improve-backcountry-access-for-all/",
      "description": "INCLINE VILLAGE, Nev. (Dec. 1, 2025) – The Tahoe region offers some of the best winter outdoor recreation in the world, but parking availability, snow removal, and limited trailheads often make the backcountry difficult to access. To help the Tahoe Backcountry Alliance tackle these issues, the Tahoe Fund is launching a new $10k matching challenge to the community. The first 100 […] The post Tahoe Fund Launches $10K Challenge to Improve Backcountry Access for All appeared first on SnowBrains .",
      "content": "The first 100 people to donate $35 or more by December 31, 2025, will unlock a $10,000 gift to Tahoe Backcountry Alliance (TBA) in celebration of their 10th anniversary. | Photo: Tahoe Fund INCLINE VILLAGE, Nev. (Dec. 1, 2025) – The Tahoe region offers some of the best winter outdoor recreation in the world, but parking availability, snow removal, and limited trailheads often make the backcountry difficult to access. To help the Tahoe Backcountry Alliance tackle these issues, the Tahoe Fund is launching a new $10k matching challenge to the community. The first 100 people to donate $35 or more by December 31, 2025, will unlock a $10,000 gift to Tahoe Backcountry Alliance (TBA) in celebration of their 10th anniversary. Donors to the challenge will also receive a TBA membership that corresponds to their gift level. Membership tiers are $35, $150, or $500, and include the following benefits: Every TBA member will receive a 3-month free trial with onX with 20% off an onX annual membership i",
      "pub_date": "Thu, 04 Dec 2025 19:37:12 +0000",
      "id": "38d286a722b6",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-04",
      "category": "transportation"
    },
    {
      "source": "SnowBrains",
      "title": "Top 9 Snowfall Totals of the Season So Far on the East Coast",
      "url": "https://snowbrains.com/top-9-snowfall-totals-of-the-season-so-far-on-the-east-coast/",
      "description": "It is no secret that when it comes to skiing, the East Coast has traditionally played the role of overlooked little sibling when compared to the towering mountain ranges from the Rockies westward. At the beginning of this season, however, as mountains in the Rockies and Cascades push back opening days while waiting for snow, parts of the Northeast have […] The post Top 9 Snowfall Totals of the Season So Far on the East Coast appeared first on SnowBrains .",
      "content": "Seasonal snowfall totals in the United States. Image: National Oceanic and Atmospheric Administration It is no secret that when it comes to skiing, the East Coast has traditionally played the role of overlooked little sibling when compared to the towering mountain ranges from the Rockies westward. At the beginning of this season, however, as mountains in the Rockies and Cascades push back opening days while waiting for snow, parts of the Northeast have enjoyed a historic start, with some snowfall totals pushing resorts into mid-season form in early December. The factors that may have led to this unprecedented start are as diverse as the regions represented on this list, and vary depending on who you talk to. Some give credit to the weak La Niña pattern established to start this winter—pushing the jet stream further north than usual and encouraging colder, wetter storms. Many lean into the logic of the lake effect : storms picking up moisture as they cross the relatively warm Great Lake",
      "pub_date": "Thu, 04 Dec 2025 19:19:21 +0000",
      "id": "77d5e48b1356",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 8,
        "quality": 7,
        "overall": 8,
        "reason": "This article provides timely and relevant information about snowfall totals on the East Coast, which is important for ski resort operations and the ski industry. The reporting is informative, though it could be more in-depth in some areas. Overall, this article would be a valuable addition to a ski business news feed."
      },
      "approved_date": "2025-12-04",
      "category": "weather-snow"
    },
    {
      "source": "SnowBrains",
      "title": "UDOT Backs Bus Expansion and Winter Tolls, Rejects Gondola Plan for Big Cottonwood Canyon, UT",
      "url": "https://snowbrains.com/udot-backs-bus-expansion-and-winter-tolls-rejects-gondola-plan-for-big-cottonwood-canyon-ut-2/",
      "description": "The Cottonwood Canyons in Utah are infamous for their infuriating red snake accessing the mountains. The Utah Department of Transportation has long been constructing proposals to mend this error with no prevail. The 2022 gondola proposal up Little Cottonwood Canyon invigorated the public and UDOT received the most responses on any proposal ever, totalling 50,000; 35,000 against the proposal and […] The post UDOT Backs Bus Expansion and Winter Tolls, Rejects Gondola Plan for Big Cottonwood Canyon",
      "content": "Big Cottonwood has been plagued by heavy ski traffic during the past several winters and the Utah Department of Transportation is strategizing for a solution. | Photo courtesy KUTV The Cottonwood Canyons in Utah are infamous for their infuriating red snake accessing the mountains. The Utah Department of Transportation has long been constructing proposals to mend this error with no prevail. The 2022 gondola proposal up Little Cottonwood Canyon invigorated the public and UDOT received the most responses on any proposal ever, totalling 50,000; 35,000 against the proposal and 15,000 for it. Along with public reaction, three companies have sued to stop construction of the gondola which has stalled the enactment of the other resolutions such as busses and tolls. Big Cottonwood Canyon suffers from this same traffic problem, and for both practical as well as public relation reasoning, they are proposing significantly increased bus service as the Big Cottonwood Canyon solution . Related: Will T",
      "pub_date": "Thu, 04 Dec 2025 19:19:03 +0000",
      "id": "82792bdc60bf",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 9,
        "quality": 7,
        "overall": 8,
        "reason": "This article provides timely and relevant information about a major transportation proposal affecting ski resort access in a key Utah ski destination. The reporting provides good context and details on the UDOT plan and the public reaction, though the writing could be tightened in places. Overall, this is a valuable news item for a ski industry audience."
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "SnowBrains",
      "title": "Palisades Tahoe, CA, Unveils Apex Club, a New $12,000 Membership Offering Priority Access and Private Lounges",
      "url": "https://snowbrains.com/palisades-tahoe-ca-unveils-apex-club-a-new-12000-membership-offering-priority-access-and-private-lounges/",
      "description": "Palisades Tahoe is elevating its premium guest offerings this winter with the launch of the Apex Club, a limited-availability membership designed to streamline every part of a ski day at the resort. The program debuts for the 2025-26 season with just 200 memberships, marking one of the most exclusive access tiers ever introduced at the California resort. Related: Top 10 […] The post Palisades Tahoe, CA, Unveils Apex Club, a New $12,000 Membership Offering Priority Access and Private Lounges appe",
      "content": "A digital rendering shows the new Apex Club at Palisades Tahoe. | Photo: Palisades Tahoe Palisades Tahoe is elevating its premium guest offerings this winter with the launch of the Apex Club, a limited-availability membership designed to streamline every part of a ski day at the resort. The program debuts for the 2025-26 season with just 200 memberships, marking one of the most exclusive access tiers ever introduced at the California resort. Related: Top 10 Memorable On-Mountain Dining Experiences in the West In a release shared by the resort, details show that the club centers around two private lounges with one at the base in Olympic Valley and another mid-mountain at Gold Coast, along with priority lift lanes, concierge support, and reserved parking close to the lifts . Memberships start at $12,000 for those who enroll before December 11 and remain valid from December 12, 2025, through April 12, 2026. The Apex Lounge acts as the program’s main hub, offering members a private space f",
      "pub_date": "Thu, 04 Dec 2025 18:33:38 +0000",
      "id": "2afccc4c4995",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides relevant information about a new premium membership offering at a major ski resort, Palisades Tahoe. The news is timely and the reporting is relatively balanced, though it may lack some depth in analysis. Overall, this is a newsworthy item that would be a good fit for a ski industry news feed."
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "Unofficial Networks",
      "title": "Parts Of The Alps Have Seen The Snowiest Start To The Season In 30 Years",
      "url": "https://unofficialnetworks.com/2025/12/04/alps-snowiest-start-to-season/",
      "description": "Europe is enjoying a rather successful start to winter so far, as the ChamonixSkiBum explained in his first Alps ski conditions roundup.",
      "content": "Parts of North America have been having a pretty rough start to the 2025/2026 ski season, with resorts across the west delaying their opening days by several weeks. Europe, on the other hand, is enjoying a rather successful start to winter so far, as the ChamonixSkiBum explained in his first Alps ski conditions roundup. Based on his explanation, late November was impressively snowy across the Alps, with the northwest region (specifically Savoie in France and Valais in Switzerland) seeing the most. Some areas, like Avoriaz, Flaine, and the Mont Blanc range, saw their snowiest late-November in nearly 30 years, with base depths reaching 1.5–2 meters. It looks like the weather might be changing a bit for the region, with temperatures rising and not much snow in the forecast. That said, there ins’t any major rain expected in the near future, so existing bases should hold strong. It’s looking like this could be a good year to head to Europe! Who’s At Fault In This On Mountain Collision? Cate",
      "pub_date": "Thu, 04 Dec 2025 18:15:10 +0000",
      "id": "23c91c0230c1",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides timely and relevant information about the snow conditions in the European Alps, which is valuable for ski resort operators and industry stakeholders. While it does not directly cover business news, the insights on early-season snowfall and weather trends can help inform strategic planning and operations decisions."
      },
      "approved_date": "2025-12-04",
      "category": "international"
    },
    {
      "source": "SnowBrains",
      "title": "SnowBrains Forecast: 3-4 Feet of Dense Snow For the PNW This Weekend",
      "url": "https://snowbrains.com/snowbrains-forecast-3-4-feet-of-dense-snow-for-the-pnw-this-weekend/",
      "description": "A robust and active pattern kicks off with a series of storms delivering heavy precipitation and fluctuating snow levels to the Pacific Northwest. A warm front Thursday transitions into a colder system by Friday night, offering a window of quality snowfall on Saturday before a potent atmospheric river threatens to scour the mountains with heavy rain and high-elevation snow early next […] The post SnowBrains Forecast: 3-4 Feet of Dense Snow For the PNW This Weekend appeared first on SnowBrains .",
      "content": "Credit: WeatherBell A robust and active pattern kicks off with a series of storms delivering heavy precipitation and fluctuating snow levels to the Pacific Northwest. A warm front Thursday transitions into a colder system by Friday night, offering a window of quality snowfall on Saturday before a potent atmospheric river threatens to scour the mountains with heavy rain and high-elevation snow early next week. A warm front is currently pushing into the region, bringing an initial round of precipitation that will transition into a stronger, colder system by Friday night. Thursday sees high snow levels, hovering around 6,000–8,000 feet in Oregon and 3,500–5,000 feet in Washington, meaning precipitation will likely start as rain or heavy, wet snow at most base areas. Winds will be a significant factor, particularly at higher elevations like Timberline and Bachelor, where gusts could scream upwards of 70–80 mph, likely impacting lift operations. By Friday night, a cold front sweeps through,",
      "pub_date": "Thu, 04 Dec 2025 17:38:26 +0000",
      "id": "39d5ee1be1dc",
      "score": 8,
      "score_details": {
        "relevance": 9,
        "news_value": 8,
        "quality": 8,
        "overall": 8,
        "reason": "This article provides timely and relevant information for ski resort operations, with detailed weather forecasting and potential impacts on snowfall and base area conditions. The reporting is informative and data-driven, rather than clickbait or fluff."
      },
      "approved_date": "2025-12-04",
      "category": "weather-snow"
    },
    {
      "source": "SnowBrains",
      "title": "Snowbasin, UT, to Open For Season Friday, December 5, with Top-to-Bottom Skiing",
      "url": "https://snowbrains.com/snowbasin-ut-to-open-for-season-friday-december-5-with-top-to-bottom-skiing/",
      "description": "Snowbasin will open for its 85th season on Friday, December 5. America’s Number 1 ranked ski resort for the second consecutive year by USA Today will debut with top-to-bottom skiing and 2,500’ of vertical terrain. Three lifts will be available including Needles Gondola, Middle Bowl Express and Littlecat Express, with additional lifts planned to open soon. Available trails will be […] The post Snowbasin, UT, to Open For Season Friday, December 5, with Top-to-Bottom Skiing appeared first on SnowBr",
      "content": "Snowbasin opens for its 85th skiing on Friday, December 5, with top-to-bottom skiing. | Photo: Snowbasin Snowbasin will open for its 85th season on Friday, December 5. America’s Number 1 ranked ski resort for the second consecutive year by USA Today will debut with top-to-bottom skiing and 2,500’ of vertical terrain. Three lifts will be available including Needles Gondola, Middle Bowl Express and Littlecat Express, with additional lifts planned to open soon. Available trails will be indicated on Snowbasin’s Mountain Report by Friday, but will include Sweet Revenge, Bullwinkle, the newly expanded Bear Hollow, School Hill, Snowshoe and more. A small terrain park will be available at the base of the resort on Littlecat trail. Opening Day festivities include DJ Richie T on Friday and great prizes. Snowbasin is giving away 850 free cookies to celebrate its 85th birthday, and the first 100 people in line will get jersey tank tops featuring the number 85. Monster Energy will be on the plaza h",
      "pub_date": "Thu, 04 Dec 2025 17:32:55 +0000",
      "id": "3ee2577d8305",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides timely and relevant information about the upcoming opening of Snowbasin Resort, a major ski destination in Utah. The details about the opening date, available terrain, and planned activities are valuable for ski industry stakeholders. However, the article lacks deeper analysis or industry context, which slightly reduces its overall news value and quality."
      },
      "approved_date": "2025-12-04",
      "category": "resort-operations"
    },
    {
      "source": "SnowBrains",
      "title": "SnowBrains Forecast: 3+ Feet for the Rockies This Week",
      "url": "https://snowbrains.com/snowbrains-forecast-3-feet-for-the-rockies-this-week/",
      "description": "A very active pattern targets the Northern Rockies through early next week, with the deepest new snow focused on the Tetons and southwest Montana while interior British Columbia, Idaho, northwest Montana, and the Canadian Rockies all pick up meaningful base-building storms and a milder, wetter stretch beyond. Expect a standout storm from Thursday night through Saturday, a secondary refresh Sunday […] The post SnowBrains Forecast: 3+ Feet for the Rockies This Week appeared first on SnowBrains .",
      "content": "Credit: WeatherBell A very active pattern targets the Northern Rockies through early next week, with the deepest new snow focused on the Tetons and southwest Montana while interior British Columbia, Idaho, northwest Montana, and the Canadian Rockies all pick up meaningful base-building storms and a milder, wetter stretch beyond. Expect a standout storm from Thursday night through Saturday, a secondary refresh Sunday into Monday, and then a shift toward warmer, still-active weather next week that favors continued upper-mountain accumulation but increasingly dense snow at lower elevations. The first main storm from Thursday night through Saturday centers on the Tetons and southwest Montana, delivering the most exciting powder potential of this cycle. Persistent northwest flow feeds several waves across western Wyoming and southwest Montana, producing sustained mountain snow for Grand Targhee, Jackson Hole, Big Sky, and Bridger Bowl. Snow levels run roughly 3,000 to 4,000 feet early, risi",
      "pub_date": "Thu, 04 Dec 2025 16:47:35 +0000",
      "id": "f18b297144e6",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 8,
        "quality": 7,
        "overall": 8,
        "reason": "This article provides a timely and relevant weather forecast for the Rockies, which is valuable information for ski resort operators and winter sports enthusiasts. The content is well-written and focused on the key details that would be of interest to the target audience."
      },
      "approved_date": "2025-12-04",
      "category": "weather-snow"
    },
    {
      "source": "Unofficial Networks",
      "title": "Solitude Mountain Resort Hosts First Ever Skimo World Cup in The United States",
      "url": "https://unofficialnetworks.com/2025/12/07/solitude-mountain-resort-hosts-first-ever-skimo-world-cup-in-the-united-states/",
      "description": "The ISMF kicked off the 2025/26 World Cup at Solitude Mountain Resort, marking the first time an ISMF World Cup was hosted in the United States.",
      "content": "﻿ Very cool scenes from the slopes of Utah where the ISMF kicked off the 2025/26 World Cup at Solitude Mountain Resort, marking the first time an ISMF World Cup was hosted in the United States. The action continues today so if you are skiing at Solitude make sure to pop over and check out the action. As the final qualification opportunity for athletes ahead of ski mountaineering’s Olympic debut at Milano-Cortina 2026, this event will bring together the world’s top competitors for two high-stakes days of Mixed Relay and Sprint racing. Check out the full replay from the day one below: World Cup Ski Mountaineering comes to Salt Lake City, Utah on December 6-7, 2025. “The ISMF is proud to open the 2025/26 World Cup season at Solitude Mountain Resort — marking the first time an ISMF World Cup will be hosted in the United States. As the final qualification opportunity for athletes ahead of ski mountaineering’s Olympic debut at Milano-Cortina 2026, this event will bring together the world’s t",
      "pub_date": "Sun, 07 Dec 2025 17:54:31 +0000",
      "id": "cf8e5aa3a013",
      "score": 8,
      "score_details": {
        "relevance": 9,
        "news_value": 8,
        "quality": 7,
        "overall": 8,
        "reason": "This article is highly relevant to the ski industry, as it covers the first-ever Skimo World Cup event held in the United States, which is a significant development for the sport. The news is timely and provides valuable information about the event and its implications for the upcoming 2026 Olympic debut of ski mountaineering. The reporting appears to be generally well-done, though it could be more in-depth in some areas. Overall, this article would be a strong addition to a ski business news feed."
      },
      "approved_date": "2025-12-07",
      "category": "winter-sports"
    },
    {
      "source": "Unofficial Networks",
      "title": "Montana Ski Area Starts Fundraiser To Replace Its Energy Source",
      "url": "https://unofficialnetworks.com/2025/12/07/turner-mountain-generator-fundraiser/",
      "description": "A non-profit Montana ski area has started a fundraiser to replace its over twenty-year-old generator with a new one.",
      "content": "Libby, Montana — Being off the grid can be challenging. It means that your access to power sources can be limited. This makes some remote ski areas rely on generators. This is the case for Turner Mountain , a small ski area (albeit with a pretty big vertical drop) in Montana. For power, it has been using a used generator from 2001. However, that generator is nearing the end of its usefulness. In response, Turner Mountain has started a fundraiser to install a new main electrical generator. If you’re interested in helping out, you can mail a check to the following address: Kootenai Winter Sports Ski Education Foundation, Inc. PO Box 210 Libby, MT 59923 Unfortunately, they aren’t doing Venmo or a GoFundMe, but I suggest to them that it would be a wise route to take in order to reach people outside of the area. Big Sky Marks Major Milestone With New Explorer Gondola About Turner Mountain Situated inside the Kootenai National Forest, Turner Mountain is a glimpse of what skiing used to be al",
      "pub_date": "Sun, 07 Dec 2025 14:00:00 +0000",
      "id": "b0bfc83898ed",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides relevant news about a small ski area's efforts to upgrade its power infrastructure, which is an important operational consideration for remote ski resorts. The news is timely and the reporting provides useful details, though it could be more in-depth."
      },
      "approved_date": "2025-12-07",
      "category": "resort-operations"
    },
    {
      "source": "Unofficial Networks",
      "title": "Is Kicking Horse The Most Extreme Ski Resort In Canada?",
      "url": "https://unofficialnetworks.com/2025/12/07/kicking-horse-extreme-ski-resort/",
      "description": "When it comes to extreme terrain at the ski resort, very little compares to Kicking Horse.",
      "content": "Canada is home to many ski resorts with a wide range terrain, including several of the largest ski resorts in North America. But when it comes to extreme terrain, very little compares to Kicking Horse . Kicking Horse has some proper challenging terrain, with steep. chutes, cliffs, couloirs, and lots of hike-to zones filling the mountain. Several of these hike-to zones include runs that require straight-lining or mandatory airs. Combining all of that, PeakRankings points to the British Columbia ski resort as one of Canada’s most extreme. @peakrankings @kickinghorsemtn boasts some of the most intense expert terrain in the world, with chutes, cliffs, and couloirs that are accessible directly off the lifts. And for those looking for an even greater challenge, the resort is home to copious hike-to terrain, with lines off these hikes that are even more gnarly than the ones off the lifts, often requiring mandatory straightlining or hidden cliff drops. And one of the craziest parts about Kicki",
      "pub_date": "Sun, 07 Dec 2025 12:30:00 +0000",
      "id": "b4d7c8535fee",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article discusses the extreme terrain and features of Kicking Horse, a prominent ski resort in Canada. It is relevant to ski resort operations and management, as it highlights the unique selling points and challenges of the resort. The news value is reasonably high, as it provides an in-depth look at a specific ski destination. The quality of the reporting is good, with a focus on facts and descriptions of the terrain, but it could be improved with more context or analysis."
      },
      "approved_date": "2025-12-07",
      "category": "canada"
    },
    {
      "source": "SnowBrains",
      "title": "Teen Climber Killed in Slab Avalanche on Zugspitze, Germany’s Highest Peak",
      "url": "https://snowbrains.com/teen-climber-killed-in-slab-avalanche-on-zugspitze-germanys-highest-peak/",
      "description": "A 19-year-old German climber was killed on Saturday when a small slab avalanche swept him 350 meters down the Stopelzieher route on the Zugspitze, Germany’s highest mountain on the border with Austria. He had been ascending the via ferrata with a 21-year-old companion when the slide broke above them shortly before 10 a.m. on December 5. Related: 29 Stranded Hikers […] The post Teen Climber Killed in Slab Avalanche on Zugspitze, Germany’s Highest Peak appeared first on SnowBrains .",
      "content": "The mountain rescue Ehrwald team was one of three Austrian teams on site. | Image: Bergrettung Ehrwald A 19-year-old German climber was killed on Saturday when a small slab avalanche swept him 350 meters down the Stopelzieher route on the Zugspitze, Germany’s highest mountain on the border with Austria. He had been ascending the via ferrata with a 21-year-old companion when the slide broke above them shortly before 10 a.m. on December 5. Related: 29 Stranded Hikers Rescued from Zugspitze, Germany’s Highest Mountain According to initial reports, the older climber was clipped into the fixed-rope section 20 meters above, when he saw the slab release and shouted a warning to his partner. His younger partner, who was not secured to the cable at that moment, could not avoid the avalanche and was swept away and carried down steep, rocky terrain by the snow masses. The 21-year-old was able to alert search and rescue immediately. The avalanche broke above the climber and swept him several hundr",
      "pub_date": "Sun, 07 Dec 2025 11:56:51 +0000",
      "id": "2fd95738e5d4",
      "score": 8,
      "score_details": {
        "relevance": 7,
        "news_value": 8,
        "quality": 8,
        "overall": 8,
        "reason": "This news article is relevant to the ski industry, as it reports on a fatal avalanche incident on a major ski destination in Germany. The news is timely and the reporting appears to be thorough and well-researched, without excessive sensationalism or fluff. The overall score of 8 indicates that this article would be a good candidate for inclusion in a ski business news feed."
      },
      "approved_date": "2025-12-07",
      "category": "safety-incidents"
    },
    {
      "source": "SnowBrains",
      "title": "15,670-Acre Powder Renegade Lodge, BC, Opens January 15 for Inaugural Catskiing Season",
      "url": "https://snowbrains.com/15670-acre-powder-renegade-lodge-bc-opens-january-15-for-inaugural-catskiing-season/",
      "description": "Powder Renegade Lodge launches its first season on January 15, 2026, in British Columbia’s Monashee Mountains. The new backcountry cat-skiing operation sits at 5,905 feet (1,800 meters) elevation and provides access to more than 15,000 acres of terrain. Operators promote the lodge as a base for first tracks on untouched lines. Related: [FOR SALE] Rare Opportunity to Own a Cat […] The post 15,670-Acre Powder Renegade Lodge, BC, Opens January 15 for Inaugural Catskiing Season appeared first on Sno",
      "content": "Legendary tree skiing. | Photo: Powder Renegade Lodge Powder Renegade Lodge launches its first season on January 15, 2026, in British Columbia’s Monashee Mountains. The new backcountry cat-skiing operation sits at 5,905 feet (1,800 meters) elevation and provides access to more than 15,000 acres of terrain. Operators promote the lodge as a base for first tracks on untouched lines. Related: [FOR SALE] Rare Opportunity to Own a Cat Ski Operation in the Legendary Monashee Mountains of British Columbia Powder Renegade Lodge features 15,670 acres of managed terrain, which is twice the size of Park City Mountain Resort, Utah, and consistently receives a staggering 15 meters (591 inches) of annual snowfall. The area features nine peaks exceeding 2,000 meters (6,560 feet), including Mount Tanner at 2,414 meters (7,919 feet), Mount Cochrane at 2,411 meters (7,910 feet), and Mount Noren at 2,301 meters (7,549 feet). Every run begins on a ridgeline and drops through perfectly spaced trees down int",
      "pub_date": "Sun, 07 Dec 2025 11:00:39 +0000",
      "id": "045c031d8ac3",
      "score": 8,
      "score_details": {
        "relevance": 9,
        "news_value": 8,
        "quality": 8,
        "overall": 8,
        "reason": "This article provides timely and relevant information about the opening of a new cat-skiing operation in British Columbia, which is of interest to the ski industry. The details about the size of the terrain, annual snowfall, and amenities are well-reported and not overly promotional. The information would be valuable for a ski business news feed."
      },
      "approved_date": "2025-12-07",
      "category": "resort-operations",
      "secondary_categories": [
        "canada"
      ]
    },
    {
      "source": "SnowBrains",
      "title": "NZ’s Alice Robinson Conquers Flying Mile Blizzard to Claim 2nd Consecutive Giant Slalom Win & Canada’s Valerie Grenier with a Home Podium at Mont-Tremblant, QC",
      "url": "https://snowbrains.com/nzs-alice-robinson-conquers-flying-mile-blizzard-to-claim-2nd-consecutive-giant-slalom-win-canadas-valerie-grenier-with-a-home-podium-at-mont-tremblant-qc/",
      "description": "In whiteout blizzard conditions on Mont-Tremblant’s Flying Mile piste, New Zealand’s Alice Robinson delivered a masterclass in tactical Giant Slalom skiing. The newly 24-year-old who celebrated her birthday this week, won her second straight World Cup Giant Slalom, taking over the red leader’s bib. She showed a level of composure and terrain management that once eluded her on this very […] The post NZ’s Alice Robinson Conquers Flying Mile Blizzard to Claim 2nd Consecutive Giant Slalom Win & Cana",
      "content": "Giant Slalom victory number 2 for New Zealand’s Alice Robinson. | Image: FIS Alpine IG In whiteout blizzard conditions on Mont-Tremblant’s Flying Mile piste, New Zealand’s Alice Robinson delivered a masterclass in tactical Giant Slalom skiing. The newly 24-year-old who celebrated her birthday this week, won her second straight World Cup Giant Slalom, taking over the red leader’s bib. She showed a level of composure and terrain management that once eluded her on this very slope. Her domination—nearly a second faster than the field—capped a chaotic race day marked by heavy snowfall, fog, poor visibility and a series of DNFs from top contenders. Related: New Zealand’s Alice Robinson Wins the Giant Slalom at Copper Mountain, CO Rounding out the podium were Croatia’s Zrinka Ljutic, who claimed her only second career Giant Slalom podium—her best discipline is Slalom—and Canada’s Valerie Grenier claiming third on her home mountain—she learned to ski here and is member of the Mont-Tremblant Sk",
      "pub_date": "Sun, 07 Dec 2025 05:07:54 +0000",
      "id": "578bbddfa33a",
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "winter-sports"
    },
    {
      "source": "Washington Post",
      "title": "How companies are cracking down on workers’ social media activity",
      "url": "https://www.washingtonpost.com/business/2025/12/13/employer-crackdown-social-media/",
      "description": "Fervor over employee posts about Charlie Kirk’s death is leading companies to adjust policies and step up monitoring of workers’ online conduct.",
      "content": "Fervor over employee posts about Charlie Kirk’s death is leading companies to adjust policies and step up monitoring of workers’ online conduct.",
      "pub_date": "Sat, 13 Dec 2025 11:00:00 +0000",
      "id": "bce7d7811e5a",
      "score": 7,
      "score_details": {
        "relevance": 6,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article discusses a business trend of companies cracking down on employees' social media activity, which has relevance to the ski industry as it grapples with workforce and labor issues. While not directly about the ski industry, the content has moderate priority for inclusion in a ski business news feed."
      },
      "approved_date": "2025-12-13",
      "category": "safety-incidents",
      "secondary_categories": []
    },
    {
      "source": "Unofficial Networks",
      "title": "Big Sky Marks Major Milestone With New Explorer Gondola",
      "url": "https://unofficialnetworks.com/2025/12/06/big-sky-marks-major-milestone-with-new-explorer-gondola/",
      "description": "The brand new terminal houses a state-of-the-art gondola system featuring cutting edge lift technology.",
      "content": "Congratulations to Big Sky who just announced The Explorer Gondola lower terminal lift component construction is complete. The brand new terminal houses a state-of-the-art gondola system featuring cutting edge lift technology. From the “whisper-quiet” drive system to the energy-efficient motors, every component Big Sky has selected with the goal of providing the most reliable, comfortable experience possible. “Each gondola cabin is designed to carry up to ten passengers and their equipment in ultimate comfort. The completed lift system will transport 2850 people per hour with minimal wait times, thanks to its innovative design and efficient loading system. The days of cold lift rides continue to become a thing of the past at Big Sky—your journey up the mountain will now be as enjoyable as the skiing itself.” Here’s a update video with Big Sky VP of Mountain Operations, Adam West, detailing all the latest progress: Categories: Big Sky Montana Ski News",
      "pub_date": "Sat, 06 Dec 2025 18:03:47 +0000",
      "id": "66c9e7d57fbe",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "resort-operations"
    },
    {
      "source": "Unofficial Networks",
      "title": "Investigating Utah’s Ambitious Plans To Merge 7 Major Ski Resorts",
      "url": "https://unofficialnetworks.com/2025/12/06/utah-mega-interconnected-resort-plan/",
      "description": "Multiple attempts have been made to interconnect several ski resorts in Utah's Wasatch Mountains.",
      "content": "Utah is famous for its incredible array of ski resorts drawing visitors from around the country and around the world to enjoy the slopes of the Beehive State and while spending at a day at any single mountain is world class experience, there was once a plan to connect several of them for a mega resort with the promise of huge tourism and massive economic benefits. Utah’s Wasatch Mountains are home to seven major ski resorts (Alta, Snowbird, Solitude, Brighton, Park City, Deer Valley, and Canyons) developed in close proximity since the 1930s due to the region’s geography and mining history. Early informal connections were blazed like trails between Solitude and Brighton and gates between Alta and Snowbird. In the 1980s, an initial proposal to link several resorts failed, setting the stage for more ambitious ideas. In 2011, the SkiLink Gondola was proposed to connect Canyons to Solitude, aiming to cut travel time and ease traffic but it was kiboshed by 2013 amid environmental opposition ",
      "pub_date": "Sat, 06 Dec 2025 15:30:11 +0000",
      "id": "db34a6dc146c",
      "score": 6,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "transportation"
    },
    {
      "source": "Unofficial Networks",
      "title": "Whistler Blackcomb Regular Shares His Favorite Groomers On Whistler Mountain",
      "url": "https://unofficialnetworks.com/2025/12/06/best-groomers-whistler-mountain/",
      "description": "Whistler Blackcomb regular James of Rise & Alpine shared what he believes are the best groomed runs on Whistler Mountain.",
      "content": "Whistler Blackcomb is a huge ski resort with a massive variety of terrain, from high alpine bowls to gnarly tree runs and enormous glacier playgrounds. If you’re someone who prefers some sweet carve turns on a perfect groomer, there’s plenty of that as well. Whistler Blackcomb regular James of Rise & Alpine shared what he believes are the best groomed runs on Whistler Mountain. The best groomer always depends on what’s been freshly groomed more than anything else, but these runs are all pretty iconic. If you’re visiting Whistler, make sure you give a few of these a shot. Rise & Alpine’s Best Groomed Runs On Whistler Mountain: Dave Murray Downhill – Tokum/Bear Paw Raven – Upper & Lower Ptarmigan Banana Peel – Jimmys Joker Ego Bowl Harmony Ridge The Saddle The Burnt Stew Trail Jeffs Ode To Joy Peak to Creek T-Bar Run Maine Ski Hill With $5 Tickets Opens Earlier Than Usual Categories: Whistler Blackcomb Canada Skiing",
      "pub_date": "Sat, 06 Dec 2025 12:02:00 +0000",
      "id": "5db9ec24b269",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "canada"
    },
    {
      "source": "SnowBrains",
      "title": "Know the Rules: SnowBrains’ Guide to Winter Tire Laws in Europe",
      "url": "https://snowbrains.com/know-the-rules-snowbrains-guide-on-winter-tire-laws-in-europe/",
      "description": "As ski season approaches, some North American skiers and winter sports enthusiasts are eyeing Europe’s world-class slopes in the Alps and Scandinavia, especially as more and more of them are now included on the Epic and Ikon passes. But navigating Europe’s roadways during the snowy season comes with unique laws, especially when it comes to winter tires. From strict regulations in […] The post Know the Rules: SnowBrains’ Guide to Winter Tire Laws in Europe appeared first on SnowBrains .",
      "content": "Make sure you know the winter tire laws if you are heading to Europe. | Image: Llama As ski season approaches, some North American skiers and winter sports enthusiasts are eyeing Europe’s world-class slopes in the Alps and Scandinavia, especially as more and more of them are now included on the Epic and Ikon passes. But navigating Europe’s roadways during the snowy season comes with unique laws, especially when it comes to winter tires. From strict regulations in Austria and Norway to more lenient guidelines in other countries, knowing these requirements can make all the difference between a smooth journey to the slopes or a hefty fine. Related: SnowBrains 2025-2026 European Winter Skiers’ Forecast So, if you are heading to Europe this winter and are planning to rent a car, here’s a breakdown of winter tire laws and requirements across popular ski destinations in Europe. You may be fined for not being in control of your vehicle if you are not using winter tires in Europe. | Image: Twit",
      "pub_date": "Sat, 06 Dec 2025 11:00:37 +0000",
      "id": "5580b66a1080",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 8,
        "quality": 7,
        "overall": 8,
        "reason": "This article provides valuable information for ski resort operators, management, and winter sports enthusiasts traveling to Europe. It covers important winter tire laws and regulations, which can have a significant impact on transportation and access to ski resorts. The news is timely as the ski season approaches, and the reporting provides a comprehensive overview without being overly sensationalized."
      },
      "approved_date": "2025-12-07",
      "category": "international"
    },
    {
      "source": "SnowBrains",
      "title": "Alterra Mountain Company’s Kids Ski Free Week at 15 North American Ski Destinations Begins Today",
      "url": "https://snowbrains.com/alterra-mountain-company-announces-kids-ski-free-week-december-6-12-2025-across-15-north-american-ski-destinations/",
      "description": "From December 6 through December 12, 2025, kids will get up to seven free lift tickets at 15 of Alterra Mountain Company’s North American mountain destinations to use during Kids Ski Free Week. Related: Ikon Pass Offering 50% Off Friends & Family Tickets for the 2025-26 Winter Season Participating destinations include: Steamboat, Winter Park Resort and Arapahoe Basin in Colorado; […] The post Alterra Mountain Company’s Kids Ski Free Week at 15 North American Ski Destinations Begins Today appeare",
      "content": "Kids ski free week at Alterra Mountain Company resorts. | Photo: Ikon Pass From December 6 through December 12, 2025, kids will get up to seven free lift tickets at 15 of Alterra Mountain Company ’s North American mountain destinations to use during Kids Ski Free Week. Related: Ikon Pass Offering 50% Off Friends & Family Tickets for the 2025-26 Winter Season Participating destinations include: Steamboat, Winter Park Resort and Arapahoe Basin in Colorado; Palisades Tahoe, Mammoth Mountain, Big Bear Mountain Resort, and Snow Valley in California; Stratton and Sugarbush Resort in Vermont; Snowshoe Mountain in West Virginia; Crystal Mountain in Washington; Schweitzer in Idaho; Deer Valley Resort and Solitude Mountain Resort in Utah; Tremblant in Quebec and Blue Mountain (subject to opening date) in Ontario, Canada. Related: The Ikon Pass Community Will Feature New Terrain Expansions, Lifts, Gondolas At Over 60 Global Destinations Kids 12 and under (17 and under at Stratton and Schweitzer) ",
      "pub_date": "Sat, 06 Dec 2025 08:01:14 +0000",
      "id": "b280b7b38e7c",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 8,
        "quality": 7,
        "overall": 8,
        "reason": "This article provides relevant and timely information about a kids ski free promotion at Alterra Mountain Company resorts, which is valuable content for a ski business news feed. The reporting is informative, though it lacks some depth and detail. Overall, it is a solid news piece that would be a good addition to the feed."
      },
      "approved_date": "2025-12-07",
      "category": "resort-operations"
    },
    {
      "source": "SnowBrains",
      "title": "Austria’s Vincent Kriechmayr Wins at Beaver Creek, CO, as Heavy Weather Cuts Super-G Short After 31 Racers",
      "url": "https://snowbrains.com/austrias-vincent-kriechmayr-wins-at-beaver-creek-co-as-heavy-weather-cuts-super-g-short-after-31-racers/",
      "description": "What began as a promising, powder-covered race day on the Birds of Prey course in Beaver Creek, Colorado, turned into a battle against snowfall, visibility, and rising winds on Friday, December 5, ultimately forcing FIS officials to halt the men’s Super-G after many race interruptions and 31 racers. Despite the difficult conditions, the crowd witnessed a spectacular—if abbreviated—show, highlighted by […] The post Austria’s Vincent Kriechmayr Wins at Beaver Creek, CO, as Heavy Weather Cuts Super",
      "content": "Friday’s Super-G podium at Beaver Creek: Vincent Kriechmayr (1st), Frederik Möller (2nd), and Raphael Haaser (3rd). | Image: FIS Alpine What began as a promising, powder-covered race day on the Birds of Prey course in Beaver Creek, Colorado, turned into a battle against snowfall, visibility, and rising winds on Friday, December 5, ultimately forcing FIS officials to halt the men’s Super-G after many race interruptions and 31 racers. Despite the difficult conditions, the crowd witnessed a spectacular—if abbreviated—show, highlighted by a dominant performance from Austria’s Vincent Kriechmayr and an electrifying run from American River Radamus. The morning opened with thick snowfall after Thursday’s bluebird weather, but the fresh snow didn’t dampen the enthusiasm of fans in the finish area. Canada’s James Crawford kicked off the Super-G with a 1:08.07, establishing the early benchmark. Italy’s Giovanni Franzoni missed it, but Austria’s Stefan Eichberger found just enough speed to edge C",
      "pub_date": "Sat, 06 Dec 2025 05:25:07 +0000",
      "id": "7be610273cb1",
      "score": 8,
      "score_details": {
        "relevance": 9,
        "news_value": 8,
        "quality": 8,
        "overall": 8,
        "reason": "This article provides timely and relevant information about a key event in the ski industry - a major World Cup ski race at a popular resort. The reporting appears to be thorough and focused on the news, rather than sensationalism or fluff."
      },
      "approved_date": "2025-12-07",
      "category": "winter-sports"
    },
    {
      "source": "SnowBrains",
      "title": "The 7 Most Scenic Drives to a Ski Area in North America",
      "url": "https://snowbrains.com/the-7-most-scenic-drives-to-a-ski-area-in-north-america/",
      "description": "Some ski trips start building the adrenaline before you even park in the ski area lot. Sometimes the road to get there can feel like a journey of its own, climbing over high passes, tracing narrow canyon walls, and then suddenly opening to big mountain views that make you want to stop and soak it all in. A handful of […] The post The 7 Most Scenic Drives to a Ski Area in North America appeared first on SnowBrains .",
      "content": "It’s an added bonus if the drive to the mountain is as beautiful as this. | Photo: Visit Telluride Some ski trips start building the adrenaline before you even park in the ski area lot. Sometimes the road to get there can feel like a journey of its own, climbing over high passes, tracing narrow canyon walls, and then suddenly opening to big mountain views that make you want to stop and soak it all in. A handful of routes across North America turn the drive itself into part of the reward, serving up scenery that rivals the runs you came for. We asked our readers: What are the most scenic drives to a ski area? These are the drives that rose to the top. #7 Mammoth, CA Eastern Sierra Scenic Byway (Highway 395) Scenic views at every turn on the drive to Mammoth. | Photo: Visit Mammoth The approach to Mammoth Mountain on Highway 395 runs through some of the most striking terrain in the Eastern Sierra. The highway moves between wide open basins and sharp mountain walls, with long views that s",
      "pub_date": "Sat, 06 Dec 2025 00:35:18 +0000",
      "id": "e56bbe626d44",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 8,
        "overall": 8,
        "reason": "This article provides useful information for skiers and ski resort operators, highlighting some of the most scenic drives to access ski areas in North America. The content is relevant and well-written, offering a good mix of news value and quality reporting."
      },
      "approved_date": "2025-12-07",
      "category": "transportation"
    },
    {
      "source": "New York Times - Travel",
      "title": "Boeing Completes Acquisition of Spirit AeroSystems, a Major Supplier",
      "url": "https://www.nytimes.com/2025/12/08/business/boeing-spirit-aerosystems.html",
      "description": "The aerospace company is buying Spirit AeroSystems, which makes the bodies of the 737 Max jet, two years after a part of that plane blew away during a flight.",
      "content": "The aerospace company is buying Spirit AeroSystems, which makes the bodies of the 737 Max jet, two years after a part of that plane blew away during a flight.",
      "pub_date": "Mon, 08 Dec 2025 19:35:26 +0000",
      "id": "7e758af8e20b",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 8,
        "quality": 7,
        "overall": 8,
        "reason": "This article about Boeing's acquisition of a major aircraft supplier is highly relevant to the ski industry, as it could impact the supply chain and availability of new aircraft for airlines that serve ski destinations. The news value is significant, as it involves a major corporate acquisition, and the reporting from the New York Times is of high quality. Overall, this story is a strong candidate for inclusion in a ski business news feed."
      },
      "approved_date": "2025-12-09",
      "category": "business-investment",
      "secondary_categories": [
        "transportation"
      ]
    },
    {
      "source": "Bloomberg Markets",
      "title": "Apollo CEO Isn't Fully Right About Private Credit",
      "url": "https://www.bloomberg.com/news/videos/2025-12-08/opinion-rowan-s-not-fully-right-on-private-credit-video",
      "description": "Apollo CEO Marc Rowan recently said everyone had \"lost their minds\" about private credit losses. Bloomberg Opinion columnist Paul J. Davies explains why that's not entirely right, according to the data. (Source: Bloomberg)",
      "content": "Apollo CEO Marc Rowan recently said everyone had \"lost their minds\" about private credit losses. Bloomberg Opinion columnist Paul J. Davies explains why that's not entirely right, according to the data. (Source: Bloomberg)",
      "pub_date": "Mon, 08 Dec 2025 11:10:37 GMT",
      "id": "cecf4eb2b47f",
      "score": 8,
      "score_details": {
        "relevance": 7,
        "news_value": 8,
        "quality": 8,
        "overall": 8,
        "reason": "This article directly discusses the ski industry business through the lens of private credit and the Apollo CEO's comments. While not specifically about resorts or destinations, it provides relevant industry analysis and commentary from a major business news source."
      },
      "approved_date": "2025-12-08",
      "category": "business-investment"
    },
    {
      "source": "NPR",
      "title": "U.S. ski resorts are bracing for a steep drop in international travel due to politics",
      "url": "https://www.npr.org/2025/12/01/nx-s1-5545712/us-ski-resorts-steep-drop-international-travel-politics",
      "description": "Canadians typically travel south to American ski towns for skiing, shopping, and nightlife. However, cross-border political tensions have reduced tourism to the U.S., causing resorts concern.",
      "content": "Ski resorts across the American West face dual pressures this season. Warm November weather prevented snowmaking at many resorts, delaying openings. More significantly, Montana state tourism officials have documented approximately a 25% decline in Canadian visitors since tariff announcements and inflammatory political rhetoric. The Whitefish Mountain Resort, located 60 miles south of the Canadian border, typically derives one-quarter of its revenue from Canadian guests. Canadian credit card spending in Whitefish boutiques, restaurants, and hotels has dropped 12%. The broader U.S. Travel Association projects 5 million fewer international visitors nationwide this year. Tourism officials emphasize they welcome Canadian visitors. Local chambers launched 'Welcome Back Canada' promotions offering 20% hotel discounts. Uncertainty dominates planning as domestic tourism has partially offset Canadian declines, though last-minute bookings complicate business forecasting.",
      "pub_date": "Mon, 01 Dec 2025 22:01:00 +0000",
      "id": "npr5545712intl",
      "score": 9,
      "score_details": {
        "relevance": 10,
        "news_value": 9,
        "quality": 9,
        "overall": 9,
        "reason": "High-quality NPR reporting on critical international tourism decline affecting ski resort revenue. Documents 25% drop in Canadian visitors, specific economic impacts on Whitefish and broader industry. Essential business news."
      },
      "approved_date": "2025-12-04",
      "category": "business-investment",
      "secondary_categories": [
        "business-investment",
        "canada",
        "international"
      ]
    },
    {
      "source": "Washington Post",
      "title": "Trump administration launches ambitious air-taxi push",
      "url": "https://www.washingtonpost.com/transportation/2025/12/12/air-taxis-pilot-program-trump/",
      "description": "A pilot program created by the Trump administration may boost the fortunes of companies eager to have air taxis in the skies in time for the 2028 Olympics in Los Angeles.",
      "content": "A pilot program created by the Trump administration may boost the fortunes of companies eager to have air taxis in the skies in time for the 2028 Olympics in Los Angeles.",
      "pub_date": "Fri, 12 Dec 2025 11:00:00 +0000",
      "id": "90939384515b",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article about the Trump administration's air taxi program is relevant to the ski industry, as it could impact transportation options and access to ski destinations in time for the 2028 Olympics in Los Angeles. The news value is moderate, as the program is still in a pilot stage, but the reporting from the Washington Post provides quality information. While not directly about the ski industry, this story could have significant business implications for the ski industry in the long run."
      },
      "approved_date": "2025-12-12",
      "category": "winter-sports",
      "secondary_categories": []
    },
    {
      "source": "Unofficial Networks",
      "title": "Several Feet Of Snow Expected Across Colorado This Weekend",
      "url": "https://unofficialnetworks.com/2025/12/05/colorado-winter-storm-warnings/",
      "description": "A Winter Storm Warning for multiple Colorado mountain ranges remains in effect through 11 PM MST Saturday, December 7th.",
      "content": "Colorado skiers and snowboarders have reason to celebrate this weekend as significant snowfall is expected across several of the state’s mountain ranges, with over two feet possible in some areas. Winter Storm Warnings and Winter Weather Advisories are currently in effect across the region through Saturday evening. Winter Storm Warning Colorado High End Snowfall Forecast. Credit: NWS The Elkhead and Park Mountains, Flat Tops, Gore and Elk Mountains/Central Mountain Valleys, and West Elk and Sawatch Mountains are all under Winter Storm Warnings. Heavy snow is expected throughout these regions, with the most significant accumulations hitting the Elkhead and Park Mountains. The Elkhead and Park Mountains, including Columbine, Hahns Peak, and Toponas, could see total snow accumulations between 8 and 26 inches, with winds gusting as high as 60 mph. A Winter Weather Advisory remains in effect until 5 PM MST this afternoon, followed by the Winter Storm Warning from 5 PM this afternoon through",
      "pub_date": "Fri, 05 Dec 2025 19:59:42 +0000",
      "id": "525169927162",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "weather-snow"
    },
    {
      "source": "Unofficial Networks",
      "title": "Maine Ski Hill With $5 Tickets Opens Earlier Than Usual",
      "url": "https://unofficialnetworks.com/2025/12/05/powderhouse-hill-early-opening/",
      "description": "A Maine ski area that relies on volunteers and natural snowfall to open started its 2025-26 season this week.",
      "content": "South Berwick, Maine — If you’re wondering how the ski season in the Northeast is going, a ski hill that first opens as late as April during one ski season is already open. On Tuesday, a snowstorm brought decent totals across New England. This included Powderhouse Hill in South Berwick, Maine. Relying on natural snow to open up, this snowstorm was enough to start Powderhouse’s rope tow for skiers. On Wednesday, Powderhouse operated its rope tow from 7-9 p.m. If you’re pondering a visit to Powderhouse, the ski hill has put together a guide to the experience. First opened back in 1939, Powderhouse Hill is run by volunteers. Lift tickets are only $5, but they only take cash. That means they don’t take Crypto, bro. The ski hill typically operates on Wednesdays and Fridays from 7 to 9 p.m., and weekends from 12 to 4 p.m. Powderhouse Hill features three trails and one lift. With a vertical drop of 175 feet, it could be one of the smallest ski hills, if not the smallest, in the region. Maine ",
      "pub_date": "Fri, 05 Dec 2025 18:40:53 +0000",
      "id": "6805d54feaeb",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "resort-operations"
    },
    {
      "source": "Unofficial Networks",
      "title": "New Hampshire Ski Resort Reveals What’s New For This Winter",
      "url": "https://unofficialnetworks.com/2025/12/05/attitash-whats-new-2025/",
      "description": "The New Hampshire ski resort, which made two lift upgrades in recent years, has made improvements across the mountain.",
      "content": "Bartlett, New Hampshire — One of the best ski resorts in the White Mountains is beginning its season this weekend with various improvements across its two peaks. Earlier this week, Attitash General Manager Brandon Swartz detailed what’s new for the 2025-26 season. The improvements include a new food truck, snowmaking upgrades, a new deck at the Adventure Center, replacing the haul rope for the Learning Center chairlift, a refreshed locker room, and a new space for lifties. For fans of apres, perhaps the most important announcement is the introduction of the mug club. Guests only need to pay $75 to get their own stoneware mug, which look so fresh and so clean. Event-wise, Attitash After Dark, which features a torchlight and snowcat parade, is scheduled to return on January 31st. View this post on Instagram Attitash was purchased by Vail Resorts in 2019. In its first few years under new ownership, it was plagued by what had haunted them prior: old lift infrastructure. Over the past sever",
      "pub_date": "Fri, 05 Dec 2025 18:36:05 +0000",
      "id": "7fd535272cea",
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "resort-operations"
    },
    {
      "source": "Unofficial Networks",
      "title": "Drone Captures The Remains Of An Abandoned Ski Area In Nebraska",
      "url": "https://unofficialnetworks.com/2025/12/05/abandoned-nebraska-ski-area/",
      "description": "The Nebraska ski area operated for under two decades, and closed for good due to a lack of natural snowfall.",
      "content": "Gretna, Nebraska — When you’re driving past the endless corn fields on I-80 in Nebraska, you’ll probably miss the fact that there’s an abandoned ski area just off the highway. Trail Ridge , known in its final years as Nebraski, was a ski area that operated from 1981 to 1996. It was situated between the cities of Omaha and Lincoln, making it accessible to many. The ski area had a short operational history due to its southern exposure and lack of natural snowfall. However, Nerbraski is one of the sickest ski area names ever. In this video by Skiers and Snowboarders of the Midwest , he uses a drone to capture the remains of the ski area. The physical infrastructure appears to have been removed, but you can still see the layout of many of the old ski trails. French Ski Resort Won’t Operate This Winter Due To Financial Deficit Today, there are no active ski areas in Nebraska. At least they have Omaha Steaks, though. Image/Video Credits: Skiers and Snowboarders of the Midwest , Skimap.org Ca",
      "pub_date": "Fri, 05 Dec 2025 18:31:10 +0000",
      "id": "ea2c6e4691d6",
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "ski-history",
      "secondary_categories": []
    },
    {
      "source": "Unofficial Networks",
      "title": "The Most Expensive Ski Resorts In Europe",
      "url": "https://unofficialnetworks.com/2025/12/05/europe-expensive-ski-resorts/",
      "description": "Skiing in Europe is usually far cheaper than skiing in the United State, but it can still be pretty expensive.",
      "content": "Skiing in Europe is usually far cheaper than skiing in the United States when you’re looking at ski passes. At some resorts in North America, a single day of skiing can cost $300+, while $300 would usually cover at least a few days of skiing in Europe. But the mountains of Austria, Germany, Italy, and France can still be fairly expensive. German skier and adventure Marlene took a look at Europe’s most expensive resorts for the 2025/2026 ski season. According to her analysis, Zermatt in Switzerland is the most expensive ski area in Europe, costing around 540 CHF, or a little more than $670, for six days of skiing. That’s still more than $110 for a day. She points to St. Moritz , again in Switzerland, as the second most expensive, costing around 520 CHF, or around $647 USD, for 6 days. Of course, with those being the most expensive resorts in Europe, they hardly compare to the United States. A week at Aspen Snowmass , the most expensive resort in the U.S., can easily cost well over $1,00",
      "pub_date": "Fri, 05 Dec 2025 15:54:26 +0000",
      "id": "14aabee90536",
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (boost: 0)"
      },
      "approved_date": "2025-12-06",
      "category": "international"
    },
    {
      "source": "New York Times - Travel",
      "title": "Can Killington Become the ‘Aspen of the East’? Maybe With a $3 Billion Upgrade.",
      "url": "https://www.nytimes.com/2025/12/05/travel/killington-vermont-ski-resort.html",
      "description": "A developer wants to add luxury housing and a glossy base area complete with everything from a spa to a ‘ski beach’ to the resort, which has never been known for its amenities. But is Vermont ready for it?",
      "content": "A developer wants to add luxury housing and a glossy base area complete with everything from a spa to a ‘ski beach’ to the resort, which has never been known for its amenities. But is Vermont ready for it?",
      "pub_date": "Fri, 05 Dec 2025 10:00:11 +0000",
      "id": "f7444c2869c8",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 8,
        "overall": 8,
        "reason": "This article covers a major proposed $3 billion development at a prominent East Coast ski resort, which aligns with the 'major ski resort business news' and 'real estate development in ski communities' criteria. The content is substantive and covers the potential impact on the resort and local community. While the New York Times is a reputable source, the article has a somewhat promotional tone and does not delve deeply into the potential challenges or broader industry implications."
      },
      "approved_date": "2025-12-08",
      "category": "business-investment"
    },
    {
      "source": "Summit Daily News",
      "title": "Summit County resorts roll out new terrain ahead of snowy weekend forecast",
      "url": "https://www.summitdaily.com/news/summit-county-resorts-roll-out-new-terrain-ahead-of-snowy-weekend-forecast/",
      "description": "Editor’s Note: Each Thursday throughout the winter, the Summit Daily News will provide a terrain update that will inform skiers and riders on what trails are open at resorts near Summit County before they head...",
      "content": "Editor’s Note: Each Thursday throughout the winter, the Summit Daily News will provide a terrain update that will inform skiers and riders on what trails are open at resorts near Summit County before they head out to the slopes. The snow is finally starting to fall at Summit County’s ski resorts . In typical Colorado fashion, Mother Nature is making up for the slow start by consistently delivering a few inches of fresh snow on a near-daily basis throughout the past week. With another storm system expected to bring potentially heavy snowfall this weekend , ski areas are dropping ropes on new terrain and preparing additional trails to come online in the days ahead. Keystone opens up North Peak for the season Keystone Resort once again leads the weekly terrain update with the announcement that North Peak will open for the season on Friday, Dec. 5. Skiers and riders can take Mozart down or take the Outpost Gondola over to North Peak to access the Prospector and the Alamo trails. The trails",
      "pub_date": "Fri, 05 Dec 2025 00:46:15 +0000",
      "id": "45c07054ee62",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 7,
        "overall": 7,
        "reason": "This article provides timely, relevant information about new terrain openings and snowfall forecasts at Summit County ski resorts, which would be valuable for a ski business news feed. While it contains some promotional content, the overall reporting appears objective and informative."
      },
      "approved_date": "2025-12-04",
      "category": "weather-snow"
    },
    {
      "source": "Summit Daily News",
      "title": "Colorado backcountry officials warn of ‘dramatic uptick’ in avalanche danger as major storm hits this weekend",
      "url": "https://www.summitdaily.com/news/colorado-backcountry-avalanche-danger-winter-storm/",
      "description": "With a major winter storm in the forecast for this weekend, Colorado backcountry officials are warning that the fresh snow will lead to a significant increase in avalanche danger across the state. Colorado Avalanche Information...",
      "content": "With a major winter storm in the forecast for this weekend, Colorado backcountry officials are warning that the fresh snow will lead to a significant increase in avalanche danger across the state. Colorado Avalanche Information Center Deputy Director Brian Lazar said the dry start to the season has meant that avalanche risk remained low throughout most of November, due to the lack of snow. This upcoming storm will change that. “It will certainly be helpful for our snowpack in the longterm,” Lazar said. “However, the short-term effects will be a dramatic uptick in avalanche danger as we start to rebuild our snowpack.” Colorado’s northern and central mountains are expected to pick up between 1 to 2 feet of snow, with the potential for up to 3 feet of snow in parts of the Park Range and Flat Tops, according to the CAIC. The northern mountains include the Front Range, the Steamboat Springs area, the Vail area and Summit County, while the central mountains include the Steamboat Springs and ",
      "pub_date": "Fri, 05 Dec 2025 00:40:40 +0000",
      "id": "794f85706ea9",
      "score": 8,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 8,
        "overall": 8,
        "reason": "This article provides timely and relevant information about a major winter storm and its potential impact on avalanche danger in Colorado's backcountry, which is an important consideration for ski resort and destination operations. The reporting is objective and informative, focusing on the facts from official sources without any promotional or clickbait elements."
      },
      "approved_date": "2025-12-04",
      "category": "weather-snow"
    },
    {
      "source": "Summit Daily News",
      "title": "Physical altercations at Copper, Keystone resorts lead to charges at end of November",
      "url": "https://www.summitdaily.com/news/colorado-ski-area-fights-2025-keystone-copper/",
      "description": "The Summit County Sheriff’s Office responded to two incidents at Summit County ski resorts last week that involved physical altercations. On Nov. 27 at Copper Mountain, a man and juvenile were watching the Copper Cup...",
      "content": "The Summit County Sheriff’s Office responded to two incidents at Summit County ski resorts last week that involved physical altercations. On Nov. 27 at Copper Mountain, a man and juvenile were watching the Copper Cup in a restricted area. Sheriff Jaime FitzSimons said neither person should have been in the area. He said the juvenile left, and the man thought the juvenile drew security workers’ attention to the area, leading to the man being kicked out. The two moved to the same public area to watch the event, and the man thought the juvenile, who was taking pictures, stepped in front of him on purpose, FitzSimons said. The man tackled the juvenile, and the juvenile’s camera was damaged in the altercation. After investigating, deputies arrested the man on charges including assault and criminal mischief and took him to the county jail. Three days later, on Nov. 30, at Keystone Resort, a female skier believed a male snowboarder was riding recklessly downhill of her. She skied ahead, stopp",
      "pub_date": "Fri, 05 Dec 2025 00:26:17 +0000",
      "id": "30f70bf369b6",
      "score": 7,
      "score_details": {
        "relevance": 8,
        "news_value": 7,
        "quality": 6,
        "overall": 7,
        "reason": "This article reports on physical altercations that occurred at two popular ski resorts, which is relevant business news for the ski industry. While the incidents themselves may not be the most significant news, the article provides details on how the local law enforcement responded, which could impact resort operations and policies. The reporting appears factual, though the writing quality is moderate."
      },
      "approved_date": "2025-12-04",
      "category": "safety-incidents",
      "secondary_categories": []
    }
  ]
}