{
  "updated": "2026-01-21 17:24:11",
  "total_articles": 22,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Snow Industry News",
      "title": "Boyne Resorts Announces Launch Of The Boyne Forever Foundation",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/boyne-resorts-announces-launch-of-the-boyne-forever-foundation/",
      "content": "Boyne Resorts, North America's largest family-owned four-season resort company, today announced the launch of the Boyne Forever Foundation, an independent 501(c)(3) public charity. This strategic philanthropic initiative will work in partnership with all 13 Boyne Resorts properties to amplify their collective impact and create greater year-over-year support for local and national causes. The Foundation represents a historic milestone for the company, channeling nearly 80 years of community commitment into one focused effort driven by the core principles that have defined the Boyne Resorts family since 1948. As an independent public charity, the Boyne Forever Foundation (BFF) will focus its efforts on three priorities that reflect the heart of Boyne Resorts' identity: investing in the communities where resorts are located, caring for the people who bring these resorts to life, and protecting the environment. \"The Boyne Forever Foundation is a strengthening of our commitment to the value",
      "pub_date": "2026-01-22",
      "id": "0d2c2054f3b9",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "U.S. Ski & Snowboard Announces 2026-27 Alpine Domestic World Cup Schedule",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/us-ski-snowboard-announces-2026-27-alpine-domestic-world-cup-schedule/",
      "content": "The International Ski & Snowboard Federation preliminarily confirmed the return of a robust slate of U.S. Audi FIS Alpine Ski World Cup events for the 2026-27 season, welcoming the world’s best skiers back to some of the most iconic venues in the United States. The FIS Council will confirm the final schedule in spring 2026. 2026-27 DOMESTIC FIS ALPINE SKI WORLD CUP SCHEDULE Nov. 28-29, 2026 – Copper Cup – men’s super-G, giant slalom Nov. 28-29, 2026 – Stifel Killington Cup – women’s giant slalom, slalom Dec. 3-6, 2026 – Stifel Birds of Prey – men’s downhill (2), super-G, giant slalom Dec. 12-13, 2026 – Stifel Birds of Prey – women’s downhill, super-G March 20-25, 2027 – Stifel Sun Valley Finals – men’s and women’s downhill, super-G, giant slalom, slalom The domestic schedule features five alpine World Cup stops in the United States, underscoring the Stifel U.S. Ski Team’s continued role as a premier host on the global winter sports calendar. After massive success in 2025, Copper Mounta",
      "pub_date": "2026-01-21",
      "id": "e6b7355bee5c",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "One Meter Wide, 110 Meters Deep – Freeskiers And Snowboarders Showcase World-Class Action On A Narrow Mountain Ridge",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/one-meter-wide-110-meters-deep-freeskiers-and-snowboarders-showcase-world-class-action-on-a-narrow-mountain-ridge/",
      "content": "In the heart of the Julian Alps in northeast Italy, four winter sports athletes have conquered a 350-metre-long course built on a ridge just a few metres wide, on the Sella Nevea Pass. A real no-fall zone, dotted with rocky edges up to 110 metres deep, requiring millimetre precision from these ski and snowboard athletes. Every jump, landing and decision counts to master the entire course. Wakeboard professional and passionate snowboarder Felix Georgii (GER), 2024 Freeride World Tour Champion Max Hitzig (GER), Italian Olympic team member Ian Matteoli (ITA) and 2022 Olympian Fabian Bösch (SUI) took on the challenge. Key facts Location: Sella Nevea, Italy Athletes: Felix Georgii (GER), wakeboarding: X Games Real Wake Gold 2017 Max Hitzig (GER), freeski: Freeride World Tour Champion 2024 Ian Matteoli (ITA), snowboard: first snowboarder to land a frontside 2160, 2nd place in Big Air World Cup overall ranking 2024/25 Fabian Bösch (SUI), freeski: 1st place in the FIS Freestyle Ski World Champ",
      "pub_date": "2026-01-21",
      "id": "b3c2db4e3c01",
      "prefilter_business_score": 0,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "resort-operations",
        "international"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "President Trump’s Vision: Is a New Luxury Ski Resort on the Israel/Syria Border a Path to Peace in the Middle East?",
      "url": "https://snowbrains.com/president-trumps-vision-is-a-new-luxury-ski-resort-on-the-israel-syria-border-a-path-to-peace-in-the-middle-east/",
      "description": "President Trump has proposed building a luxury ski resort on Mount Hermon that straddles the Israel-Syria border. It fits Trump’s style of trying to ease conflicts and battles with incentives like bold real estate visions that would bring economic opportunities to the region instead. However, the idea faces huge practical, political, and security hurdles. For now, the luxury ski resort […] The post President Trump’s Vision: Is a New Luxury Ski Resort on the Israel/Syria Border a Path to Peace in",
      "content": "Mount Hermon’s ski slopes, pictured on December 30, 2025. | Image: Ayl Margolin / Flash90 President Trump has proposed building a luxury ski resort on Mount Hermon that straddles the Israel-Syria border. It fits Trump’s style of trying to ease conflicts and battles with incentives like bold real estate visions that would bring economic opportunities to the region instead. However, the idea faces huge practical, political, and security hurdles. For now, the luxury ski resort on Mount Hermon remains only a proposal, and has no confirmed site, no announced funding, and no construction timeline. The ski resort is part of a proposed joint economic zone between Israel and Syria. This zone would include: wind farms and energy projects, data centers, pharmaceutical plants, and new infrastructure (e.g., possibly oil pipelines). President Trump’s administration describes it as a confidence-building measure to link security with shared prosperity, reduce tensions, and encourage cooperation. Israe",
      "pub_date": "2026-01-21",
      "id": "83759e0860fc",
      "prefilter_business_score": 1,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (boost: 2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Ski Area Management",
      "title": "$100M Investment, Major Changes Coming to Mont-Sainte-Anne",
      "url": "https://www.saminfo.com/news/sam-headline-news/100m-investment-major-changes-coming-to-mont-sainte-anne",
      "description": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "content": "SAM Magazine—Beaupré, Quebec, Jan. 21, 2026— Mont-Sainte-Anne and operator Resorts of the Canadian Rockies (RCR) have reached an agreement with the Quebec government to fund substantial capital improvements at the resort, including the replacement of four lifts with three new ones, new snowmaking infrastructure, and installation of warm-season attractions for a total investment of C$100 million over the next five years. Investissement Québec has been authorized to grant two loans totaling C$50 m",
      "pub_date": "2026-01-21",
      "id": "a1b0aac5f103",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "canada"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "Backcountry Beta: Exploring the Bridgeport, CA, Winter Recreation Area",
      "url": "https://snowbrains.com/backcountry-beta-exploring-the-bridgeport-winter-recreation-area/",
      "description": "Brought to you by Mono County Tourism When winter takes hold in the Eastern Sierra, the Bridgeport Winter Recreation Area (BWRA) becomes a popular destination for backcountry enthusiasts. Powderhounds flock to this area during the cold winter months, usually with snowmobiles. Shortly after you turn onto Highway 108 (Sonora Pass), the snow starts, and the journey begins. Located seven miles […] The post Backcountry Beta: Exploring the Bridgeport, CA, Winter Recreation Area appeared first on SnowB",
      "content": "Technical terrain awaits in the Bridgeport Winter Recreation Area. Image: Mono County Brought to you by Mono County Tourism When winter takes hold in the Eastern Sierra, the Bridgeport Winter Recreation Area (BWRA) becomes a popular destination for backcountry enthusiasts. Powderhounds flock to this area during the cold winter months, usually with snowmobiles. Shortly after you turn onto Highway 108 (Sonora Pass), the snow starts, and the journey begins. Located seven miles up the snow-covered highway, the BWRA is the gateway to remote and technical terrain in the heart of the Sierra. The Bridgeport Avalanche Center (BAC) is a non-profit program dedicated to sharing field observations and snowpack summaries in the region. I had a feeling the BAC would be familiar with the Bridgeport Winter Recreation Area, so I reached out to them. Join me as I chat with Joe Soccio and Andrew Irvin about trailhead access, favorite routes, and planning your day in the Bridgeport Winter Recreation Area t",
      "pub_date": "2026-01-21",
      "id": "f104b069ef70",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "transportation",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Unofficial Networks",
      "title": "Notorious Quebec Ski Resort Announces Start Of Capital Improvement Projects",
      "url": "https://unofficialnetworks.com/2026/01/21/mont-sainte-anne-2026-upgrades/",
      "description": "After a bumpy start to the 2025-26 season, a Quebec ski resort has announced major on-mountain improvements.",
      "content": "Quebec — Well, here are some words I never thought I would type out: Resorts of the Canadian Rockies (RCR) is spending lots of money on one of its properties. Yesterday, Mont-Sainte-Anne and the Quebec government announced a relaunch of their partnership, with an investment of $100 million CAD (nearly $72.4 million) to revitalize one of Quebec’s largest ski resorts. These projects are funded partly by RCR, with the other funds coming from two loans provided by the province. The plan is now in the implementation stage. “We were able to cross the finish line by establishing a true partnership with Investissement Québec and SÉPAQ, enabling the rapid injection of $100 million into the ski mountain’s infrastructure and tourism offering to ensure its modernization. Significant efforts were made by all parties to ensure the long-term coherence and sustainability of the destination through a renewed approach,” said Maxime Cretin, the Vice President and General Manager of RCR’s Eastern Region. ",
      "pub_date": "2026-01-21",
      "id": "e817bf8ec56c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Unofficial Networks",
      "title": "Revived Colorado Ski Area Opens Chairlift For The First Time Since 2000",
      "url": "https://unofficialnetworks.com/2026/01/21/cuchara-lift-4-reopens/",
      "description": "Since 2017, locals have been working on reviving one of the old chairlifts at an once-abandoned ski area in southern Colorado.",
      "content": "La Veta, Colorado — A ski area comeback years in the making celebrated a historic milestone last Saturday. On Saturday, Cuchara Mountain Park opened up for the 2025-26 season. For the past few years, operations revolved around bringing guests up on a carriage attached to the snowcat. For this ski season, they were able to reopen the chairlift that volunteers have been working on for years to get operational. Those dreams became a reality on Saturday, as Lift 4 reopened to the public. Crowds gathered at the base of Lift 4 to watch a ribbon-cutting ceremony. Cuchara Mountain operated with various owners from 1981 to 2000. It sat abandoned for years, but the county purchased it in 2017 and converted it into a non-profit operation. The old Lift 4 serves a small footprint of the old ski resort. Lift 4 serves 9 trails across 47 skiable acres with a vertical drop of 300 feet. The old Lift 4 is a Riblet double chairlift that was installed in 1981. The chairlift can carry 1,200 people per hour ",
      "pub_date": "2026-01-21",
      "id": "510dcbd021fd",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "resort-operations",
        "business-investment",
        "transportation"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SnowBrains",
      "title": "Behind the Lens at the 2026 Milano Cortina Olympics: A Getty Photographer’s Guide to Capturing Skiing Magic",
      "url": "https://snowbrains.com/behind-the-lens-at-the-2026-milano-cortina-olympics-a-getty-photographers-guide-to-capturing-skiing-magic/",
      "description": "The Milano Cortina 2026 Winter Olympics are almost two weeks away and will be held from February 6 to 22. However, David Ramos is already preparing for the biggest event of the year. Ramos is a Barcelona-based staff photographer for Getty Images, with a career spanning news, international conflicts, and high-profile sports coverage—including the Winter Olympics. Ramos received an Award of Excellence […] The post Behind the Lens at the 2026 Milano Cortina Olympics: A Getty Photographer’s Guide to",
      "content": "David Ramos is a Getty Images photographer who will be covering the 2026 Milan Cortina Winter Olympics. | Image: David Ramos The Milano Cortina 2026 Winter Olympics are almost two weeks away and will be held from February 6 to 22. However, David Ramos is already preparing for the biggest event of the year. Ramos is a Barcelona-based staff photographer for Getty Images , with a career spanning news, international conflicts, and high-profile sports coverage—including the Winter Olympics. Ramos received an Award of Excellence in the Sports Photographer of the Year category for his full portfolio of sports coverage from 2023, including the World Athletic Championships, Tour de France, Alpine Ski World Cup Finals, surfing sessions in Portugal, and more. He is no stranger when it comes to knowing what it takes to prepare, cover, and work at a high-stress event like the Winter Olympics. Ramos has covered skiing and snowboarding events at the PyeongChang 2018 and the Beijing 2022 games, and is",
      "pub_date": "2026-01-21",
      "id": "b89920a2c53d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Ski Area Management",
      "title": "Boyne Resorts Launches Independent Charitable Foundation",
      "url": "https://www.saminfo.com/news/sam-headline-news/boyne-resorts-launches-independent-charitable-foundation",
      "description": "SAM Magazine—Boyne Falls, Mich., Jan. 21, 2026— Boyne Resorts has launched the Boyne Forever Foundation, an independent 501(c)(3) public charity that will coordinate philanthropic giving and grantmaking across the company’s 13 North American properties. The foundation will focus on three areas: environmental stewardship, community investment, and support for employees. Structured as a standalone public charity, the Boyne Forever Foundation consolidates philanthropic efforts that were previously ",
      "content": "SAM Magazine—Boyne Falls, Mich., Jan. 21, 2026— Boyne Resorts has launched the Boyne Forever Foundation, an independent 501(c)(3) public charity that will coordinate philanthropic giving and grantmaking across the company’s 13 North American properties. The foundation will focus on three areas: environmental stewardship, community investment, and support for employees. Structured as a standalone public charity, the Boyne Forever Foundation consolidates philanthropic efforts that were previously ",
      "pub_date": "2026-01-21",
      "id": "65f06376605b",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Unofficial Networks",
      "title": "Skiers Encounter Grizzly Bear In The Mountains of Alaska",
      "url": "https://unofficialnetworks.com/2026/01/21/skiers-encounter-grizzly-bear-in-the-mountains-of-alaska/",
      "description": "A group of skiers encounter a grizzly bear on the slopes on an Alaskan mountain.",
      "content": "Alaska is a hot spot for grizzly bears, easily home to the most of any of the 50 states. There are an estimated 30,000 across the entire state , representing over 98 percent of the United States population. The Alaska Department of Fish and Game manages the population, ensuring that the population remains healthy and grizzly bear viewing opportunities stay abundant. Hyder, Alaska is well known for it’s exceptional wildlife viewing opportunities, particularly around Fish Creek. Visitors to the area can often spot salmon, eagles, ducks, minks, otters, black bears, and of course grizzly bears. The summer months are the best time to observe the massive apex predators in Hyder as they gorge on fish during the salmon and chum runs in the shallow waters of Fish Creek but apparently they can still be active in the winter judging by this video of a group of backcountry skiers who encountered a grizzly at the top of a mountain, with skier Daryl Treadway actually sharing the slopes with the anima",
      "pub_date": "2026-01-21",
      "id": "c307dfba4c77",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "The Ski Guru",
      "title": "Crevasses & Glaciers: The Hidden Winter Danger",
      "url": "https://www.the-ski-guru.com/2026/01/21/crevasses-glaciers-hidden-winter-danger/",
      "description": "Crevasses & Glaciers: The Hidden Winter Danger Glaciers are often associated with summer mountaineering — ropes, harnesses and visible crevasses. In winter, however, glaciers can appear deceptively smooth, white and skiable. This illusion of safety is one of the reasons crevasses and glaciers remain among the most underestimated winter dangers in the mountains. This article explains why glaciers … Continue reading \"Crevasses & Glaciers: The Hidden Winter Danger\" The post Crevasses & Glaciers: Th",
      "content": "Crevasses & Glaciers: The Hidden Winter Danger Glaciers are often associated with summer mountaineering — ropes, harnesses and visible crevasses. In winter, however, glaciers can appear deceptively smooth, white and skiable. This illusion of safety is one of the reasons crevasses and glaciers remain among the most underestimated winter dangers in the mountains. This article explains why glaciers are still hazardous in winter , how crevasses behave under snow, and why even experienced skiers can fall victim to hidden traps. Hansbreen Glacier, Svalsbard. Photo: Bartek Luks Aya. Unsplash. Crevasses & Glaciers: The Hidden Winter Danger. Why Glaciers Are Still Dangerous in Winter Snow does not remove crevasses — it hides them . During winter: Crevasses are covered by snow bridges Surface terrain appears uniform Visual warning signs are often absent Snow bridges can collapse suddenly under the weight of a skier, snowboarder or group — often without warning . Unlike avalanches, crevasse falls",
      "pub_date": "2026-01-21",
      "id": "b7f740bf0134",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "The PlanetSKI Snow Report",
      "url": "https://planetski.eu/2026/01/20/the-planetski-snow-report-30/",
      "description": "Check out our latest reports from Europe and North America: The Alps, The Pyrenees, The Canadian Rockies & the Scottish Highlands. UPDATED The post The PlanetSKI Snow Report appeared first on PlanetSKI .",
      "content": "Wednesday 21st January The weather remains clear across large parts of the Alps with blue sky and cold temperatures the order of the day. Further snow is set to fall in parts of the south-western Alps on Thursday and Friday, but otherwise it is remaining dry. Overall snow depths in the Alps are generally below the annual average, though conditions on piste remain good in many of the French resorts including Tignes & Val Thorens . It is looking fairly healthy in Verbier in Switzerland and at some of the resorts in the Aosta Valley in Italy. The further east one goes the overall conditions deteriorate. Areas like the Dolomites in Italy are once again relying on their excellent snow making capabilities. With the 2025 Milan-Cortina Winter Olympics just a few weeks away it would be good to see some fresh snow. Snow depths are considerably below par in the south-east of Switzerland and one of its ski areas, St Moritz, could do with some more snow. “After a couple of low viz and light snow da",
      "pub_date": "2026-01-20",
      "id": "a8787ef1163e",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "winter-sports",
        "international",
        "canada"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "Irish Skier is Latest to Die in Avalanche in the Alps",
      "url": "https://planetski.eu/2026/01/19/another-avalanche-death-in-the-alps/",
      "description": "Fresh calls have been made for caution after 25 deaths in the Alps in the past 10 days. UPDATED The post Irish Skier is Latest to Die in Avalanche in the Alps appeared first on PlanetSKI .",
      "content": "An Irish skier aged 53 who was seriously injured in an avalanche in the Swiss Alps a week ago has died. The man is the latest person to lose his life in a spate of deadly avalanches this month. He was caught in an avalanche on January 13 th and died a week later on Tuesday 20 th . “During the night of January 19th/20th, the victim died from his injuries,” a police statement said. “He was an Irish national aged 53.” The man was swept away when an avalanche struck as he and two fellow-skiers were descending the east face of the Six Noir mountain, police said. The man was pulled from the snow at the scene and taken by helicopter to hospital in Sion. Earlier this week a man died in Val d’Isere in France. The man, who has not been named, was on holiday in the resort when he was caught in an avalanche at 4.30 pm on Monday afternoon. He was in a group of six in the Solaise area when he was buried. The rescue services were on the scene quickly and found his avalanche bag in the snow that had b",
      "pub_date": "2026-01-19",
      "id": "f06077aa894d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "PlanetSKI",
      "title": "GB Athletes in Action",
      "url": "https://planetski.eu/2026/01/19/gb-athletes-in-action-22/",
      "description": "It's another busy week for GB's snowsport athletes as the Winter Olympics draws closer. We also round up last week's results. UPDATED The post GB Athletes in Action appeared first on PlanetSKI .",
      "content": "Athletes Competing Park & Pipe X-Games – Aspen – 23-25 January Mia Brookes (SB) Kirsty Muir (FS) Zoe Atkin (FS) Gus Kenworthy (FS) Alpine Slalom/Super G, Downhill – Kitzbuehel – 20-25 January Dave Ryding (SL) Laurie Taylor (SL) Billy Major (SL) Luca Carrick-Smith (SL) Roy Steudle (SG, DH) Ski Cross Ski Cross – Veysonnaz – 21-24 January Ollie Davies Para Snowboard Snowboard Cross World Cup and Europa Cup – Lenk – 21-22 January James Barnes-Miller (WC) Ollie Hill (WC) Davy Zyw (EC) Para Nordic Biathlon World Cup – Jakuszyce – 22-25 January Scott Meenagh Last Week’s Results View this post on Instagram A post shared by GB Snowsport (@gbsnowsport) Park & Pipe Laax World Cup Maisie Hill (SB SS) – 31st Katie Ormerod (SB SS) – 19th Txema Mazet-Brown (SB SS) – 56th Siddhartha Ullah (SB HP) – 43rd Chris McCormick (FS SS) – 58th Tom Greenway (FS SS) – 50th Alpine Slalom Flachau World Cup Victoria Palla – DNF1 Alpine Slalom Wengen World Cup – Wengen Dave Ryding – DNF1 Billy Major – DNQ Laurie Tayl",
      "pub_date": "2026-01-19",
      "id": "b80893eda586",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}