{
  "updated": "2026-01-29 11:24:50",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "The Ski Guru",
      "title": "Why Ski Resorts Close Terrain After Heavy Snowfall — And Why That’s a Safety Decision",
      "url": "https://www.the-ski-guru.com/2026/01/29/why-ski-resorts-close-terrain-heavy-snowfall/",
      "description": "Why Ski Resorts Close Terrain After Heavy Snowfall Introduction After major snowstorms, skiers and snowboarders often arrive expecting perfect powder conditions — only to find lifts closed, terrain restricted, or entire sectors shut down. Frustration is common, especially during short holidays or peak winter weeks. But more snow does not automatically mean safer skiing. In fact, … Continue reading \"Why Ski Resorts Close Terrain After Heavy Snowfall — And Why That’s a Safety Decision\" The post Wh",
      "content": "Why Ski Resorts Close Terrain After Heavy Snowfall Introduction After major snowstorms, skiers and snowboarders often arrive expecting perfect powder conditions — only to find lifts closed, terrain restricted, or entire sectors shut down. Frustration is common, especially during short holidays or peak winter weeks. But more snow does not automatically mean safer skiing . In fact, the period immediately after heavy snowfall is often when avalanche risk is highest. Terrain closures following big storms are not a failure to open — they are a deliberate risk-management decision designed to protect lives . Heavy snowfall doesn’t automatically mean safe skiing Large snowfalls can dramatically increase instability in the snowpack. Factors that contribute to heightened risk include: rapid accumulation of fresh snow wind loading on leeward slopes weak layers buried beneath new snow limited visibility preventing safe assessment In many cases, the first 24 to 72 hours after a storm are critical. ",
      "pub_date": "2026-01-29",
      "id": "174668746aac",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "resort-operations"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Snow Industry News",
      "title": "Armada Launches New Antimatter Freeride Ski Line Alongside Max Palm",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/armada-launches-new-antimatter-freeride-ski-line-alongside-max-palm/",
      "content": "Armada is launching a new line of freeride skis, the Antimatter Series, designed alongside athlete Max Palm. Development of Antimatter involved collaboration with the athletes who inspire Armada’s vision of freeride, one that combines refined technical skills with an aesthetic, creative approach. The full line of Antimatter skis, men’s and women’s models, range from a 75mm waist to a 114mm waist. The line will be available to buy online and in-store Fall 2026. Find out more here: https://www.armadaskis.com/en-us/antimatter-early-release THE SERIES: The Antimatter Series is a collection of skis that blend playful, freestyle-inspired camber profiles with subtly directional shaping, utilizing constructions with tailored, hybrid metal. Essentially, Antimatter skis can pin it at top speeds in demanding terrain, while maintaining an intuitive character that can slash, pop and make a variety of turn shapes. THE 114: The flagship of the line, the Antimatter 114, is Max Palm’s signature ski. Pa",
      "pub_date": "2026-01-29",
      "id": "cd379b6a1f9d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [],
      "approved_date": "2026-01-29"
    },
    {
      "source": "SnowBrains",
      "title": "Aspen Highlands, CO, Report: Snowboarding Above the Ozone",
      "url": "https://snowbrains.com/aspen-highlands-co-report-snowboarding-above-the-ozone/",
      "description": "Did you know that if you hike to the top of Aspen Highlands’ Highland Bowl, to 12,392 feet above sea level, your run literally starts above the Ozone? Well, not above the actual Ozone Layer, but the trail right below that is called Ozone. Aspen Highlands is one of four Aspen ski areas. It’s the steep one, the really really steep […] The post Aspen Highlands, CO, Report: Snowboarding Above the Ozone appeared first on SnowBrains .",
      "content": "The legendary Aspen Highland Bowl on January 27, 2026. Credit: SnowBrains. Did you know that if you hike to the top of Aspen Highlands’ Highland Bowl , to 12,392 feet above sea level, your run literally starts above the Ozone? Well, not above the actual Ozone Layer, but the trail right below that is called Ozone. Aspen Highlands is one of four Aspen ski areas. It’s the steep one, the really really steep one. According to the Highlands’ snow report , they are currently 94% open in terms of acreage; however, none of this terrain is for beginners. What makes this ski area so special is that it has no green runs, and it boasts an absolutely massive bowl (270 skiable acres) that is only accessible via roughly a 45-minute, breathtaking hike. That is exactly how I started my day: with a quick warm-up run and then straight to the bowl. The hike up to the peak is equally as challenging, rewarding, and exhilarating an experience as the way down the bowl. There is one especially long and steep se",
      "pub_date": "2026-01-28",
      "id": "5fd3dc66f641",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "hospitality"
      ],
      "approved_date": "2026-01-28"
    },
    {
      "source": "Unofficial Networks",
      "title": "$127.5 Million Telluride Sale Offer Leads To Resignations, Investigations",
      "url": "https://unofficialnetworks.com/2026/01/28/telluride-sale-scandal/",
      "description": "A meeting between two local officials and Telluride Ski Resort's owner has created more drama for the community.",
      "content": "Colorado — While the ski patrol strike has ended in Telluride, the drama is far from over. Earlier this month, it was revealed by the Colorado Sun and Telluride Times that an offer was made to the owner of Telluride Ski Resort during the ski patrol strike to purchase it. However, that meeting led to political turmoil in the community. The Meeting Late last month, two town officials from Telluride and the Mountain Village traveled to meet with TelSki owner Chuck Horning in Southern California. The meeting was intended to discuss the ski patrol strike and leadership deficiencies at the ski resort. The two representatives were Mountain Village Mayor Marti Prohaska and Telluride Mayor Pro Tem Meehan Fee. During the December 29th meeting, the two told Horning that a group of investors was interested in taking a 51% stake in the ski resort for $127.5 million. As part of this deal, Horning would have remained the Chairman of the board. The two signed a contract with Horning to resolve conflic",
      "pub_date": "2026-01-28",
      "id": "73088b2edf5b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "safety-incidents",
        "resort-operations"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "PlanetSKI",
      "title": "GB Athletes in Action as Winter Olympics Approaches",
      "url": "https://planetski.eu/2026/01/27/gb-athletes-in-action-as-winter-olympics-approaches/",
      "description": "The Winter Olympics start a week on Friday, February 6th. It's the final World Cup competitions ahead of The Games. NEW The post GB Athletes in Action as Winter Olympics Approaches appeared first on PlanetSKI .",
      "content": "Athletes Competing this Week Alpine Slalom World Cup – Schladming –28 January Luca Carrick-Smith Billy Major Dave Ryding Laurie Taylor Downhill World Cup – Crans Montana – 28 January – 1 February Owen Vinter Ski Cross World Cup – Val di Fassa – 28-31 January Ollie Davies Para Snowboard Snowboard Cross World Cup – Big White – 31 January – 1 February James Barnes-Miller Ollie Hill Para Alpine Slalom and Giant Slalom World Cup – Meribel – 27-30 January Neil Simpson / Rob Poth Last Week’s Results X Games Aspen Kirsty Muir – 1 st (SS), 2 nd (BA) Mia Brookes – 1 st (SS), 3 rd (BA) Zoe Atkin – 1 st (HP) Gus Kenworthy – 9 th See here for our reports on the strong performance of the British Team ahead of the Milan-Cortina Winter Olympics with three golds: Kirsty Muir takes gold at the X Games Mia Brookes wins X Games gold Zoe Atkin wins second X Games gold for GB Kitzbuehel Alpine World Cup Dave Ryding – 20 th Billy Major – 24 th Laurie Taylor – DNQ Luca Carrick-Smith – DNF 1 Roy Steudle – DNF ",
      "pub_date": "2026-01-27",
      "id": "c5f79bc413cc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "canada"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "The Ski Guru",
      "title": "Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base",
      "url": "https://www.the-ski-guru.com/2026/01/28/andorra-snow-update-slopes-open-january-2026/",
      "description": "Andorra Snow Update: 100% of Slopes Open, Up to 200 cm Base All ski resorts in Andorra are now operating at 100% capacity, making this one of the strongest winterperiods the Pyrenees have seen in recent years. Following a week of sustained snowfall, the country currently offers a total of 308 kilometres of open pistes, with … Continue reading \"Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base\" The post Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base appeared first o",
      "content": "Andorra Snow Update: 100% of Slopes Open, Up to 200 cm Base All ski resorts in Andorra are now operating at 100% capacity , making this one of the strongest winterperiods the Pyrenees have seen in recent years. Following a week of sustained snowfall, the country currently offers a total of 308 kilometres of open pistes , with snow depths exceeding one metre at resort level and reaching up to 200 cm at higher elevations . The view of Ordino Arcalis. 27th January 2026. Photo: Grandvalira Resorts. Andorra Snow Update: 100% of Slopes Open with Up to 200 cm Base. Across the main ski areas: Grandvalira Resorts has all 215 km of slopes fully open Pal Arinsal is operating with complete piste and lift access Ordino Arcalís reports the deepest snowpack, with bases up to 200 cm Conditions across the resorts are described as fully wintery , with excellent coverage, consistent snow quality, and strong conditions both on and off the main pistes. Forecasts also point to additional snowfall in the com",
      "pub_date": "2026-01-28",
      "id": "f0ef59ab9d06",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-28"
    },
    {
      "source": "SnowBrains",
      "title": "onX Backcountry Expands Beacon Guidebooks Content With Hundreds of New Ski Routes for 2025-26 Season",
      "url": "https://snowbrains.com/onx-backcountry-expands-beacon-guidebooks-content-with-hundreds-of-new-ski-routes-for-2025-26-season/",
      "description": "onX Backcountry has released a major expansion of Beacon Guidebooks content for the 2025-26 ski season, adding hundreds of newly curated backcountry ski routes across Colorado and Washington, the company announced on January 21. The update, now available in the onX Backcountry app, significantly expands access to vetted route information in complex mountain terrain, pairing Beacon Guidebooks’ expert-authored ski descents […] The post onX Backcountry Expands Beacon Guidebooks Content With Hundred",
      "content": "onX Backcountry’s expanded Beacon Guidebooks content adds hundreds of curated ski routes across Colorado and Washington for the 2025-26 season, integrating expert route beta with in-app navigation and avalanche tools. | Photo: onX onX Backcountry has released a major expansion of Beacon Guidebooks content for the 2025-26 ski season, adding hundreds of newly curated backcountry ski routes across Colorado and Washington, the company announced on January 21. The update, now available in the onX Backcountry app , significantly expands access to vetted route information in complex mountain terrain, pairing Beacon Guidebooks’ expert-authored ski descents with onX’s navigation and avalanche safety tools. According to the company, the additions are designed to help backcountry skiers and splitboarders plan trips more effectively and adapt to changing snowpack and weather conditions throughout the season. Related: How Backcountry Ski Guidebooks Get Written Major Updates in Colorado The most sub",
      "pub_date": "2026-01-28",
      "id": "0b3af6b84df0",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Unofficial Networks",
      "title": "Do You Recognize These 2 Ski Thieves?",
      "url": "https://unofficialnetworks.com/2026/01/28/ski-thieves-caught-on-camera/",
      "description": "Two thieves were caught on security camera nabbing a pair of Armada skis at Ski Lakeridge near Toronto, Canada.",
      "content": "Two thieves were caught on security camera nabbing a pair of Armada skis at Ski Lakeridge near Toronto, Canada. The duo appears to walk past a rack of skis and deliberate for a moment before walking back and picking up a pair of skis each. The poster only alleges one pair of skis missing, so one pair might have actually belonged to them (though that’s not a guarantee) . View this post on Instagram A post shared by Darlene Shaw (@dar_lana) It is possible that they accidentally took a pair of skis that didn’t belong to them, but the speed at which they leave the area after picking up the pair seems to indicate otherwise. If you’re the thieves in this video, or you’re realizing that you accidentally took the wrong pair of skis, reach out to the poster ( @dar_lana ) to return them. If you know the people in this video, report them. Ski resorts tend to feel like one of few places you can safely leave your gear behind without the threat of theft. If people start stealing skis and snowboards ",
      "pub_date": "2026-01-28",
      "id": "e3b308dd1dcc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "canada"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Snow Industry News",
      "title": "National Ski Patrol Highlights Training Behind On-Mountain Response",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/national-ski-patrol-highlights-training-behind-on-mountain-response/",
      "content": "January is National Safety Month for the ski industry, and National Ski Patrol (NSP) is highlighting the rigorous medical and rescue training that prepares patrollers and that forms the backbone of every safety response on the mountain. With more than 30,000 members, NSP delivers one of the industry’s most advanced education pipelines — one that prepares patrollers not only to respond to emergencies, but to help ski areas operate confidently in a high-consequence environment. Patrollers are trained as mountain-safety professionals, combining advanced medical skills with technical rescue capabilities, operational awareness, and risk-management expertise, which collectively enhancen the safety of every guest on the slopes. “A safe day on the slopes starts long before anyone puts on skis and a helmet,” said Stephanie Cox, CEO of the National Ski Patrol. “Our patrollers put in hundreds of hours of training, so they’re ready for whatever the mountain throws at them. When a ski area knows it",
      "pub_date": "2026-01-27",
      "id": "948f6da2617d",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "business-investment"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "PlanetSKI",
      "title": "The Latest PlanetSKI Snow Report",
      "url": "https://planetski.eu/2026/01/27/the-latest-planetski-snow-report-2/",
      "description": "Our latest rolling snow report is out and we hear today from Canada and the USA. NEW The post The Latest PlanetSKI Snow Report appeared first on PlanetSKI .",
      "content": "Tuesday 27th January PlanetSKI has moved on from its current winter base near Banff in Alberta, Canada. We have been reporting on conditions in the resorts of Lake Louise , Sunshine Village and Mt Norquay . Now we’re off on little road trip to neighbouring British Columbia and then swinging back through the town of Jasper and its ski resort of Marmot Basin in Alberta. PlanetSKI editor, James Cove, starts in one of his favourite resorts in Canada. So, where might that be? View this post on Instagram A post shared by PlanetSKI (@planetski.eu) What James didn’t mention in the video was that it has been, er, rather chilly. The temperature was -9c, but it felt more like -14c in the wind chill. Fortunately Revelstoke has a few of these very welcome places – warming huts. Revelstoke, Canada. Image © PlanetSKI Revelstoke, Canada. Image © PlanetSKI Revelstoke, Canada. Image © PlanetSKI Tomorrow, weather permitting, we’re planning to boot up here: Revelstoke, Canada. Image © PlanetSKI That gives",
      "pub_date": "2026-01-27",
      "id": "8b1ba9caacde",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "canada",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "The Ski Guru",
      "title": "Panda Optics RS2 Goggles Review: Tested in Flat Light and Snowfall",
      "url": "https://www.the-ski-guru.com/2026/01/28/panda-optics-rs2-goggles-review-flat-light/",
      "description": "I tested the RS2 ski goggles from Panda Optics during my Christmas holidays skiing in Pila (Aosta Valley) — and they genuinely ended up saving my ski day. I’ll be honest from the start: at first, I didn’t immediately understand how the lens-change system worked. You need to open a small side tab to release the lens. Once I realised … Continue reading \"Panda Optics RS2 Goggles Review: Tested in Flat Light and Snowfall\" The post Panda Optics RS2 Goggles Review: Tested in Flat Light and Snowfall ap",
      "content": "I tested the RS2 ski goggles from Panda Optics during my Christmas holidays skiing in Pila (Aosta Valley) — and they genuinely ended up saving my ski day. I’ll be honest from the start: at first, I didn’t immediately understand how the lens-change system worked. You need to open a small side tab to release the lens. Once I realised that, the whole system made sense. The lenses are held in place by very strong magnets , and once fitted, they feel solid and secure. Flat Light, Snowfall… and Why These Goggles Mattered The first day I used the RS2 goggles, visibility was really poor . Heavy snowfall combined with flat light meant the slope almost disappeared — that classic white-on-white situation where depth perception vanishes. I normally ski with sunglasses , switching to goggles only when it’s actively snowing. On sunny days, this is simply a personal preference. I also use an older pair of Panda sunglasses with interchangeable lenses, which I’m very comfortable with in good visibility",
      "pub_date": "2026-01-28",
      "id": "125349d76138",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [],
      "approved_date": "2026-01-29"
    },
    {
      "source": "SnowBrains",
      "title": "The Next Big Place For Freestyle Skiing Is…Ohio? A Look At Where The Olympics’ Team USA Is From",
      "url": "https://snowbrains.com/the-next-big-place-for-freestyle-skiing-is-ohio-a-look-at-where-the-olympics-team-usa-is-from/",
      "description": "With the opening ceremony of the Milano-Cortina Olympic Winter Games less than two weeks away, Team USA has finalized its list of 232 competitors, the largest contingent ever sent. Though more than 80 athletes live or train in Utah, only 17 of them identified Utah as their home state. Colorado is the state with the most athletes, at 30, and […] The post The Next Big Place For Freestyle Skiing Is…Ohio? A Look At Where The Olympics’ Team USA Is From appeared first on SnowBrains .",
      "content": "Team USA will send a record 232 athletes to Milano-Cortina. | Image: U.S. Ski & Snowboard With the opening ceremony of the Milano-Cortina Olympic Winter Games less than two weeks away, Team USA has finalized its list of 232 competitors, the largest contingent ever sent. Though more than 80 athletes live or train in Utah , only 17 of them identified Utah as their home state. Colorado is the state with the most athletes, at 30, and 32 states are sending at least one athlete. The origins of the athletes of Team USA give a unique look into where winter sports happen within the United States. Colorado is the state sending the most athletes to Milano-Cortina, but the Midwest will be well represented. | Image: Yahoo Sports Perhaps most surprising of all is that the four skiers competing in freestyle skiing are from Ohio, of all places. Though there may be more booters and sidehits on a single run in Utah than in all of Ohio, the Buckeye State is well represented in the women’s and men’s frees",
      "pub_date": "2026-01-28",
      "id": "e6643bf28247",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Unofficial Networks",
      "title": "Aspen Snowmass Employee Dies After On-Mountain Incident",
      "url": "https://unofficialnetworks.com/2026/01/28/snowmass-employee-dies-on-mountain/",
      "description": "An employee with Aspen Skiing Company died after an on-mountain incident at Snowmass on Thursday, January 22nd.",
      "content": "An employee with Aspen Skiing Company died after an on-mountain incident at Snowmass on Thursday, January 22nd, Aspen Public Radio reports. Rohan Verplank, a local ski instructor and coach, was skiing on the intermediate Lower Creekside run in the Two Creeks area when the incident occurred. Snowmass Ski Patrol and the Snowmass Village Police Department responded to the incident with the Aspen Skiing Company and Aspen Valley Health Emergency Room staff also providing assistance. “Our hearts are broken to share this news. Our deepest condolences are with the individual’s family and friends, as well as with all of our employees who knew and worked with him.” – Statement from Aspen One Verplank was 48-years-old. The cause and manner of death are currently under investigation by the coroner’s office. Our thoughts and deepest condolences are with the friends and family of the deceased at this time. Chalet Burns To The Ground In Verbier, Switzerland Categories: Aspen Snowmass Colorado Ski New",
      "pub_date": "2026-01-28",
      "id": "934181c201c4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "hospitality",
        "resort-operations",
        "international"
      ],
      "approved_date": "2026-01-29"
    },
    {
      "source": "Snow Industry News",
      "title": "Haglöfs Designs Olympic Race Suit For Swedish Alpine & Ski Cross Teams",
      "url": "https://www.snowindustrynews.com/articles/2026/jan/hagloefs-designs-olympic-race-suit-for-swedish-alpine-ski-cross-teams/",
      "content": "Haglöfs, official partner of the Swedish Olympic Committee (SOK), proudly deepens its role with the Swedish Olympic Team ahead of the 2026 Winter Olympics in Milano Cortina. Already responsible for the lightweight mittens worn by Swedish athletes throughout the Games, Haglöfs can now announce it has been entrusted with the prestigious assignment of designing the official race suit for Sweden’s alpine skiing disciplines and ski cross. Designed in close collaboration with Olympic Alpine and Ski cross athletes, with an unmistakable Swedish identity. Drawing inspiration from Sweden’s deep winter darkness, raw winter elements, and the explosive movement of alpine skiing as skis carve through snow, the design reflects both speed and precision — anchored in Haglöfs’ 111-year heritage of Scandinavian craftsmanship and innovation. The result is a race suit visually expressing the strength, confidence, and modern character of Swedish winter sports on the world’s biggest stage. “Being part of Swe",
      "pub_date": "2026-01-27",
      "id": "ea897e8113e4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "ski-history",
        "hospitality"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "PlanetSKI",
      "title": "Three More Avalanche Deaths in France",
      "url": "https://planetski.eu/2026/01/27/three-more-avalanche-deaths-in-france/",
      "description": "One man died in Tignes in the Alps, while two others perished in Le Grand Tourmalet in the Pyrenees. The avalanche death toll this month continues to rise. NEW The post Three More Avalanche Deaths in France appeared first on PlanetSKI .",
      "content": "In Tignes and off piste skier was caught in the Lavachet area that is above Tignes Le Lac. He was in a group and it is understood they triggered the avalanche themselves. He was the only one caught in the slide. Ski patrollers from the resort, who witnessed the avalanche, and were quickly on the scene and were joined by rescuers from the Compagnies Républicaines de Sécurité, CRS. PlanetSKI reader, David Morgan, alerted us to the incident and took these images. Avalanche in Tignes. Image c/o David Morgan. Avalanche in Tignes. Image c/o David Morgan. The victim, who was equipped with an avalanche transceiver, was found unconscious by the rescuers. Despite resuscitation attempts, the man was pronounced dead at the scene at 3:19 pm. He was a Spanish man in his 50s who was on holiday in the resort. He was the father of two children in their twenties. Avalanche in Tignes. Image c/o David Morgan. Avalanche in Tignes. Image c/o David Morgan. In the French Pyrenees two men, aged 60 and 70, died",
      "pub_date": "2026-01-27",
      "id": "2190b9997f8e",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "international"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}