{
  "updated": "2026-02-03 11:27:51",
  "total_articles": 24,
  "scoring_method": "keyword",
  "articles": [
    {
      "source": "Snow Industry News",
      "title": "Two New 6-Seater Chairlifts Open In Dachstein-West",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/two-new-6-seater-chairlifts-open-in-dachstein-west/",
      "content": "With the grand opening of the two new 6-seater chairlifts, Aussichtsberg and Angeralm, the Dachstein West ski region has reached another significant milestone in its tourism development. The two new lifts connect the ski resorts in Gosau (Upper Austria) and Annaberg (Salzburg) and thus serve as a powerful symbol of cross-border cooperation in alpine tourism. Since their commissioning last December, they have noticeably improved traffic flow in the ski area and provided a new, modern skiing experience. “With the new Aussichtsberg and Angeralm 6-seater chairlifts, Dachstein West has achieved a true vision for the future. These lifts are a visible sign that targeted investments in quality, safety, and guest comfort are having an immediate impact. The high level of guest satisfaction confirms that we are on the right track. Around €22 million was invested in the two new lifts. This sustainably strengthens Dachstein West's position as Upper Austria's largest ski region and as a high-perform",
      "pub_date": "2026-02-03",
      "id": "a22103710f5c",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "safety-incidents",
        "transportation"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "SnowBrains",
      "title": "Wrongful Death Lawsuit Filed After Skier Dies in Avalanche During Mount Bailey, OR, Cat-Skiing Trip",
      "url": "https://snowbrains.com/family-of-skier-killed-in-oregon-avalanche-files-wrongful-death-lawisuit/",
      "description": "A lawsuit was filed last Friday in Deschutes County Circuit Court and seeks over $14.5 million in damages for the death of Brian Thomas Roberts. He was killed in an avalanche on Mount Bailey near Diamond Lake, Oregon, on March 13, 2025. The lawsuit against Diamond Lake Improvement Company claims the conditions were too dangerous that day, and the guides told […] The post Wrongful Death Lawsuit Filed After Skier Dies in Avalanche During Mount Bailey, OR, Cat-Skiing Trip appeared first on SnowBrai",
      "content": "The family of a skier killed by avalanche in central Oregon has filed a wrongful death lawsuit. | Courtesy: Roberts Family A lawsuit was filed last Friday in Deschutes County Circuit Court and seeks over $14.5 million in damages for the death of Brian Thomas Roberts. He was killed in an avalanche on Mount Bailey near Diamond Lake, Oregon, on March 13, 2025. The lawsuit against Diamond Lake Improvement Company claims the conditions were too dangerous that day, and the guides told the group to disregard the report indicating a high level of avalanche danger that day. The lawsuit also says that Roberts showed signs of life, but the guides did not have an AED to resuscitate him. It goes on to say that one former guide expressed concerns about using guides with little or no experience at Mt. Bailey, but those were dismissed. Named in the suit are the Diamond Lake Improvement Company, California-based Sierra Wilderness Seminars Inc., and guides David Cressman, Rebecca Bastian, and Jackson Kr",
      "pub_date": "2026-02-03",
      "id": "2420acd1b481",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "business-investment"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "PlanetSKI",
      "title": "World Cup Alpine Ski Racing at Crans-Montana",
      "url": "https://planetski.eu/2026/02/03/world-cup-alpine-ski-racing-at-crans-montana/",
      "description": "PlanetSKI was slopeside at the Swiss resort last weekend for the final World Cup races before the Winter Olympics get underway this week. NEW The post World Cup Alpine Ski Racing at Crans-Montana appeared first on PlanetSKI .",
      "content": "Friday saw some snowfall, but sadly it led to the cancellation of the Women’s Downhill race. It followed several crashes including one to the current leader and favourite for Olympic gold – Lindsey Vonn . It remains to be seen if she can take part in the Olympic Downhill next weekend. Vonn’s Olympic return in doubt after crash The skies cleared overnight with glorious bluebird conditions on the Saturday and Sunday. World Cup racing at Crans-Montana. Image © PlanetSKI Crans-Montana went ahead with the World Cup races after much thought following the fire in a bar in the resort on New Year’s Eve. Over the race weekend it was confirmed that another person had died from their injuries, taking the toll to 41. Death toll from Crans-Montana fire rises to 41 Tributes were paid to those affected and changes were made to the schedule. Crans-Montana remembers The finish area was stripped of its usual vibrant color and advertising. Instead, white and black signs of mourning that read “Our thoughts",
      "pub_date": "2026-02-03",
      "id": "68a3cee612b7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "winter-sports",
      "secondary_categories": [
        "hospitality",
        "safety-incidents",
        "weather-snow"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "The Ski Guru",
      "title": "How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)",
      "url": "https://www.the-ski-guru.com/2026/02/03/how-to-use-avalanche-bulletins/",
      "description": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number, without fully understanding how to use the rest of the information to plan a safe mountain … Continue reading \"How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step)\" The post How to Use Avalanche Bulletins to Plan Your Mou",
      "content": "Before heading off-piste, ski touring, snowshoeing, or entering uncontrolled terrain, checking the avalanche bulletin is not optional — it is one of the most important safety steps you can take. Yet many skiers and riders still look only at the danger number , without fully understanding how to use the rest of the information to plan a safe mountain day. This guide explains how to read and apply avalanche bulletins properly , what they can (and cannot) tell you, and where to find the official avalanche forecasts across Europe. What an Avalanche Bulletin Is — and What It Is Not An avalanche bulletin (or avalanche forecast) is a regional risk assessment , based on: snowpack observations recent avalanche activity weather patterns (snowfall, wind, temperature) terrain characteristics Swiss Avalanche Bulletin Update. Slf.ch. How to Use Avalanche Bulletins to Plan Your Mountain Day (Step-by-Step). It is not : a guarantee of safety a green light to ski steep terrain a precise description of e",
      "pub_date": "2026-02-03",
      "id": "8e3088d0ec9b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "Unofficial Networks",
      "title": "Chaotic Video Serves As Reminder To Be Aware Of Blind Spots While Skiing",
      "url": "https://unofficialnetworks.com/2026/02/02/blind-spot-while-skiing/",
      "description": "This blind spot created quite a mess after a skier or snowboarder wound up injured directly underneath it.",
      "content": "There are a lot of blind spots in skiing and snowboarding, whether they’re naturally caused by slopes or dips in the trail or man-made through terrain park features. These spots often turn into serious hazards, especially when someone wipes out beneath the slope. This blind spot created quite a mess after someone wound up injured directly underneath it. Several snowboarders came over the hill with the tiniest amount of time to slam on the breaks before reaching the group below, leading to multiple falls. View this post on Instagram A post shared by Anastasia (@5_star_family_adventures) The feature is a bit confusing and unclear, but it is evident that someone should have stood on top of the bulge and warned passing skiers and snowboarders of the situation below. Oblivious Worker Nearly Causes Major BMX Mega-Ramp Collision Categories: Skiing Snowboarding",
      "pub_date": "2026-02-02",
      "id": "8453961702d2",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "Ski Area Management",
      "title": "Andrew Nicolas Appointed CEO of Prinoth U.S. Snow Grooming Division",
      "url": "https://www.saminfo.com/news/sam-headline-news/andrew-nicolas-appointed-ceo-of-prinoth-u-s-snow-grooming-division",
      "description": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "content": "SAM Magazine—Tooele, Utah, Jan. 26, 2026—Prinoth named Andrew Nicolas as CEO of its U.S. snow grooming division in December. In his new role, Nicolas oversees snow grooming services and product distribution for the U.S. market. “With Andrew’s leadership, Prinoth continues to reinforce its position at the forefront of snow grooming technology, sustainability, and performance—supporting resorts, trail systems, and winter operators across in the United States and across the globe,” said Horst Halle",
      "pub_date": "2026-01-26",
      "id": "36ba6ffe2214",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations",
        "transportation"
      ],
      "approved_date": "2026-01-27"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended January 4, 2026",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/vail-resorts-reports-certain-ski-season-metrics-season-date-30",
      "description": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "content": "BROOMFIELD, Colo. , Jan. 15, 2026 /PRNewswire/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics from the beginning of the ski season through January 4, 2026 compared to the same prior year period through January 5, 2025 . The reported ski season metrics are for the",
      "pub_date": "2026-01-15",
      "id": "005f00a2903d",
      "prefilter_business_score": 0,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (boost: 5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "hospitality"
      ],
      "approved_date": "2026-01-15"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts",
      "url": "https://www.snowsports.org/dry-conditions-and-economic-headwinds-combining-to-blow-back-bookings-and-occupancy-at-western-mountain-resorts/",
      "description": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling […] The post Dry Conditions And Economic Headwinds Combining To Blow Back Bookings And Occupancy At Western Mountain Resorts appeared first on Snowsports Industrie",
      "content": "Winter Park, Colo. Dec. 16, 2025 – With the critically important holiday season coming up fast, Mother Nature has been unusually stingy with snowfall across most of the West. And despite the stock markets going gangbusters and savings accounts rising, other economic news, such as higher prices and lower job numbers have had a chilling effect on consumer confidence and pushed it to its lowest level since the pandemic. The combination has had a significantly negative impact across 17 western mountain communities in seven western states. The sobering news was released yesterday by DestiMetrics* in their monthly Market Briefing from Inntopia and includes data from approximately 28,000 lodging units in Colorado, Utah, California, Nevada, Wyoming, Idaho, and Montana. As of Nov. 30, the booking pace during November plunged 19.8 percent for arrivals in the next six months with declines in arrivals for all six months. “This ‘one-two’ punch from low snowfall and a troubled economy was a signific",
      "pub_date": "2025-12-16",
      "id": "1d9a748dbb2c",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "weather-snow"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "Alta Badia Gets Ready For Skiing In Spring In The Heart Of The Dolomites",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/alta-badia-gets-ready-for-skiing-in-spring-in-the-heart-of-the-dolomites/",
      "content": "In March and April, the days grow longer and weather conditions become particularly favourable for skiing. It is the ideal time to enjoy the mountains and the slopes of Alta Badia, in the heart of the Dolomites, a UNESCO World Heritage site, where excellent snow quality and meticulously groomed slopes ensure a high-level experience even at the end of the season. In recent years, Alta Badia has strengthened its position as a leading destination for alpine skiing, thanks to an offer that combines efficient infrastructure, high-quality services and an internationally recognised food and wine scene. As tradition dictates, the ski season in Alta Badia draws to a close with a series of unmissable events. SOMMELIER ON THE SLOPES The Sommelier on the slopes event aims to promote and further showcase the finest wines of South Tyrol. The final dates of the season are scheduled for 3, 10 and 31 March. The initiative combines unforgettable skiing on the slopes of Alta Badia with the tasting of som",
      "pub_date": "2026-02-02",
      "id": "dc66b70e21a5",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [
        "international",
        "business-investment"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "SnowBrains",
      "title": "Blue Mountain, ON, Conditions Report: Testing Out Alterra’s New Reserve Pass",
      "url": "https://snowbrains.com/blue-mountain-on-reservei-pass/",
      "description": "Report from Friday, December 26, 2025 Whether you love it, hate it, or are just hearing about it for the first time, Alterra’s Reserve Pass is likely here to stay. But if you don’t know what the Reserve Pass is, it takes a slightly different appearance at a variety of Alterra ski resorts, generally encompassing a dedicated priority lift line […] The post Blue Mountain, ON, Conditions Report: Testing Out Alterra’s New Reserve Pass appeared first on SnowBrains .",
      "content": "Looking down Juicer. If you knew where to go, you could quite literally have an entire trail to yourself. | Credit: Liam Abbott/SnowBrains Report from Friday, December 26, 2025 Whether you love it, hate it, or are just hearing about it for the first time, Alterra’s Reserve Pass is likely here to stay. But if you don’t know what the Reserve Pass is, it takes a slightly different appearance at a variety of Alterra ski resorts, generally encompassing a dedicated priority lift line and exclusive amenities. It’s an intriguing concept, and one that makes sense in an ever-growing segmented ski resort product lineup. But this obviously comes at an additional cost, and has been met with its fair share of controversy since it was announced this past fall. Related: Are ‘Premium Ski Pass Add-Ons’ Coming to More Alterra-Owned Resorts? So, before I formed my own opinion on this new product offering, I thought it was only fair for me to try it out myself at Blue Mountain , a lesser-known yet flagship",
      "pub_date": "2026-02-02",
      "id": "0900bfcfd436",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "canada",
        "transportation"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "PlanetSKI",
      "title": "Death Toll from Crans-Montana Fire Rises to 41",
      "url": "https://planetski.eu/2026/02/02/death-toll-from-crans-montana-fire-rises-to-41/",
      "description": "A teenager who was injured in the Swiss ski resort on New Year's Eve has died in hospital. It takes the death toll to 41. The post Death Toll from Crans-Montana Fire Rises to 41 appeared first on PlanetSKI .",
      "content": "“An 18-year-old Swiss national died at a hospital in Zurich on January 31 st ,” said the Valais canton’s public prosecutor, Beatrice Pilloud, No further information would be released at this stage, she added. Most of the victims of the fire were young – eight were under the age of 16 – and many are still being treated in hospital for severe burns. 44 patients are being treated abroad. They include: 18 in France 12 in Italy, 8 in Germany 6 in Belgium. The Valais health ministry said that 37 patients were still in Swiss hospitals. Initial findings from an investigation suggest the fire began as sparklers attached to champagne bottles ignited soundproof foam that lined the ceiling of the bar’s basement. Authorities have acknowledged that the bar had not undergone safety checks for five years. The owners of the bar, Jacques and Jessica Moretti, have been accused by authorities of manslaughter by negligence, bodily harm by negligence and arson by negligence. Criminal proceedings have also b",
      "pub_date": "2026-02-02",
      "id": "4a8c7002bfc4",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "transportation"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "The Ski Guru",
      "title": "Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us",
      "url": "https://www.the-ski-guru.com/2026/02/02/avalanche-activity-france-switzerland-february-2026/",
      "description": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable, despite periods of fair weather and already-tracked slopes. Rather … Continue reading \"Avalanche Activity in France & Switzerland: What the Snowpack Is Telling Us\" The post Avalanche Acti",
      "content": "Late January – 1 February 2026 Over the past week, avalanche activity across the Alps has followed a clear and worrying pattern. From the Mont Blanc massif to the Queyras and across into the Swiss Valais, numerous skier-triggered and spontaneous avalanches point to a snowpack that remains structurally unstable , despite periods of fair weather and already-tracked slopes. Rather than isolated incidents, the reports collected since late January describe reactive slabs, remote triggers, and persistent weak layers affecting a wide range of aspects and elevations. Much of the recent instability is consistent with wind-loaded slabs and foehn-driven snow transport , which can rapidly overload weak layers and create large, reactive avalanche conditions. Further reading: Why Wind is one of the Most Dangerous Avalanches Triggers. Foehn Winds and Rising Avalanches in the Alps. This update summarises the most significant recent events and explains what they tell us about current conditions. Widesp",
      "pub_date": "2026-02-02",
      "id": "cacf361124bc",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "weather-snow",
        "international"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "Unofficial Networks",
      "title": "For Sale: Former New York Ski Area ($2.95 Million)",
      "url": "https://unofficialnetworks.com/2026/02/02/lost-ski-area-for-sale/",
      "description": "Last operated in the 1980s, the old lodge has been converted into an apartment complex. There are also many relics from its ski area days.",
      "content": "Stormville, New York — Are you looking for a place to live with skiable terrain? This former ski area is a good option. Priced at nearly $3 million, 3384 Route 52 is home to a piece of New York skiing history. The five-parcel property features the former Mount Storm Ski Area , which last operated in the 1980s. It closed due to a fire at the main base lodge and rising insurance costs. Arguably, the main attraction here is the basement of the main building. In the basement is the old ski rental shop, which still includes the old skis, boots, and signs. The building itself has been converted to three separate three-bedroom apartments. The land still features some relics of the ski area, including an abandoned lift and a snow groomer. The zoning with this former ski area is pretty interesting. Part of the land is an agricultural district for farm use. Other portions of the land are residential, which could lead to more residential or apartment development. While its lift-served ski days ar",
      "pub_date": "2026-02-02",
      "id": "10203f5b078f",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 9,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "business-investment",
        "ski-history",
        "safety-incidents"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "Ski Area Management",
      "title": "Jack Frost Big Boulder Appoints Tony Torsell as General Manager",
      "url": "https://www.saminfo.com/news/sam-headline-news/jack-frost-big-boulder-appoints-tony-torsell-as-general-manager",
      "description": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "content": "SAM Magazine—Blakeslee, Pa., Jan. 23, 2026—Vail Resorts has hired Tony Torsell as general manager of Jack Frost Big Boulder, effective Feb. 15. Torsell, who grew up not far from the neighboring ski areas, succeeds previous GM Tony Santora, who is now the vice president of mountain operations at VR-owned Beaver Creek, Colo. “Coming back home to lead JFBB is truly special,” said Torsell. “I believe great resorts start with great people, and I know there are great people here. I’m excited to roll u",
      "pub_date": "2026-01-23",
      "id": "d3f8cacc49d7",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-01-24"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Hot Dog Tower, Martini Lunch for Two and The Alpine Table: Vail Resorts Unveils New Era of Colorado Mountain Dining",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/hot-dog-tower-martini-lunch-two-and-alpine-table-vail-resorts",
      "description": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "content": "New food and beverage options blend bold flavors with local character across Breckenridge , Vail Mountain , Beaver Creek and Keystone New Outer Range Brewing Co. partnership taps Colorado's craft beer culture BRECKENRIDGE, Colo. , Dec. 18, 2025 /PRNewswire/ -- Coming this winter, Vail Resorts is",
      "pub_date": "2025-12-18",
      "id": "e3960925d508",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team",
      "url": "https://www.snowsports.org/kastle-usa-hires-industry-veteran-justin-heanue-to-lead-sales-team/",
      "description": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer […] The post Kästle USA Hires Industry Veteran Justin Heanue to Lead Sales Team appeared first on Snowsports Industries America .",
      "content": "In its ongoing drive to introduce more of Kästle’s ultra-premium and premium skis to the North American market, Kästle USA locks in a proven Alpine Sales Director in Justin Heanue. Portsmouth, NH, August 21, 2025 – Since it was relaunched to the North American market in 2007, Kästle has won renown as a top manufacturer of high-quality and high-performance skis for committed skiers. More recently, the brand has rededicated itself to the ultra premium and premium ski categories. To that order, effective immediately, Justin Heanue is Kästle USA’s Alpine Sales Director, working alongside President and CEO Steven Poulin in the new Portsmouth headquarters. Heanue joins Kästle after a lifetime in the industry—as a kid he cleaned rental boots at Pedigree Ski Shop under the supervision of his father. In college, he worked ski shop sales floors and fitted boots. A stint as a tech rep for Nordica followed. But his history with premium and ultra premium brands is most critical to Kästle’s path for",
      "pub_date": "2025-08-21",
      "id": "49d7a2d2d62b",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "business-investment",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Snow Industry News",
      "title": "A Taste Of Geneva: The Woodward x Hotel Jerome x Chateau Angelus Comes To Aspen This February",
      "url": "https://www.snowindustrynews.com/articles/2026/feb/a-taste-of-geneva-the-woodward-x-hotel-jerome-x-chateau-angelus-comes-to-aspen-this-february/",
      "content": "Hotel Jerome, Auberge Collection , welcomes the culinary sensibility of one of Europe's most celebrated kitchens to the heart of the Rockies with A Taste of Geneva, an exclusive two-night culinary experience created in collaboration with The Woodward, Auberge Collection , and Château Angelus . Taking place on February 11 and 12, 2026, in the Prospect dining room, the limited-seating dinners unite MICHELIN-starred cuisine and storied Saint-Émilion wines through a shared commitment to craftsmanship, culture, and personal hospitality. Event Details Dates: February 11 and 12, 2026 Reception: 6:30 p.m. Seated Dinner: 7:00 p.m. Location: Prospect at Hotel Jerome Pricing: $595 per person, inclusive Reservations: Available via Resy Seating: One seating per night, 60 guests per evening For two immersive evenings, acclaimed Chef Olivier Jean and Pastry Chef Titouan Claudet travel from the Three-MICHELEN key property, The Woodward in Geneva to Aspen's most legendary hotel, offering guests, in par",
      "pub_date": "2026-02-02",
      "id": "9441dbfaa801",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "hospitality",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "SnowBrains",
      "title": "Kicking Horse, BC, Report: Ridge Runs & Big Mountain Feels",
      "url": "https://snowbrains.com/kicking-horse-bc-report-ridge-runs-big-mountain-feels/",
      "description": "Report from January 29-30, 2026 Kicking Horse Mountain Resort does not necessarily ease you into its terrain. It presents itself plainly: steep, dramatic, and shaped by big weather and bigger lines (except those at the base of lifts, those are short). Riders here hardly have the opportunity to meander; they descend. Chutes spill directly into bowls, bowls funnel into groomers, […] The post Kicking Horse, BC, Report: Ridge Runs & Big Mountain Feels appeared first on SnowBrains .",
      "content": "Snow billows behind a rider at Kicking Horse Mountain Resort. | Photo: Kicking Horse Mountain Resort, Raw Agave Photography Report from January 29-30, 2026 Kicking Horse Mountain Resort does not necessarily ease you into its terrain. It presents itself plainly: steep, dramatic, and shaped by big weather and bigger lines (except those at the base of lifts, those are short). Riders here hardly have the opportunity to meander; they descend. Chutes spill directly into bowls, bowls funnel into groomers, and nearly every line demands intention. On weekdays, the mountain felt focused and quiet, rewarding riders who trusted their instincts and embraced the conditions. The resort’s lift-accessed alpine terrain possesses a severity that makes Kicking Horse Mountain Resort legendary. Short hikes unlock serious, exposed lines, while lower elevations offer a contrast of trees and open pitches. Returning to Kicking Horse reminds me what makes it such an iconic resort: an undiluted alpine experience.",
      "pub_date": "2026-02-02",
      "id": "52368283a5c5",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 7,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "canada",
      "secondary_categories": [
        "resort-operations"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "PlanetSKI",
      "title": "PlanetSKI’s February Snow Report",
      "url": "https://planetski.eu/2026/02/02/planetskis-february-snow-report/",
      "description": "We're in Canada where it has warmed up. In the Alps winter seems to be getting back on course. NEW The post PlanetSKI’s February Snow Report appeared first on PlanetSKI .",
      "content": "Sunday 1st February We start in Canada where the heavy snowfall and cold temperatures of earlier in the season are a distant memory. PlaneSKI’s James Cove has been skiing the resorts around Banff this weekend. On Sunday it was the local ski hill to Banff – Mt Norquay : View this post on Instagram A post shared by PlanetSKI (@planetski.eu) On Saturday he was skiing in Sunshine Village where there had been a few centimeters of snow that freshened things up nicely. Sunshine Village, Canada. Image © PlanetSKI There was even a spot of fresh powder if you know where to look. Sunshine Village, Canada. Image © PlanetSKI At the very top of the resort at 2,398m the temperature remained cold in the wind. Sunshine Village, Canada. Image © PlanetSKI Sunshine Village, Canada. Image © PlanetSKI Over in the Alps it has been generally cloudy with some modest snowfalls, but things are picking up and this week should see heavy snow in the southern Alps. It is due to start late on Monday. Let’s not forget",
      "pub_date": "2026-02-02",
      "id": "b094f158d2c6",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "canada",
        "international"
      ],
      "approved_date": "2026-02-02"
    },
    {
      "source": "Unofficial Networks",
      "title": "Snowboarder Falls From Chairlift At Mammoth Mountain",
      "url": "https://unofficialnetworks.com/2026/02/02/snowboarder-falls-from-chairlift/",
      "description": "A pretty intense moment was captured on camera at Mammoth Mountain as a young snowboarder fell from a chairlift to the ground below.",
      "content": "A pretty intense moment was captured on camera at Mammoth Mountain in California this weekend, as a young snowboarder fell from a chairlift to the ground below. The mountain staff quickly rushed to assist, setting up padding and a net below to catch the individual as she fell, but she wound up mostly missing the net and falling near directly to the ground. @hellokristen Today at Mammoth 1/31/26 I wasn’t going to post this but I know so many people who argue with me about putting the bar down. It’s mandatory in Europe and it should be here. #snowboard #ski #mammoth #mammothmountain #skilift ♬ original sound – Hello Kristen The video was shared by influencer Hello Kristen , who used the incident to discuss the importance of putting the bar down. However according to several comments, the bar not being down wasn’t the issue. One person in the comments claimed to be the mother of the 12-year-old snowboarder who fell. According to her comment, she girl slipped right as she boarded the lift,",
      "pub_date": "2026-02-02",
      "id": "271f506287b0",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "resort-operations",
      "secondary_categories": [
        "international"
      ],
      "approved_date": "2026-02-03"
    },
    {
      "source": "The Ski Guru",
      "title": "Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain",
      "url": "https://www.the-ski-guru.com/2026/01/31/winter-mountain-safety-guide/",
      "description": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing.They are also complex, constantly changing environments, where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety, helping skiers, snowshoers and … Continue reading \"Winter Mountain Safety Guide: Skiing, Snowshoeing & Nordic Terrain\" The post Winter Mountain Safety G",
      "content": "Winter mountains offer some of the most rewarding experiences in the Alps — from skiing and ski touring to snowshoeing and cross-country skiing. They are also complex, constantly changing environments , where risks are not always obvious and are not limited to one activity. This guide provides a clear, practical overview of winter mountain safety , helping skiers, snowshoers and Nordic users better understand terrain, conditions and context . It is written for awareness — not blame — and is designed to be read alongside official safety advice and avalanche bulletins. 1. Winter mountain risk goes beyond marked pistes A common misconception is that avalanche danger only concerns off-piste or backcountry skiers. In reality: Avalanches can cross groomed ski pistes Snowshoe routes may pass beneath steep, uncontrolled slopes Cross-country ski tracks can lie within avalanche run-out zones Valley floors, access roads and ice-climbing approaches may all be exposed Several recent accidents in th",
      "pub_date": "2026-01-31",
      "id": "51f89304d637",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 1,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +1)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "safety-incidents",
      "secondary_categories": [
        "resort-operations",
        "transportation",
        "winter-sports"
      ],
      "approved_date": "2026-01-31"
    },
    {
      "source": "Ski Area Management",
      "title": "Feast, Famine Conditions Shape MLK Business",
      "url": "https://www.saminfo.com/news/sam-headline-news/feast-famine-conditions-shape-mlk-business",
      "description": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "content": "SAM Magazine—Happy Valley, Ore., Jan. 21, 2026— Massanutten The 2026 Martin Luther King Jr. holiday weekend presented a stark geographical divide across North American ski areas. Based on a cross-continent survey of operators and regional associations, the weekend was defined by record-breaking snowfall and “all-time” attendance in the East, contrasted against a historic snow drought in the West that forced creative operational pivots and a reliance on non-skiing revenue. The Mid-Atlantic In the",
      "pub_date": "2026-01-21",
      "id": "040723b1db45",
      "prefilter_business_score": 1,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "weather-snow",
      "secondary_categories": [
        "ski-history",
        "business-investment"
      ],
      "approved_date": "2026-01-21"
    },
    {
      "source": "Vail Resorts Investor Relations",
      "title": "Heavenly Mountain Resort Celebrates 70th Anniversary with Jam-Packed Lineup of High-Energy Events and Music All Season Long",
      "url": "https://investors.vailresorts.com/news-releases/news-release-details/heavenly-mountain-resort-celebrates-70th-anniversary-jam-packed",
      "description": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "content": "Celebrations kick off Dec. 20 with a headlining DJ set with Foster the People Media Assets: Heavenly Signature Photos SOUTH LAKE TAHOE, Calif. , Dec. 16, 2025 /PRNewswire/ -- Heavenly Mountain Resort turns 70 this winter, and with skiing and riding now underway, the party is just getting started.",
      "pub_date": "2025-12-16",
      "id": "96801cd03f7a",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 5,
      "score": 10,
      "score_details": {
        "reason": "Keyword scoring (source: +5)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "ski-history",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    },
    {
      "source": "SIA - Snowsports Industries America",
      "title": "The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich",
      "url": "https://www.snowsports.org/the-winter-sports-sustainability-networks-annual-meeting-a-report-from-munich/",
      "description": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was […] The post The Winter Sports Sustainability Network’s Annual Meeting: A Report from Munich appeared first on Snowsports Industries Am",
      "content": "Last week, the SIA team attended the Ski Industry Climate Summit, hosted by Atomic, and the Winter Sports Sustainability Network’s (WSN) winter meeting during ISPO in Munich. Over 200 ski industry leaders came together, showcasing remarkable collaboration among the sector’s biggest hardgoods brands – united to share ideas, data, and best practices. The focus was clear: the most effective way that the global winter outdoor industry can implement large-scale sustainability and climate action measures is by coming together to collaborate and share the expertise we have. A large part of this urgency is driven by the upcoming EU sustainability regulations, which will enforce stricter requirements on disclosure, traceability, waste, circularity, deforestation, and more. Notably, these regulations affect not only EU-based businesses but also U.S. companies operating in the European market. SIA’s role at the summit was to deepen understanding of these changes, highlight the responsibilities of",
      "pub_date": "2024-12-12",
      "id": "c0daeacca788",
      "prefilter_business_score": 0,
      "is_macro_relevance": false,
      "source_boost": 2,
      "score": 8,
      "score_details": {
        "reason": "Keyword scoring (source: +2)",
        "method": "keyword"
      },
      "score_method": "keyword",
      "category": "international",
      "secondary_categories": [],
      "approved_date": "2026-01-21"
    }
  ]
}